{
  "url": "https://www.depaul.edu/distinctions/Pages/articles.aspx",
  "title": "\r\n\tDistinctions  |  Distinctions  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Distinctions S.O.S for At-Risk Teens Learn how our program helps at-risk teens reduce stress, anxiety and aggression. Protein Puzzles Discover how studying a protein may lead to curing and preventing Alzheimer's disease. Global Health and Human Rights Find out why researchers are working to eliminate health disparities around the world. Above and Beyond Dive into the field of art and cultural heritage law with center director Patty Gerstenblith. The Big Deal about Big Data Learn about the importance of Big Data from Marina Girju of DePaul's Driehaus College of Business. Business Ethics with Religious Sensibility Two DePaul professors are bridging religion and business ethics in a new publication. First Fellow Bin Jiang, a management professor, talks about his decision to join DePaul in 2004 and his new role as the first Driehaus Fellow. Role Model Nan Cibula-Jenkins’s impressive career in costume design brings invaluable experience into the classroom. Ethics Exam: When Ordinary People Commit Extraordinary Crimes Kelly Pope and Rick Salisbury’s award-winning 2011 educational documentary provides a framework for examining ethical dilemmas. Taking Art to the Streets Associate professor Jim Duignan’s Stockyard Institute has grown into a model for arts education over the past two decades. Gone Fishing Today, Professor Aguirre’s evolutionary research sheds new light on the history of freshwater fishes. Enabling Sustainable Change Lexa Murphy and other DePaul University faculty hope to eventually work themselves out of their jobs fighting HIV and AIDS in Kenya. A Fair Fight College of Communication professor Matt Ragas received a 2011 award for his dissertation studying parallels between the news media and corporations. Ahead Of The Curve DePaul’s Center for Data Mining and Predictive Analytics links the university with industry partners and provides fantastic opportunities for its students. Mission to Mars Suzanne Bell discusses her research and how it is contributing to long-distance space exploration. Health Informatics Enid Montague discusses the Health Informatics program’s distinctive value. Supply Chains on Steroids Nezih Altay discusses solutions to bring relief to devastated places and people."
}