{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/sports-business.aspx",
  "title": "\r\n\tSports Business | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Sports Business Sports Business Become a game-changer in business The DePaul Sports Business major will prepare you to succeed in the ever-evolving sports industry. Our expert faculty will teach you how to apply the skills you learn in your coursework to countless careers in a field that continues to grow in both size and complexity. With an increasing need for leaders who have a wide range of transferable skills, our Sports Business degree program will help open doors for you in each of these areas: accounting business analytics economics entrepreneurship events hospitality leadership management marketing operations sales As you work towards your Sports Business degree, you’ll take a variety of Driehaus College of Business courses in addition to electives in the College of Communication, which will provide you with real-world, interdisciplinary knowledge and skills that combine communication with business theory. You’ll have access to global organizations such as: Chicago Bears Chicago Blackhawks Chicago Bulls Chicago Cubs Chicago White Sox Gatorade McDonald’s 4Front Paragon Marketing Group The Premier League Wilson Sporting Goods KemperLesnik These companies will link you with industry leaders and give you practical experience to apply to the workplace. And you’ll have access to a deep pool of local and national connections, which will help you land internships, networking opportunities and full-time jobs. For international students: this program is a STEM-designated program, which can qualify you to extend your post-graduation stay in the United States. Classes Coursework Behind the Scenes with Chicago Sports Organizations The Business of Esports The Chicago Cubs Summer Consulting Project Event Sales, Service and Promotion Exploring Economics and Statistics Through Sports Hospitality Service and Experience Management Introduction to Sports Management The International Business of Sports in London Leadership in Sports: Lessons for Coaching in the Workplace Sports, Media, and Society Sports Sales Sports Sponsorship Marketing Resources Major Requirements Schedule of Classes Department Website Minor offered Combined bachelor’s + master’s degree offered Career Options Common Career Areas Athlete/Team Foundation Management Brand Strategy Community Relations Event Marketing Fan Engagement New Product Development Revenue Planning Sales Sponsorship Evaluation Sports Tourism Venue Management Get more information Complete the form below to receive more information about this degree program."
}