{
  "url": "https://www.depaul.edu/admission-and-aid/types-of-admission/transfer-student/university-center-partnerships/university-center-of-lake-county/Pages/uc-lake-county-degree-programs.aspx",
  "title": "\r\n\tDePaul Programs Offered at University Center of Lake County  |  University Center of Lake County  |  University Center Partnerships  |  Transfer Student  |  Types of Admission  |  Admission & Aid  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Transfer Student Prepare to Transfer Transferring Your Courses Meet Your Transfer Counselor DePaul Admission Partnership Program University Center PartnershipsUniversity Center at Harper CollegeUniversity Center of Lake County University Center at Harper College University Center of Lake County For Advisors Apply Online Request Info Visit Campus DePaul University>Admission & Aid>Types of Admission>Transfer Student>University Center Partnerships>University Center of Lake County>DePaul Programs Offered at University Center of Lake County DePaul Programs Offered at University Center of Lake County DePaul has developed degree programs with working professionals and career changers in mind—making sure you can get to where you want to go. We recognize how busy you are. And we’re here to help. Our counselors and advisors will give you the road map and resources you’ll need to successfully complete your DePaul degree. Choose from one of the following DePaul degree programs at University Center: Undergraduate Bachelor of Arts in Professional Studies with a major in Business Administration Professional Studies BA with theSchool of Continuing and Professional Studies The Business Administration program will help you develop the leadership and managerial skills you need to advance your career. You’ll learn about different functional areas within business, such as technology, project management, marketing and operations. View course preparation information Graduate Master’s Entry to Nursing Practice (MENP) program College of Science and Health The Master’s Entry to Nursing Practice (MENP) program is for college graduates who want to become nurses. In the program, you’ll gain leadership skills and research expertise while you develop the tools you’ll need to excel as a nurse in any specialty you choose. View course preparation information"
}