{
  "url": "https://www.depaul.edu/distinctions/Pages/curve.aspx",
  "title": "\r\n\tAhead Of The Curve  |  Distinctions  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Ahead Of The Curve DePaul’s Center for Data Mining and Predictive Analytics links the university with industry partners and provides fantastic opportunities for its students. The timing is right for DePaul’s Center for Data Mining and Predictive Analytics and a complementary MS program, as Daniela Raicu, associate professor and the center’s director, explains. “A few years ago, some of us were working on forward-thinking projects in data mining, and students who’d taken our data mining classes were getting good jobs. At the same time, companies began to recognize their need for data mining, and the demand for capabilities in predictive analytics started growing fast. Now, data is everywhere, and companies in all types of industries need people educated about data if they hope to be competitive.” The center is a joint venture involving faculty from the School of Computing (CDM) and the Department of Marketing—professors doing applied research and teaching classes in data mining, predictive analytics, and business intelligence. The center will give their work visibility, while attracting support from industry partners and providing professional opportunities for students. Graduates of the MS program will acquire skills required for a career in predictive analytics, hence making them very valuable in today’s data-intensive enterprises. “Our MS program is very rigorous, while the center will become an amazing pipeline for matching students with great jobs.” Raffaella Settimi, associate professor, DePaul University Bamshad Mobasher, professor and the center’s associate director for research, agrees that both initiatives are particularly relevant: “In many areas, innovation moves from academia to industry; over time, research finds an application. For data mining, the opposite is true: companies are coming to academics for analytical solutions. The center and the MS will give DePaul stronger connections with industry, and our students will gain significant career advantages.” This Twist Makes A Difference Multiple interactions — between CDM and the Department of Marketing, between the center and the MS program, and between the center and industry — make both initiatives stand out. “We’re merging expertise from two sides — analytics and marketing — to create both a dynamic, applied research environment and an enriched MS degree, one of the few in the U.S.,” says Raffaella Settimi, associate professor and the center’s associate director for academic relations. “Our MS program is very rigorous, while the center will become an amazing pipeline for matching students with great jobs.” Sue Fogel, chair of the Department of Marketing and the center’s associate director for industry relations, agrees that the connection between the center and the MS is particularly valuable: “Research being done in the center will find its way into the classroom: faculty in the center are teaching many of the classes in the MS program and overseeing the curriculum development. In both initiatives, the focus is on solving real-world problems. Instead of just being trained in the quantitative skills, our graduates will also gain the business and marketing perspectives to know how to use data strategically and on the job. The center and the MS degree — each distinctive, but together truly powerful—are already proving very attractive to a lot of businesses.” Mobasher adds his perspective on the industry connection: “In the center, our corporate partners will provide resources—funding, data, technology, even scholarships. In exchange, we’ll share our applied research and expertise. At the same time, we’re developing a database of student profiles, documenting their classes taken, areas of interest, and expertise or specialization; our partners will have access to this information and to students they might want to hire. No wonder companies like IBM are signing up!” “When companies need talent, they’ll come to us,” concludes Settimi. Just The Beginning The team is already thinking about next steps for the center. “We’d like to become an Industry University Collaborative Research Center funded by the National Science Foundation,” says Raicu. “In this model, several universities work together with industry leaders on data mining projects — not surprisingly, there are only a few in the U.S. But all the benefits we’re already realizing would be magnified: students would get even more experience, more connections to industry, more networking, and more job opportunities; our teachers would work on larger projects with more impact on society. That’s our long-term goal.” ■ Learn what makes DePaul Distinctive Global Health and Human Rights Find out why researchers are working to eliminate health disparities around the world. Protein Puzzles Discover how studying a protein may lead to curing and preventing Alzheimer’s disease."
}