{
  "url": "https://www.depaul.edu/admission-and-aid/types-of-admission/transfer-student/university-center-partnerships/university-center-of-lake-county/Pages/baps-business-administration.aspx",
  "title": "\r\n\tCoursework Preparation: Bachelor’s Degree Completion in Business Administration  |  University Center of Lake County  |  University Center Partnerships  |  Transfer Student  |  Types of Admission  |  Admission & Aid  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Transfer Student Prepare to Transfer Transferring Your Courses Meet Your Transfer Counselor DePaul Admission Partnership Program University Center PartnershipsUniversity Center at Harper CollegeUniversity Center of Lake County University Center at Harper College University Center of Lake County For Advisors Apply Online Request Info Visit Campus DePaul University>Admission & Aid>Types of Admission>Transfer Student>University Center Partnerships>University Center of Lake County>Coursework Preparation: Bachelor’s Degree Completion in Business Administration Coursework Preparation: Bachelor’s Degree Completion in Business Administration ​​DePaul University and University Center of Lake County have created a partnership to provide degree programs popular at both schools to students on the University Center campus. As a Professional Studies/Business Administration major, you should complete the associate degree or the IAI - General Education Core Curriculum (GECC) and a few introductory courses in Business Administration at College of Lake County. After beginning DePaul’s cohort program, the majority of classes you’ll take will be Professional Studies/Business Administration courses. Bachelor of Arts in Professional Studies (BAPS) Major in Business Administration The BAPS in Business Administration is a good fit for you if you’ve taken some business courses or have completed the fast track business program at College of Lake County. This program does not require that you have previous business coursework. You should plan to take up to 66 semester/99 quarter hours in general education and business courses at College of Lake County. After completing your studies at College of Lake County, you’ll complete approximately 24 DePaul courses: professional studies business administration requirements business administration electives general education and elective courses You will need to earn 192 quarter hours for a DePaul’s bachelor degree. DePaul’s classes in this program are scheduled to meet two evenings a week as a part-time program, with some courses being offered online. Learn more Want to learn more about this program? Request more information."
}