{
  "url": "https://www.depaul.edu/admission-and-aid/types-of-admission/transfer-student/transferring-your-courses/Pages/trac.aspx",
  "title": "\r\n\tTransfer Articulation Center FAQ  |  Transferring Your Courses  |  Transfer Student  |  Types of Admission  |  Admission & Aid  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Transfer Student Prepare to Transfer Transferring Your CoursesTransfer GuidesCourse ListsTransferologyRecommended CoursesRecent Transfer Guides Course Lists Transferology Recommended Courses Recent Meet Your Transfer Counselor DePaul Admission Partnership Program University Center Partnerships For Advisors Apply Online Request Info Visit Campus DePaul University>Admission & Aid>Types of Admission>Transfer Student>Transferring Your Courses>Transfer Articulation Center FAQ Transfer Articulation Center FAQ DePaul’s Transfer Articulation Center (TrAC) reviews your files, undergraduate coursework and determines its transferability to DePaul—posting credits to your record. Understanding Your Posted Credits I’ve been accepted. When will I see my credits posted to my record? The majority of your coursework will be posted to your record within a week of your admission to DePaul. However, depending on when you applied, some courses may not be posted to your record until the end of your first quarter. What do “TRNS, 4RVW, No Rule and Rejected” mean? TRNS: You will receive credit for your course, but it won’t apply specifically toward any school or college at DePaul. 4RVW: A faculty is evaluating whether this course is equal to one at DePaul. You will receive transfer credit for all courses that are listed as 4RVW regardless of whether or not the course meets a specific DePaul equivalency. You may need to provide a syllabus in order for a decision to be made. No Rule: No action has been made and additional information may be necessary. If you see \"No Rule\" in the early stages of your admittance into DePaul, chances are that the course has yet to be reviewed. If you see that a course is \"No Rule\" after a majority of your courses have been posted and you are currently attending classes at DePaul, chances are there is information missing that you need to provide. Review your Transfer Credit Report in Campus Connect for additional information on what may be required by you in order to make an articulation decision. Rejected: TrAC has determined that the course is either not comparable to the academic objectives of DePaul University or is not a course we accept in accordance with the DePaul University transfer policies. No credit will be awarded. Some of my course equivalencies don’t look like normal classes. What does it mean if it says something like ART TR200? When a course you’ve taken does not match up to a DePaul course, but we find it is transferable and applicable to a specific DePaul department, we will make the course transferable into that department (in this case, ART) based on the level of the course (in this case, 200), and whether the course is transferable to DePaul’s Liberal Studies program. This means that a 200-level Art course may also be applicable to the Arts & Literature General Education requirement and be listed on your record as a general 200-level course that satisfies a Liberal Studies program requirement. Why didn’t I earn liberal studies credit for my course? TrAC looks at several factors when determining whether or not a course will count as a Liberal Studies course. The most important factor is how closely the course meets the goals and objectives of DePaul’s Liberal Studies program and, specifically, the goals and objectives of the Common Core or Learning Domain requirements. At DePaul, Liberal Studies courses and Learning Domains are the same as “general education” courses. Transfer Course Lists My institution is not listed in the Transfer Course Lists. Does that mean none of my courses will transfer to DePaul? No. If the institution you are attending or previously attended is regionally accredited, we will accept courses provided they meet our requirements. My institution is listed in the Transfer Course Lists, but my course is not. Does that mean the course will not transfer to DePaul? Not necessarily. We will review all of your courses and determine which ones will transfer to DePaul based on our requirements. Repeating Courses If I repeat a course at DePaul that I took at another institution and earn a worse grade, can I keep the higher grade? No. Regardless of any circumstance, the final attempt at taking a course is the only attempt that is eligible to earn credit. If I petition for the re-review of a course I completed at a different institution and it comes back as equivalent to a DePaul course I already completed, can I earn credit and be refunded my money for the DePaul course or earn credit for both courses? No. Petitions of re-reviews do not guarantee a course will be transferred to DePaul. No refunds are given for courses accepted under a re-review. Regardless of any circumstance, the final attempt at taking a course is the only attempt that is eligible to earn credit. And you cannot earn multiple credits for a course that is not considered repeatable in accordance with the University Catalog. Placement Tests Am I exempt from taking placement tests? Review theTest Exemption Gridto see whether or not you’ve satisfied all of the requirements that will exempt you from taking a placement test. Transfer Credit for Current Students Completethis formif you are a current student and plan to take courses at another institution (e.g., summer courses at a community college or a non-DePaul study abroad program). If you are studying abroad on a non-DePaul program, upload the completed form to your Transfer Credit Application toStudy Abroad. More Questions? If you have questions about how courses apply to your major, time it will take to complete your degree or how to transfer into another school or college at DePaul, please wait until you’ve completed orientation. If you’ve already attended, contact us: Email:TrAC@depaul.eduTwitter:@DePaulTrACFacebook:DePaulTrAC *Note: If you have questions about the transferability of graduate level coursework toward a graduate degree program, please contact the individual graduate program you’re looking to transfer to for more information. TrAC only determines the articulation of external undergraduate coursework."
}