{
  "url": "https://www.depaul.edu/about/administration/Pages/dettori.aspx",
  "title": "\r\n\tLucia Dettori, PhD | DePaul University, Chicago\r\n",
  "content": "About Rankings Campuses Chicago Events Mission President Administration Distinctions History & Timeline Accreditation & Licensure Apply Online Request Info Visit Campus DePaul University>About>Administration>Lucia Dettori, PhD Lucia Dettori, PHDInterim Dean,Jarvis College of Computing and Digital MediaWebsite Lucia Dettori, PHD Interim Dean,Jarvis College of Computing and Digital Media Lucia Dettori became interim dean of the Jarvis College of Computing and Digital Media in July 2022. An associate professor in CDM’s College of Computing, she joined DePaul in 2000 and has served as an associate dean at CDM since 2007. Before joining CDM, Dettori held visiting positions at Brown University and Southern Methodist University. Born and raised in Italy, Dettori earned her bachelor's and master's degrees in applied mathematics from the University of Parma. She has a PhD in applied mathematics from the University of Paris XI in France. Her research interests span from computational fluid dynamics to medical image processing and computer science education. She has published extensively in those areas and is the recipient of multimillion dollars in grants from federal agencies and private companies, including the National Science Foundation, CME Foundation, IBM and Google. A recognized national leader in computer science education, Dettori has made it a priority throughout her career to make computing accessible to all. She is a co-founder of theChicago Alliance for Equity in Computer Science​, also known as CAFÉCS. This collaboration between DePaul, University of Illinois, Loyola University, Chicago Public Schools and the Learning Partnership aims to give all Chicago students access to a high-quality computer science education. True to her passion, Dettori helped spread equity-focused, inquiry-based introductory computer science curriculum throughout CPS. In 2018, Dettori took a sabbatical from teaching at DePaul to serve as the director of the Office of Computer Science at CPS. In the first 10 years of the project, more than 90,000 CPS high school students have taken the introductory computer science course. More than 200 CPS teachers also have received training. As a result of CAFÉCS' efforts, computer science is now a high school graduation requirement for all CPS students."
}