{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/sports-communication.aspx",
  "title": "\r\n\tSports Communication | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Sports Communication Sports Communication Gain a competitive edge in sports communication The Sports Communication program will prepare you for career opportunities in the sports industry. As you work towards your degree in Sports Communication, you’ll learn to view sports as a business, and how companies and sports organizations communicate and manage relationships with their fans, sponsors and the media. As a Sports Communication major, you’ll take College of Communication and Driehaus College of Business courses, which will provide you with interdisciplinary knowledge and skills that link communication and business theory. Living in Chicago, you’ll have access to world class media and global sports organizations such as the Bears, Blackhawks, Bulls, Cubs and White Sox. During coursework for your degree in Sports Communication, you’ll be introduced to a vast array of sports communication pros, many of whom are DePaul alums and can help you gain valuable internship experience. We also offer the 3+3 BA/JD Program, which allows high-achieving first-year undergraduate students to be admitted simultaneously to the College of Communication (CMN) and the College of Law (LAW). You’ll complete your first three years in CMN and your final three years in LAW. Classes Coursework Fox Sports University Introduction to Sports Management Sports Campaigns Sports Podcasting Sports Reporting Topics in Fan Studies Resources Major Requirements Schedule of Classes Department Website Concentrations/Tracks Sports Journalism Sports Promotion and Publicity Sports and Society Combined bachelor's + master's degree offered Career Options Common Career Areas Advertising Journalism Marketing Media planning/buying Media relations Sales management Social media Sports event planning Sportswriting or broadcasting Sports team public relations 100% of Sports Communication graduates were employed, continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program."
}