{
  "url": "https://www.depaul.edu/about/chicago/Pages/get-around-chicago.aspx",
  "title": "\r\n\tGet Around Chicago  |  Chicago  |  About  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "About Rankings Campuses ChicagoGet Around Chicago Get Around Chicago Events Mission President Administration Distinctions History & Timeline Accreditation & Licensure Apply Online Request Info Visit Campus DePaul University>About>Chicago>Get Around Chicago Get Around Chicago The cost to get around Chicago is included in tuition Chicagoisa big city, and at first it might seem overwhelming to navigate. But it’s pretty straightforward once you’ve spent a short time here. Easy on Your Wallet As a DePaul student, the cost to get around Chicago is included in tuition. You’ll get aU-Passat orientation, which gives you unlimited rides on CTA buses and trains for terms you’re enrolled. You won’t have to worry about the cost of traveling when you explore the city. Red, Brown or Purple Line Trains Classes are offered on the Lincoln Park and Loop campuses, so you’ll probably take the “L” or bus to class. Study, listen to music or people-watch while taking theRed Linetrain. It takes about 20 minutes to travel between campuses. Text, catch up on Instagram, or take snaps of the skyline and other historic buildings on the above-groundBrown or Purple Linetrains. It takes about 30 minutes to travel between campuses. Find out when the next train or bus is coming Chicago Transportation Options Students walk, take cabs and Uber, bike, skateboard, drive — you name it. Chicago public transit includes: Divvy— Chicago’s bike sharing system (Hint: Don’t forget thestudent discount!) Chicago Transportation Authority (CTA)— “L” trains, subway trains and buses Metra— Commuter trains to Chicago’s suburbs Traveling Beyond the City Headed out of town? It’s easy to get anywhere in the country or world from Chicago. Convenient options for discovering life beyond the city include: O’HareandMidwayairports Amtrak,GreyhoundandMegabus"
}