{
  "url": "https://www.depaul.edu/admission-and-aid/financial-aid/repay-loans/Pages/default.aspx",
  "title": "\r\n\tRepay Loans  |  Financial Aid  |  Admission & Aid  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Financial Aid Financial Aid Basics Types of Aid Receive Aid Maintain Eligibility Manage Costs Repay Loans Resources for... Forms Contact Us Apply Online Request Info Visit Campus DePaul University>Admission & Aid>Financial Aid>Repay Loans Repay Your Student Loans Exit Counseling You are required to complete personalized exit counseling if you have received aFederal Direct Loan,Federal Perkins Loan, or aFederal TEACH grantand: have applied for graduation, are leaving DePaul, either permanently or for a period of time, or are enrolled less than half time, either permanently or for a period of time. These three aid programs have their own exit counseling. If you received aid from multiple aid programs, youmustcomplete separate exit counseling for each. In this federally required exit counseling, you will learn about the next steps with your federal student loans and/or TEACH grant. The Office of Financial Aid will receive confirmation upon your completion of this requirement. We have partnered withStudent Connectionsto make the repayment process easier for you. Contact them with your loan repayment questions. Public Service and Teacher Loan Forgiveness Public Service Loan Forgiveness (PSLF) Congress created thePublic Service Loan Forgiveness (PSLF)program to encourage students to work full-time in public service jobs. Borrowers may qualify for forgiveness of the remaining balance due on their eligible federal student loans after they have made 120 payments on those loans under certain repayment plans while employed full time by certain public service employers. Review more information aboutPSLFand thePSLF Questions and Answersfor more information on the terms and conditions of the program and to understand what types of public service jobs qualify. Teacher Loan Forgiveness and Cancellation Programs There are two types of loan forgiveness programs for teachers: Teacher Loan Forgiveness for Federal Direct Subsidized Loans and Federal Direct Unsubsidized Loans Teacher Cancellation for Federal Perkins Loans See the U.S. Department of Education's comprehensive website detailingteacher loan forgiveness and cancellationoptions. Loan Repayment Started in October 2023 Federal student loan payments that were on a repayment pause due to the pandemic restarted in October and interest began accruing in September. Here’s what you can do now. Update yourcontact information Explore affordablerepayment plans Enroll (or reenroll) in auto pay by contacting your loan servicer. You will receive a .25% discount on your interest rate. Check if you qualify for a type oftargeted loan forgiveness VisitStudentAid.gov/restartfor more information about restarting federal student loan payments. Fresh Start Program The U.S. Department of Education (ED) created theFresh Start programto help eligible borrowers with defaulted federal student loans. Eligible students may regain aid eligibility in addition to other benefits. ED will contact borrowers directly with additional information and they will continue to update the Federal Student Aid website as more information becomes available. Thinking realistically about your student loan borrowing can help you make decisions now that will allow you to manage your loan repayment later. We encourage you to use Federal Student Aid’sLoan Simulatorto understand yourrepayment optionsand estimated monthly repayment amounts."
}