{
  "url": "https://www.depaul.edu/admission-and-aid/test-credit-and-placement/online-placement-process/Pages/math.aspx",
  "title": "\r\n\tMath Placement Assessment  |  Online Placement Process  |  Test Credit & Placement  |  Admission & Aid  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Admission & Aid Types of Admission Visit DePaul Tuition Room & Board Scholarships Financial Aid Veteran Student Test Credit & PlacementCredit Given by ExamOnline Placement Process Credit Given by Exam Online Placement Process Check Your Application Status Admitted Students Deadlines Immunization Apply Online Request Info Visit Campus DePaul University>Admission & Aid>Test Credit & Placement>Online Placement Process>Math Math Placement Assessment ​What is ALEKS PPL? DePaul requires new and transfer students who are not exempt to take the Aleks Placement, Preparation and Learning (ALEKS PPL) Assessment. Aleks PPL is an online, adaptive system that covers a broad spectrum of mathematic topics. The assessment consists of 25 questions with the average time of completion between 45-90 minutes. After the Placement Assessment, an individualized Prep and Learning Module is available for students to refresh their knowledge on topics. Students then have the opportunity to reassess and improve their placement. ALEKS consists of three parts: An Initial Placement Assessment The Prep and Learning Module, an individualized, self-paced online review Access to 4 additional Placement Assessments DePaul encourages each student to spend time in the Prep and Learning Module, even if the desired score is achieved, time spent in ALEKS will ultimately lead to better preparation and improved grades. What is the purpose of placement testing?After taking the Math Placement Assessment, check your major requirements and meet with your advisor to review the results and enroll in the appropriate classes during Premier or Transition DePaul. Taking the Assessment What is the format of the questions on ALEKS?ALEKS is not a multiple-choice Placement Assessment. It is open-response and requires you to work out solutions with a paper and pencil, then enter them into ALEKS. Be sure to have scratch paper with you. May I use a calculator while using ALEKS?ALEKS will provide an on-screen calculator if you need one to complete a particular problem. May I use any other resources during a Placement Assessment?You may only use a pen or pencil, paper, and the resources provided within ALEKS. You should not receive assistance from friends, family, other websites, textbooks, or any other resource not provided by ALEKS. Using outside resources will lead to improper placement. Can I review a question after I've answered it?Because ALEKS is adaptive, once you submit an answer, you cannot change it. Be sure to carefully check your answer before submitting your response. What if I see questions I don’t know?It is likely that you will be asked questions on material you have not yet learned. On such questions it is appropriate to answer, I don't know. On any question that you have familiarity with, however, it is important to do your best. I don't know is interpreted by ALEKS to mean that you do not know how to solve the topic, and this will be reflected in the Placement Assessment results. There is no penalty for incorrectly answering a question on the Placement Assessment, it only helps ALEKS understand what you know and don’t know. Are Placement Assessments timed?No, you are free to complete the Placement Assessment at your own pace. The system will allow you to access your Placement Assessment for 24 hours. If you need to exit the Placement Assessment for any reason, you will be able to log back in and pick up where you left off. What do I do if my web browser gets stuck or my computer crashes while I'm taking the Placement Assessment?Simply close the browser, or log out and log back in. ALEKS will resume the Placement Assessment exactly where you left off, with no loss of your previous answers. Make sure you have a PC, Mac or Chromebook with internet access, blank paper and a pen or pencil. Aleks uses Single Sign-On (SSO) Incoming Students: Main Menu>For Admitted Students>Next Steps>Online Placement Process.' Current or Continuing Students:For Students>Records and Registration>Placement Process' Click on “Get Started” to take the survey and the tools tutorial. Results What is my placement result?Your placement result (overall score) is a number between 0 and 100. It represents the percentage of topics ALEKS has identified you have mastered. Where can I see my score?You will receive your score immediately upon completion of your Placement Assessment. You’re ALEKS score can be viewed by re-entering ALEKS using the same access link for which you took the Placement Assessment. Can I retake the ALEKS PPL Assessment?Yes, you may take up to 5 Placement Assessments. However, to make each attempt worthwhile, it is important that you spend time working in your ALEKS Prep and Learning Module between Placement Assessments so that you can improve your skills. There is a minimum 48-hour rest period between each test attempt and you will be required to spend 3 hours of preparation time in the software after your second attempt and 5 hours after your third and fourth attempts. Can I retake the ALEKS Placement Assessment immediately?You must wait 48 hours between Placement Assessments. There is generally no benefit to re-taking the Placement Assessment immediately after completing a prior attempt. You cannot improve your results by simply re-taking the Placement Assessment without spending time in the Prep and Learning Module to refresh material that you may have forgotten. Prep and Learning Modules How long do I have access to my Prep and Learning Modules?You will have 1 year of access to your Prep and Learning module. Access to the prep course will not begin until you select start on the top of your screen. DO NOT select into the Prep and Learning Module until you are ready to start working. Must I work in my ALEKS Prep and Learning Module between Placement Assessments?You can retake the Placement assessment up to 4 additional times to improve your score. (The highest score will be used for math placement). Before you can retest, you must wait 48 hours and complete the required number of hours in the ALEKS Prep and Learning Modules before your next attempt. 2nd attempt – no additional hours of work in the Prep and Learning Modules. 3rd attempt – required to complete 3 additional hours of work in the Prep and Learning Modules before attempting assessment. 4th attempt – required to complete 5 additional hours of work in the Prep and Learning Modules before attempting assessment. 5th attempt – required to complete 5 additional hours of work in the Prep and Learning Modules. Transferring ALEKS Test Score ALEKS Tech Support Where can I get help with ALEKS? ALEKS PPL System Requirements ALEKS Customer Support Form ALEKS Support Contact Info"
}