{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/environmental-science.aspx",
  "title": "\r\n\tEnvironmental Science | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Environmental Science Environmental Science Study local and global environmental issues As an Environmental Science major you will study a broad science-based curriculum that will expose you to multiple fields of scientific study, provide you with an understanding of environmental problems and solutions and prepare you for a technical career in environmental science. Environmental Science faculty members are active researchers in soil and wetland science, restoration ecology, geology, paleontology, and conservation biology, offering environmental science majors many opportunities to gain hands-on research experience. DePaul’s close proximity to Lake Michigan, Chicago’s urban ecosystem, as well as the many environmental science conferences that are held in the city, will allow you to interact and work with professionals in the field and learn about important environmental issues. In addition to a variety of combined degree programs, we offer a combined bachelor’s + master’s degree program in Environmental Science, a combined bachelor’s + master’s degree in Environmental Studies and Sustainable Management or a combined bachelor’s + master’s degree in Environmental Science and Secondary Education Environmental Science. Each of these programs allow you to complete a bachelor’s degree and a graduate degree in as few as five years. For international students: this program is a STEM-designated program, which can qualify you to extend your post-graduation stay in the United States. Classes Coursework Biology Chemistry Environmental Science Mathematics Physics Resources Major Requirements Schedule of Classes Department Website Minor offered Combined bachelor's + master's degree offered Career Options Common Career Areas Compliance Education Environmental consulting Environmental engineering Forestry planning Hazardous waste management Solid waste management Water quality management Wetlands protection 88% of Environmental Science graduates were employed, continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program. Get more information Complete the form below to receive more information about this degree program."
}