{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/islamic-world-studies.aspx",
  "title": "\r\n\tIslamic World Studies | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Islamic World Studies Islamic World Studies Delve into Islamic studies through historical and contemporary lenses In the Islamic world studies degree program, you’ll develop an understanding of the diverse Muslim communities and their interconnections by exploring their primary texts, history and cultural traditions. You will study Islam as a worldview, civilization and living reality, and examine global communities as well as regional issues. As you work towards your Islamic world studies degree, you’ll take courses from various departments, including history, religious studies, political science, international studies, modern languages and women’s and gender studies to help you develop an understanding of the Islamic world from multiple perspectives. We offer the 3+3 BA/JD Program, which allows high-achieving first-year undergraduate students to be admitted simultaneously to the College of Liberal Arts and Social Sciences (LAS) and the College of Law (LAW). You’ll complete your first three years in LAS and your final three years in LAW. Classes Coursework Islam in the United States Cairo: Mother of the World Islamic World Studies Islamist Political Movements Nature as Resource: Mining & Extraction’s Impact on Environment & Society Religion and Conflict in South Asia Women in the Middle East: Beyond the Veil Religion, Nationalism, and Politics Resources Major Requirements Schedule of Classes College Website Combined bachelor’s + master’s degree offered Career Options Common Career Areas Public policy International business Education Immigration work Social services Law Human rights 93% of Islamic World Studies graduates were employed, continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program."
}