{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/biochemistry.aspx",
  "title": "\r\n\tBiochemistry | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Biochemistry Biochemistry Explore fundamentals and advances in biochemistry As a Biochemistry major, you’ll learn the fundamentals of chemical and biochemical theory and practice through scientific investigation, laboratory experience and research. You’ll take courses that cover all aspects of chemistry, including analytical, biochemical, inorganic, organic and physical chemistry, as well as courses in biology, physics and mathematics. Through coursework, biochemistry majors develop skills in Conducting experiments safely and ethically Recording and analyzing data Presenting and publishing scientific findings Problem-solving, critical thinking and analytical reasoning as they relate to experimentation and drawing conclusions You’ll gain hands-on research experience by working with professors on cutting-edge research projects. For international students: this program is a STEM-designated program, which can qualify you to extend your post-graduation stay in the United States. Classes Coursework Analytical Chemistry Biochemistry Biology Calculus Computational Chemistry General Chemistry Inorganic Chemistry Instrumental Analysis Medicinal Chemistry Organic Chemistry Physical Chemistry Physics Resources Major Requirements Schedule of Classes Department Website Combined bachelor's + master's degree offered Career Options Common Career Areas Biochemical analysis and testing Education Environmental remediation Industrial health and ​safety administration Medical school Pharmaceutical sales Research Get more information Complete the form below to receive more information about this degree program."
}