{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/philosophy.aspx",
  "title": "\r\n\tPhilosophy | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Philosophy Philosophy Become a diverse thinker Gain an understanding of the history of philosophy, philosophical issues regarding law, medicine and business, as well as the basic problems posed by diverse thinkers. You will also develop analytical thinking, problem solving and decision making skills while analyzing both the humanistic and technical features of philosophy. Regardless of your career goals, a Bachelor of Arts in philosophy will provide you with excellent tools and skills in critical thinking, analyzing content from various perspectives, and verbal and written communication. You will learn to form arguments and take a position on an issue. In addition to a variety of combined degree programs, we offer the 3+3 BA/JD, which allows high-achieving first-year undergraduate students to be admitted simultaneously to the College of Liberal Arts and Social Sciences (LAS) and the College of Law (LAW). You’ll complete your first three years in LAS and your final three years in LAW. Classes Coursework Ethical Theories Philosophy and Modern Society Philosophy, Conflict and Peace Business Ethics Critical Thinking Basic/Symbolic Logic Aesthetics Survey of Political Philosophy Resources Major Requirements Schedule of Classes College Website Minor offered Combined bachelor’s + master’s degree offered Career Options Common Career Areas Ethics Law Social service Political work Education Journalism Public policy Writing 93% of Philosophy graduates were employed, continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program."
}