{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/theatre-arts.aspx",
  "title": "\r\n\tTheatre Arts | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Theatre Arts Theatre Arts Explore a variety of theatrical disciplines The Theatre Arts program curriculum will help you develop crucial skills and give you the flexibility to learn across a variety of theatrical disciplines, such as directing, arts writing, educational outreach, literary management, arts administration and law. As a theatre arts major, ​you’ll choose from three concentrations of study: Standard Concentration: You’ll work with an advisor to develop a curriculum tailored to your personal interests in theatre arts. Directing Concentration: Take coursework in directing and work as an assistant director for The Theatre School’s public productions and other independent projects. Theatre for Young Audiences Concentration: Study dramatic literature for young audiences, and take courses focusing on educational outreach, the role of artists as teachers, and teaching techniques. You’ll be prepared to work in education departments of theatres and in social programs. Theatre arts students learn from a distinguished and award-winning faculty of professional directors, arts administrators, playwrights and arts writers both in the classroom and through individual guidance and advising. Classes Coursework Script Analysis History of Dramatic Literature Directing Dramatic Criticism Design Workshop Performance Workshop Resources Major Requirements Schedule of Classes Department Website Concentrations/Tracks Standard Directing Theatre for Young Audiences Combined bachelor's + master's degree offered Career Options Common Career Areas Arts administration Arts writing Directing Educational outreach Literary management Playwriting Theatre management Get more information Complete the form below to receive more information about this degree program."
}