{
  "url": "https://www.depaul.edu/about/administration/Pages/lawton.aspx",
  "title": "\r\n\tJulie D. Lawton, JD, LLM | DePaul University, Chicago\r\n",
  "content": "About Rankings Campuses Chicago Events Mission President Administration Distinctions History & Timeline Accreditation & Licensure Apply Online Request Info Visit Campus DePaul University>About>Administration>Julie D. Lawton, JD, LLM Julie D. Lawton, JD, LLMInterim Dean, College of LawWeb​site Julie D. Lawton, JD, LLM Interim Dean, College of Law Julie D. Lawton joined DePaul in 2011. She previously taught at Georgetown University Law Center. She received her JD, cum laude, from Howard University School of Law, LLM from Georgetown University Law Center, and BS in Business Administration (Finance), magna cum laude, from Florida A&M University. She also worked as an attorney and development consultant in residential real estate development in Washington, D.C., including owning a real estate development company. Prior to her career in real estate, she practiced for a number of years in the Financial Services group at Morrison & Foerster in Washington, D.C. providing legal counsel on consumer credit issues to large banks and credit card issuers. Prior to her legal career, she worked as a financial analyst in the Commercial Banking group at Bank of America in Atlanta, GA and in summer positions at a Wall Street investment bank and multiple commercial banks. Her work has appeared in the Michigan Journal of Race and Law, the Indiana Law Review, the UMKC Law Review, and the Washington University Journal of Law and Policy. She authored the textbook, Business Fundamentals for Law Students, which introduces law students to foundational concepts in business. Her media appearances include CBS News Chicago, Fox News Chicago, and ABC News Chicago. Since joining DePaul, she has served in several leadership capacities including as Associate Dean for Experiential Learning, Chair of the University Faculty Council Budget Committee, member of the University Faculty Council Executive Committee, and as Chair of the law school Curriculum Committee. ​​"
}