{
  "url": "https://www.depaul.edu/about/Pages/default.aspx",
  "title": "\r\n\tAbout  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "About About Teaching and learning are our priorities at DePaul. That might seem obvious, but we're the largest private university whose faculty members' priority is teaching. We're committed to an educational experience that weaves together mind, place, people and heart, preparing our students to succeed and make a difference in a changing world. Academic Excellence DePaul has more than 300 undergraduate majors and graduate programs, so chances are good we have what you’re looking for. Many of our professors work in Chicago as consultants, researchers and entrepreneurs, and incorporate their experiences in the classroom. In the Heart of Chicago DePaul has one campus in Chicago’s business district and another in Lincoln Park. Chicago itself is an ideal classroom—and we take full advantage of it. Thousands of internship opportunities More than 128,150 alumni in the metro area Connections that impact your education and career opportunities Professors Who Focus on You You’ll actually get to know your professors. 97 percent of all classes are taught by faculty members—not teaching assistants. Fewer than 40 students in the average class Faculty will know your name, concerns and goals Distinctively Diverse Everyone isn’t the same here. And that’s good. By nurturing diversity and intentionally incorporating multiple viewpoints into academic and student life, you’ll have a learning experience that better reflects—and prepares you for—the world. Our students come from49states and136countries DePaul’s Mission 14,188 UndergraduateStudents + 7,022 GraduateStudents 21,210 TotalStudents 1 in 3 undergraduates are first-generation college students 97% courses taught by professors 16:1 Student-to-faculty ratio 10 Colleges and Schools 15 NCAA Division 1 athletic teams 3,800+ students complete service-learning courses annually Founded in 1898 by the Congregation of the Mission, which follows the teachings of St. Vincent de Paul Student Success More than 90 percent of recent undergraduate and graduate degree recipients were employed, continuing their education or not seeking employment within six months of graduation. See the breakdown below."
}