{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/anthropology.aspx",
  "title": "\r\n\tAnthropology | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Anthropology Anthropology Answer the world’s questions Anthropology is the comparative study of humanity that focuses on people in all places throughout history. Study beliefs, values and practices of various cultures and compare similarities and differences among diverse groups. By analyzing other cultures, you will learn more about your own. Research plays an important role in the study of anthropology and will take place both in and outside ​the classroom. Gain hands-on research experience through archeological field schools, study abroad programs, and projects throughout the city of Chicago. The Bachelor of Arts in anthropology prepares you with extensive knowledge of this field, qualifying you to work in nonprofit and for-profit research settings as well as academic careers. Join faculty who have research expertise in the geographic areas of Africa, Asia, Caribbean, Europe, Latin America, Middle East, and the United States. In addition to a variety of combined degree programs, we offer a combined bachelor’s + master’s degree in Anthropology and Secondary Education Social Science, allowing you to complete a bachelor’s and a graduate degree in as few as five years. We also offer the 3+3 BA/JD Program, which allows high-achieving first-year undergraduate students to be admitted simultaneously to the College of Liberal Arts and Social Sciences (LAS) and the College of Law (LAW). You’ll complete your first three years in LAS and your final three years in LAW. Classes Coursework Archaeology Cultural Dimensions of Business Food and Culture Archaeological Field Methods Professionalism and Ethics in Anthropology Public Speaking Lineages of Culture Theory Applied Practice Courses Resources Major Requirements Schedule of Classes College Website Minor offered Combined bachelor’s + master’s degree offered Career Options Common Career Areas Archival research Excavation and site management Urban planning Public administration Governmental policy analysis and program development Forensics Social services Environmental and park services 91% of College of Liberal Arts and Social Sciences graduates were employed, continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program."
}