{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/geography.aspx",
  "title": "\r\n\tGeography | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Geography Geography Position yourself ahead of geography trends In our geography program, you’ll learn how to apply methods such as observation, visualization, analysis and modeling to explain the spatial relationships between people and their physical environments. As a geography major, you’ll take advantage of the department’s cutting-edge technical resources and hands-on research approach. You’ll also learn how to use tools such as Google Earth, satellite image processing, computer mapping, global positioning systems (GPS) and geographic information systems (GIS) to stay ahead of industry trends. In addition to a variety of combined degree programs, we offer geography majors a combined bachelor’s + master’s degree in Geography and Secondary Education Social Science, which allows you to complete a bachelor’s degree and a graduate degree in as few as five years. We also offer the 3+3 BA/JD Program to geography majors, which allows high-achieving first-year undergraduate students to be admitted simultaneously to the College of Liberal Arts and Social Sciences (LAS) and the College of Law (LAW). You’ll complete your first three years in LAS and your final three years in LAW. Classes Coursework Environmental Geography Urbanization Earth Observation/Remote Sensing Geographic Information Systems Geographical Inquiry Sustainable Urbanization Biogeography Resources Major Requirements Schedule of Classes College Website Concentrations/Tracks Standard Concentration Environment and Society GIS and Geotechnology Urban Development and Planning Minors offered Combined bachelor’s + master’s degree offered Career Options Common Career Areas Sustainability and conservation Public policy and diplomacy Urban planning Imaging and mapping Research Natural resource management/consulting Energy and technology work Environmental monitoring and management 95% of Geography graduates were employed, continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program."
}