{
  "url": "https://www.depaul.edu/admission-and-aid/financial-aid/receive-aid/Pages/undergraduate.aspx",
  "title": "\r\n\tUndergraduate  |  Receive Aid  |  Financial Aid  |  Admission & Aid  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Financial Aid Financial Aid Basics Types of Aid Receive AidUndergraduateGraduateLaw Undergraduate Graduate Law Maintain Eligibility Manage Costs Repay Loans Resources for... Forms Contact Us Apply Online Request Info Visit Campus DePaul University>Admission & Aid>Financial Aid>Receive Aid>Undergraduate Undergraduate ​​​​ Financial Aid Disbursement Eligibility Chart for Fall, Winter, and Spring Quarters ​*Federal Pell Grant recipients:Starting in the 2024-25 academic year, as enrollment hours decrease, the Pell Grant award is calculated using enrollment hours as a percentage of 12 hours.​ DePaul uses a financial aid census date (referred to as the Pell census date) for purposes of determining your term enrollment status for Federal Pell disbursement each term. The Pell census date is the day after the last day to drop classes with no penalty, as published on the academic calendar. Your enrollment status for Pell disbursement will be based on your official enrollment on this date. **Illinois State Monetary Award Program (MAP) Grant recipients: DePaul uses a census date to determine enrollment status for State of IL MAP Grant (Est) disbursement each term. The census date is the last day to drop classes with no penalty, as published on the academic calendar. Your enrollment status for State of IL MAP Grant (Est) disbursement will be based on your official enrollment on this date. Course changes that result in credit hour changes may impact your financial aid. If your financial aid is adjusted, it will be reflected on your ePay/eBill section ofCampus Connect​. ***Federal Work-Study recipients: Federal Work-Study funds are not disbursed to your university account. You receive Federal Work-Study funds through either direct deposit or paycheck based on hours worked in a qualified on-campus job. Eligibility Notes Assumes all general financial aid eligibility requirements, need requirements, and program-specific enrollment requirements are met, including active confirmed attendance/participation in all courses for which financial aid is authorized. Also assumes enrollment in courses that apply toward your degree program, and compliance with thefinancial aid repeat-course policy. Summer enrollment requirements may vary: please refer to the online Request for Summer Financial Aid (available in Campus Connect after April 1 each year). Federal Work-Study assumes active participation in a Federal Work-Study-eligible DePaul student employment position. Also assumes all general financial aid eligibility requirements and program-specific enrollment requirements are met, including active confirmed attendance/participation in all courses for which financial aid is authorized. Withdrawal from courses may have serious consequences. Your aid may be recalculated based on a failure to begin attendance in classes or failure to participate in online classes, and you may no longer be eligible for the financial aid disbursed to you. For more information, please refer to theWithdrawal from Classessection of this website."
}