{
  "url": "https://www.depaul.edu/admission-and-aid/financial-aid/resources/Pages/parents.aspx",
  "title": "\r\n\tResources for Parents  |  Resources for...  |  Financial Aid  |  Admission & Aid  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Financial Aid Financial Aid Basics Types of Aid Receive Aid Maintain Eligibility Manage Costs Repay Loans Resources for...ParentsNew/Incoming StudentsCurrent StudentsDeparting Students Parents New/Incoming Students Current Students Departing Students Forms Contact Us Apply Online Request Info Visit Campus DePaul University>Admission & Aid>Financial Aid>Resources for...>Parents Resources for Parents You want the best for your student — and the best value for their education. The staff of DePaul's Office of Financial Aid can help you find funding sources, answer questions about eligibility and strategize the best plan for your family. We expect you to have questions, and we're here to answer them.Contact us. Understand Cost of Attendance— Do you know how much it'll cost your student to attend DePaul? We've created budgets that represent typical costs for students based on anticipated enrollment, dependency status and living arrangements. Types of Aid— Assistantships, federal loans, private loans, grants... There are a lot of options for financing your student's education. Explore them all here. Apply for Aid— Has your student completed all the steps necessary to submit a FAFSA and be considered for financial aid? Submit an Appeal— If you've had a change in income, expenses or circumstances, you can submit an appeal for additional financial aid. Receive Aid— Learn how — and when — aid will be disbursed to your student's account. Maintain Eligibility— Certain academic progress requirements apply to financial aid recipients. Learn how your student can remain eligible for aid throughout their degree progress. Manage Costs— Sticking to a budget is important. Learn about DePaul's payment plan options and budgeting resources. Guest Access to your student’s information – We have two tools your student can use to share academic and financial information with you:Share My Informationallows your student to share view-only access to parts of their Campus Connect account and possibly a guest passcode to discuss their account with DePaul staff.Authorized Payerallows your student to share access to their ePay/eBill portal to review tuition billing information or make payments on their behalf Share My Informationallows your student to share view-only access to parts of their Campus Connect account and possibly a guest passcode to discuss their account with DePaul staff. Authorized Payerallows your student to share access to their ePay/eBill portal to review tuition billing information or make payments on their behalf Contact Us— We​'re always here to help. Give us a call, send us an email or stop by the office."
}