{
  "url": "https://www.depaul.edu/admission-and-aid/financial-aid/forms/Pages/loan.aspx",
  "title": "\r\n\tLoan Forms  |  Forms  |  Financial Aid  |  Admission & Aid  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Financial Aid Financial Aid Basics Types of Aid Receive Aid Maintain Eligibility Manage Costs Repay Loans Resources for... FormsLoan FormsAppeal FormsTEACH Grant Forms Loan Forms Appeal Forms TEACH Grant Forms Contact Us Apply Online Request Info Visit Campus DePaul University>Admission & Aid>Financial Aid>Forms>Loan Forms Loan Forms ​​​Request to Adjust Loans Forms If you would like to cancel, reduce or adjust a student or parent loan, complete one of the Request to Adjust Loans Forms. Federal Loans Once a loan has been disbursed, we are limited in our ability to adjust your loan. If our office can reduce or cancel your loan after it has been disbursed, it may result in a balance on your student account. Request to Adjust Federal Student Loans 2024–2025 Federal Direct Subsidized, Unsub​sidized or Graduate PLUS Loans Request to Adjust Online Form: This form is for Autumn 2024, Winter 2025, Spring 2025 and Summer 2025. (Use your BlueKey login for this form.) Request to Adjust Federal Parent PLUS Loans This form is for your parent to request adjustments such as reductions or cancellations to their Federal Parent PLUS Loan. Students should not sign or submit this form. If this is the first time your parent is logging into our electronic forms, they will need to create and account on the Dynamic Forms website by clicking the link below. For this form, your parent should register under the name and email address that matches their PLUS Loan application. 2024–2025 Federal Parent PLUS Loan Request to Adjust Online Form: This form is for Autumn 2024, Winter 2025, Spring 2025 and Summer 2025 and must be submitted by the parent borrower. Private Loans Reducing or canceling a loan after it has been disbursed may result in a balance on your student account. 2024–2025 Private Loan Request to Adjust Online Form: This form is for Autumn 2024, Winter 2025, Spring 2025 and Summer 2025. (Use your BlueKey login for this form.) Loan Requirements Complete your Master Promissory Note, Counseling, and Exit Counseling for your Federal Student/Parent Loans by logging intostudentaid.govwith your FSA ID and password. Looking for more? Explorefederal loanandprivate loanoptions, requirements and application steps."
}