{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/sound-recording-technology.aspx",
  "title": "\r\n\tSound Recording Technology | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Sound Recording Technology Sound Recording Technology Pitch-perfect studies in sound engineering DePaul’s Sound Recording Technology program prepares you for a career in the audio industry as a sound engineer. As a School of Music student, you’re required to take the standard sequence of music courses, but the majority of the sound engineering degree courses you’ll take will provide extensive training in contemporary music technology. As you work toward your sound engineering degree, your recording classes and practicum sessions take place in the Murray and Michelle Allen recording suite; Studio A features a NEVE console, Pro Tools recording and Genelec surround sound monitoring. SRT students also work on sound reinforcement and lighting in the Holtschneider Performance Center concert halls. Chicago is known for its vibrant music and theatre scene. Concerts of nearly every genre take place each night in the city, and popular music festivals like Lollapalooza and Pitchfork take place in the summers. Dramatic theatre, comedy, improvisation and musical theatre performances take place throughout the city, with nationally touring Broadway shows being one of the most popular attractions. Classes Coursework Microphone techniques Analog and digital signal flow Audio post-production and sound design Electro-acoustic Music Music Business Analog and Digital Circuits Sound and Acoustics Resources Major Requirements Schedule of Classes Department Website Tracks Performance track Audio technology track Combined bachelor’s + master’s degree offered Career Options Common Career Areas Studio recording and mixing Film and television post-production recording and mixing Video game audio and sound design Commercial music production Live sound Get more information Complete the form below to receive more information about this degree program."
}