{
  "url": "https://www.depaul.edu/admission-and-aid/types-of-admission/transfer-student/university-center-partnerships/harper-college-university-center/Pages/harper-bs-info-tech.aspx",
  "title": "\r\n\tCoursework Preparation: Information Technology (BS)  |  University Center at Harper College  |  University Center Partnerships  |  Transfer Student  |  Types of Admission  |  Admission & Aid  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Transfer Student Prepare to Transfer Transferring Your Courses Meet Your Transfer Counselor DePaul Admission Partnership Program University Center PartnershipsUniversity Center at Harper CollegeUniversity Center of Lake County University Center at Harper College University Center of Lake County For Advisors Apply Online Request Info Visit Campus DePaul University>Admission & Aid>Types of Admission>Transfer Student>University Center Partnerships>University Center at Harper College>Coursework Preparation: Information Technology (BS) Coursework Preparation: Information Technology (BS) DePaul University and Harper College have created a partnership to provide degree programs popular at both schools to students on Harper College’s campus through Harper’s University Center. As an Information Technology major, you should complete the associate degree or the IAI - General Education Core Curriculum (GECC) and a few introductory courses in Information Technology at Harper College. After beginning DePaul’s cohort program, the majority of classes you'll take will be Information Technology courses. BS in Informational Technology The BS-IT is a good fit for you if you ​have completed courses and programs in computer technology at Harper, or similar courses at a different school. This program does not require you to have completed a degree in IT to progress onto the DePaul cohort program. You should completeCIS 106 Computer Logic & Program Technologyat Harper College, or an equivalent course at another school prior to enrolling in the DePaul cohort sequence. After completing your studies at Harper, you'll complete approximately 24 courses in: information technology information systems an experiential learning and capstone course general education and elective courses You will need to earn 192 quarter hours for a DePaul’s bachelor degree which you will have, or be very close to having, after completing these courses. Each Term One DePaul class will meet at Harper in a weekly three-hour class session, with a second class being held online. We recommend that you speak with your advisor to create a degree plan specific to your interests and needs."
}