{
  "url": "https://www.depaul.edu/admission-and-aid/immunization/Pages/default.aspx",
  "title": "\r\n\tImmunization  |  Admission & Aid  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Immunization Requirements Exemptions FAQ Apply Online Request Info Visit Campus DePaul University>Admission & Aid>Immunization Immunization DePaul University complies with the regulations set forth by theIllinois Department of Health, which requires students to provide proof of immunization for Tetanus/Diphtheria/Pertussis, Measles, Mumps, Rubella and Meningococcal Conjugate. Learn more about ImmunizationRequirementsandExemptions. Immunization Submittal Process DePaul University has partnered withMed+Proctorto accept your immunization documentation. Where to submit VisitMed+Proctordirectly or log intoCampus Connect» Your Records » Immunization Status. New students can also find a link under the Admitted Student Homepage » Next Steps » Immunization Status. Register with Med+Proctor On theMed+Proctorsite, select \"Register\" in the top right corner. Enter your DePaul University student email address. Create a password and enter your information. Upload your documentation If you have your own immunization document to upload, select the document type, then click “Choose files” to upload your immunization form and click “Continue”. Documents from childhood, records from schools previously attended, clinical/hospital records, or International Certificates of Vaccinations are all acceptable immunization records. All records must be in English or be accompanied by a certified translation. If you do not have your own immunization document, you may download theDePaul University Immunization Form. Your physician or health care provider will need to indicate the month, day, and year of each vaccination that you have received and must sign the form. Scan or take a photo of the completed form, and submit through the navigation path above. Resources How to locate your vaccination records Why vaccines are important for you Where to get vaccinated near you What parents and students need to know about Meningococcal disease For additional information Contact Med+Proctor support Chat: Log intoMed+Proctorand select Chat Now. Email:help@medproctor.​com"
}