{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/cybersecurity.aspx",
  "title": "\r\n\tCybersecurity | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Cybersecurity Cybersecurity Focus on protecting data and networks In our Cybersecurity program, you’ll learn the fundamentals of information security, security infrastructure design and implementation, computer forensics, risk assessment and the impact of security requirements on business operations. Throughout your cybersecurity degree coursework, you’ll learn to design, implement and manage various security infrastructure components. You’ll gain real-world experience by using DePaul’s state-of-the-art Security Laboratory, which includes multi-vendor firewalls, virtual private networks (VPN), intrusion detection and prevention systems, routers, switches, security scanners and event correlation systems. DePaul’s Jarvis College of Computing and Digital Media (CDM) is located in downtown Chicago, in the heart of the city’s technology and business districts, providing you many opportunities to work professionally with leading companies in the fast-growing cybersecurity field. Many CDM faculty members are working professionals, allowing you to learn firsthand from leaders in the industry. For international students: this program is a STEM-designated program, which can qualify you to extend your post-graduation stay in the United States. Classes Coursework Applied Networks and Security Computer Forensic and Incident Response Data Structures in Java Discrete Mathematics Fundamentals of Information Assurance Information Systems Security Engineering Legal, Ethical and Social Issues in Information Security Network Interconnection Technologies Resources Major Requirements Schedule of Classes Department Website Combined bachelor's + master's degree offered Career Options Common Career Areas Computer forensics Incident response Management Network security administration Risk assessment Security infrastructure design Web development 94% of Cybersecurity graduates were employed, continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program."
}