{
  "url": "https://www.depaul.edu/Pages/dhwa.aspx",
  "title": "\r\n\tDePaul University | DePaul University, Chicago\r\n",
  "content": "DePaul University Recent Apply Online Request Info Visit Campus DePaul University>DePaul Harold Washington Academy DePaul Harold Washington Academy New Partnership. New Path Forward. The DePaul Harold Washington Academy offers an exciting new path for Chicago Public School graduates to earn their undergraduate degree. Interested students mustapply to DePaulas a freshman. DePaul then refers eligible candidates to Harold Washington College. The Best of Both Schools Harold Washington College (HWC) and DePaul University are coming together to offer a new program to Chicago Star Scholarship winners. The DePaul Harold Washington Academy, just under five blocks away from Harold Washington College, combines the best of both Harold Washington College and DePaul — allowing students to take advantage of all that both institutions offer. Earn Your DePaul Degree on Our Campus — From Start to Finish Students will take associate degree classes taught by HWC faculty at DePaul’s downtown campus, and earn an Associate of Arts degree from HWC. Here, they’ll have full access to a wide range of DePaul student perks, including the Student Center, libraries, career and advising services, and tutoring. Once students have earned their Associate of Arts degree from HWC, they’ll then get accepted to DePaul to complete their bachelor’s degree. How it Works The DePaul Harold Washington Academy is for: Students who are interested in pursuing a bachelor’s degree at DePaul Students who graduate from a Chicago Public School (CPS) in 2019 or later Students who areSTAR Scholarship eligible Frequently Asked Questions What is the DePaul Harold Washington Academy? The DePaul Harold Washington Academy (DHWA) will enable select CPS Star Scholars to complete an associate degree offered by Harold Washington College on DePaul’s Loop Campus. While working on their associate degree, Academy students will have access to many DePaul services, including tutoring, career counseling, financial literacy, the libraries, and student organizations. Upon successful completion of their associate degree, these students are considered for admission to DePaul. Our hope is that Academy students will be able to make a seamless transition to the next step in their college career with no debt and be well on their way to earning a DePaul bachelor’s degree. Who is eligible? The Academy is open to students eligible for admission to associate degree programs at Harold Washington College. Preference will be given to those students eligible to receive theChicago Star Scholarship. How do I apply? Any interested student must apply to DePaul University as a freshman. DePaul will then identify and notify candidates for the DePaul Harold Washington Academy. Students must also apply to Harold Washington College and apply for the Star Scholar Program. Let us know you’re interested byfilling out this interest form. How much does it cost per year? As a Star Scholar at Harold Washington College, tuition for the first two years is free. DePaul University guarantees admission to students who successfully complete an associate degree and wish to pursue a bachelor’s degree at DePaul. Students who transfer to DePaul will be eligible for state, federal and institutional financial aid to complete their degrees. Is this a dual enrollment program? No. DePaul Harold Washington Academy students are Harold Washington College students, but they attend classes on DePaul’s campus in the Loop and have access to many of the same resources as all DePaul students. Can other City College students participate? Not at this time. How does the program work (who teaches the courses, who holds the credits, what does the transcript say, etc.)? This initiative is for students interested in earning a degree from DePaul University but who are seeking an alternate path to a degree based on their educational preparation or financial situation. The DePaul Harold Washington Academy courses are taught by Harold Washington College faculty and the associate degrees earned are awarded by Harold Washington College and the City Colleges of Chicago. Once a student completes the associate degree and becomes a DePaul transfer student, they will be taught by DePaul faculty, and when they complete the bachelor’s degree, it will be from DePaul University. The program combines the best of both Harold Washington College and DePaul University, and allows students to take advantage of all that the institutions offer. What are the advantages to students enrolling in the DePaul Harold Washington Academy rather than entering DePaul as first-year students? One great advantage is the lower cost of attendance—tuition is free at City Colleges for Star Scholars. In addition, DePaul Harold Washington Academy students receive access to DePaul’s campus network, libraries, facilities, recreation center, athletic events, campus services, campus events and can participate in student organizations. In many ways, this is intended to be a seamless experience. DHWA students will be able to participate in the social and cultural communities at DePaul while enrolling at Harold Washington. When DePaul Harold Washington Academy students complete their associate degree, are they automatically enrolled at DePaul to continue pursuit of bachelor’s degrees? Students in the Academy who successfully complete an associate degree and who are in good standing at the Academy will be admitted to DePaul as degree-seeking undergraduate students. Although admission of such students is guaranteed, applicants must complete all requirements for admission to their intended college, which may include, but are not limited to, minimum grade point average requirements or satisfactory performance or talent auditions, for example in DePaul’s School of Music or The Theatre School programs. (Admission to DePaul’s School of Music or The Theatre School is extremely competitive; few credits will transfer and apply to these degrees.) To which DePaul colleges can graduates of the DePaul Harold Washington Academy transfer? DHWA graduates can transfer into any DePaul University college, but some programs may offer a more seamless transfer (see above.) Students can work with academic advisers on class selection to help ensure the transition to DePaul is seamless. Are students in the DePaul Harold Washington Academy required to enroll at DePaul? No. There is no obligation to apply to or attend DePaul, although students who want to do so will find that the process is streamlined. Will the DePaul Harold Washington Academy graduates receive financial aid after they transfer to DePaul University? DHWA graduates will be eligible for all DePaul financial aid and may be eligible for state and federal aid. What is the difference between the DePaul Harold Washington Academy and the DePaul Admission Partnership Program DAPP Program? The DePaul Admission Partnership Program (DAPP) is a transfer preparation program designed for students beginning their college education at several community colleges in Illinois. In DAPP students complete their associate degree coursework at their respective community colleges. The DePaul Harold Washington Academy is a special collaboration for only select Chicago Star Scholar students to complete an associate degree offered by Harold Washington College on DePaul’s Loop Campus. Are DePaul Harold Washington Academy students considered DePaul students? How are they different? DHWA students are enrolled as students of Harold Washington College and are eligible for all of the resources, benefits and programs offered to Harold Washington College students by the Chicago City Colleges. When they graduate in two years, their associate degree is conferred by Harold Washington College. While enrolled in the DHWA program, students will also have access to many DePaul services (see first FAQ answer)."
}