{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/computer-science-economics.aspx",
  "title": "\r\n\tComputer Science + Economics | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Computer Science + Economics Computer Science + Economics Converging economics acumen with technological expertise In DePaul’s B.S. in Computer Science +​ Economics program, you’ll learn to address complex societal and business challenges through data analysis and programming. This unique degree combines technical skills with a deep understanding of economics and data, opening doors to a variety of career opportunities in both the public and private sectors. Computer science and economics complement one another naturally, providing you with the technological skills needed to analyze the theoretical and applied research components of economics. With this broad range of knowledge, you’ll work with large data sets, learn to modify software applications, understand factors influencing markets, and acquire strategic decision-making skills. The Jarvis College of Computing and Digital Media (CDM) and Driehaus College of Business are located on the Loop Campus, in the heart of Chicago’s technology and business districts, providing you with many opportunities to intern steps from your classes. Many faculty members are working professionals, allowing you to learn firsthand from leaders in the tech and business communities. For international students: this program is a STEM-designated program, which can qualify you to extend your post-graduation stay in the United States. Classes Coursework Business Statistics Computer Systems Data Structures in Java Design and Analysis of Algorithms Discrete Mathematics Economics Analytics Object-Oriented Software Development Principles of Macroeconomics Principles of Microeconomics Programming Languages Combined bachelor's + master's degree offered Resources Major Requirements Schedule of Classes Department Website Career Options Common Career Areas Computational finance Data scientist Economic consulting Public policy Quantitative trading Research analytics Software development Software engineering 89% of Computer Science graduates were employed, continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program."
}