{
  "url": "https://www.depaul.edu/admission-and-aid/test-credit-and-placement/online-placement-process/Pages/modern-languages.aspx",
  "title": "\r\n\tModern Languages Exams  |  Online Placement Process  |  Test Credit & Placement  |  Admission & Aid  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Admission & Aid Types of Admission Visit DePaul Tuition Room & Board Scholarships Financial Aid Veteran Student Test Credit & PlacementCredit Given by ExamOnline Placement Process Credit Given by Exam Online Placement Process Check Your Application Status Admitted Students Deadlines Immunization Apply Online Request Info Visit Campus DePaul University>Admission & Aid>Test Credit & Placement>Online Placement Process>Modern Languages Modern Languages Exams The Modern Language placement test evaluates skills in understanding and grammar of specific modern languages. Most tests have a two-hour time limit and some require a computer that can play streaming audio, as well as speakers or headphones for a listening comprehension portion. Once you start the exam, your time will begin counting down. Am I required to take a modern language placement test? Students wishing to study a language of which they have no prior knowledge are not required to take the modern language test and will start in the introductory course. Online exams include: Spanish / Heritage Spanish French Italian German Japanese Chinese Russian Polish Arabic About the Spanish and Heritage Spanish Placement Tests There are two Spanish tests available to help ensure that each student is placed in the course most appropriate for their level of knowledge and language skills. The standard Spanish exam is used to assess non-native speakers who have previously taken courses in Spanish. The Heritage Spanish exam is intended to assess students with a more in-depth knowledge of Spanish, either as a native speaker or as a result of using the language in everyday life. To gain access to the Heritage Spanish or standard Spanish placement test, the student will first take a short survey (one question) to gauge which test is appropriate. The response to this survey will determine whether the Heritage or regular Spanish test is offered. (Note: neither testing option will display before the survey is taken, and only the appropriate test will be accessible once the survey has been completed.) Test Preparation No special preparation is necessary for the language placement tests. However, you can help refresh your knowledge of a language by: Reviewing the final chapters from the language textbooks that you last used Reading ordinary printed material (newspapers, websites) in the language Watching television programs or listening to radio broadcasts in the language (if available) Listening to music or watching movies in the language Practicing ordinary conversation with friends or relatives who speak the language Together, these activities can help refresh your skills in reading, writing, speaking and listening to a language that you have previously studied or used."
}