{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/japanese-studies.aspx",
  "title": "\r\n\tJapanese | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Japanese Studies Japanese Studies Experience Japanese language and culture The Japanese Studies program focuses on Japanese language, literature and culture. More than 130 million people speak Japanese across the world. You will explore Japanese culture and society through an interdisciplinary approach. Fluency in Japanese and an understanding of Japanese culture will prepare you for professional success in for a variety of careers, such as business, arts, diplomacy, media and education. As a Japanese major, you’ll have the opportunity to participate in DePaul’s Study Abroad programs in Kyoto, Nagoya or Osaka, where you’ll strengthen your linguistic skills and become immersed in Japanese culture. We also offer the 3+3 BA/JD program, which allows high-achieving first-year undergraduate students to be admitted simultaneously to the College of Liberal Arts and Social Sciences (LAS) and the College of Law (LAW). You’ll complete your first three years in LAS and your final three years in LAW. Classes Coursework Japanese Literature Japanese Art and Architecture History of Japan Self, Culture and Society in Contemporary Japan Japanese/East Asian Politics International Relations Religion and Ethics in Japan The State and Economic Growth in East Asia Resources Major Requirements Schedule of Classes College Website Modern Languages minor offered Combined bachelor’s + master’s degree offered Career Options Common Career Areas Public policy International business Translation services Governmental work Education Immigration work Social services Law Human rights 84% of Japanese Studies graduates were employed, continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program."
}