{
  "url": "https://www.depaul.edu/distinctions/Pages/at-risk.aspx",
  "title": "\r\n\tS.O.S. for At-Risk Teens  |  Distinctions  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "S.O.S. for At-Risk Teens ​Two DePaul professors test a personalized approach to intervention science, helping Chicago youth navigate unique social and emotional challenges Teens are individuals. Just ask them. “One size fits all” can’t describe their clothing, music or hairstyles, let alone their experiences. So surely a generic stress reduction program wouldn’t “fit all” either. “The life of an African-American child in Chicago is radically different from the life of a white child in Chicago and even of an African-American child in other cities,” says DePaul psychology Professor LaVome Robinson. “Yes, like other kids they worry about their grades or about their social lives, but the biggest thing they worry about is their safety in the midst of potentially explosive situations.” Robinson and her research partner, Leonard Jason, revisited generic stress reduction methods and designed an intervention program called Success over Stress (S.O.S.) to work for these adolescents, in this place, at this time. “We made sure that everything in the S.O.S. program—the identified sources of stress, the examples and case studies, the language used by the group facilitators—is relevant to these specific teens.” LaVome Robinson, psychology professor, DePaul University From chaos to calmness S.O.S. gives at-risk teens skills in reducing stress, anxiety and aggression. The program includes 15 weekly group sessions during which the students learn to identify stress, understand its symptoms and causes, and manage it with a range of strategies. “We give them strategies they can put into action—problem-solving strategies, relaxation strategies, thought-stopping strategies, and alternative-thinking strategies—so they can gain some control,” says Robinson. “By the end of the sessions, the teens can monitor their stress levels day-to-day, put a strategy in place when they need to, and generally maintain their equilibrium.” Backed by a five-year grant of nearly $3 million from the National Institutes of Health, about 350 ninth-grade students enrolled in Chicago Public Schools (CPS) will participate in S.O.S. over the course of the study. Intervention impact The weekly S.O.S. sessions are staffed by professionals with advanced degrees and by DePaul graduate and undergraduate student volunteers. Rigorous before-and-after assessments pinpoint what is working and what isn’t. “Lots of researchers just ‘parachute’ programs into communities. What we did—making sure the program’s content and delivery really fit with these teens—almost never happens. But that makes all the difference; that makes S.O.S. powerful and productive.” Leonard Jason, director, Center for Community Research “They start with bad attitudes and end up open and attentive,” says Collette Gregory, a group leader who has an MA in psychology from Columbia University, New York. “It’s a big deal for them to be able to identify the sources of stress they can control. By the end of the program, they’re able to talk about themselves and their feelings, and they’re happy about that.” Jane Kemp (BA ’15) agrees. \"I was surprised at how much the students want to learn the stress management techniques and use them in their daily lives. Each session has a real, positive energy.\" With the positive initial results, Robinson dreams of scaling the S.O.S. program. Learn what makes DePaul Distinctive Global Health and Human Rights Find out why researchers are working to eliminate health disparities around the world. Protein Puzzles Discover how studying a protein may lead to curing and preventing Alzheimer's disease."
}