{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/history.aspx",
  "title": "\r\n\tHistory | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>History History Dive into the past and shape the future DePaul’s history program is designed to help you engage in developing a critical understanding of the past, as well as its impact on the present and the future. The bachelor’s degree in history curriculum combines a breadth of chronological and geographical areas. Courses examine history in the Africa, the Americas, Asia and Europe. Through the program, you’ll learn how to conduct research and communicate effectively (individually and in teams), develop writing skills and analyze sources. Chicago is a historically rich city, providing you immense opportunity to take your learning outside the classroom. As you earn your bachelor’s degree in History, you’ll be encouraged to do an internship and work with faculty on research initiatives. You can earn a combined bachelor’s + master’s degree in History and Journalism, Secondary Education, or International Studies. These programs allow you to complete a bachelor’s degree and master’s degree in five years. We also offer the 3+3 BA/JD Program, which allows high-achieving first-year undergraduate students to be admitted simultaneously to the College of Liberal Arts and Social Sciences (LAS) and the College of Law (LAW). You’ll complete your first three years in LAS and your final three years in LAW. Classes Coursework Introduction to Historical Sources and Methods Craft of History Historical Research and Writing (Senior Capstone course) United States Constitutional History The Court and the U.S. Bill of Rights Doing Digital History Oral History Resources Major Requirements Schedule of Classes College Website Concentrations/Tracks Pre-Law Public History Standard Minors offered Combined bachelor’s + master’s degree offered Career Options Common Career Areas Politics Law Governmental work Curatorial and archival management Library science Education Research 92% of History graduates were employed, continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program."
}