{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/international-studies.aspx",
  "title": "\r\n\tInternational Studies | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>International Studies International Studies Critically examine the complexities of international studies The international studies degree program is interdisciplinary, with a curriculum that focuses on historical and contemporary dimensions of complex global issues. You’ll develop skills in research and analysis, cultivate a critical awareness of the relationships of power and inequality, and how to question conventional wisdom. As you work towards your international studies degree, you’ll develop your critical reading, writing, research and problem-solving skills and become able to identify problems and develop solutions to local, regional and international challenges. In addition to a variety of combined degree programs, we offer a combined bachelor’s + master’s degree program in international studies, which allows you to complete a bachelor’s degree and a graduate degree in international studies in as few as five years. We also offer the 3+3 BA/JD Program, which allows high-achieving first-year undergraduate international studies degree students to be admitted simultaneously to the College of Liberal Arts and Social Sciences (LAS) and the College of Law (LAW). You’ll complete your first three years in LAS and your final three years in LAW. You’re also encouraged to develop proficiency in a second language through two years of intensive language study, as well as participate in a study abroad program where your second language is spoken. Classes Coursework Evolution of the Modern Nation State International Conflict Cooperation International Movements in the 20th and 21st Centuries Cultural Analysis International Political Economy Identities and Boundaries Principles of Micro/Macroeconomics Geopolitics Resources Major Requirements Schedule of Classes College Website Minor offered Combined bachelor’s + master’s degree offered Career Options Common Career Areas Public policy International business Immigration work Education Foreign service Humanitarian relief Journalism Social services Law Human rights Lobbying 91% of International Studies graduates were employed, continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program."
}