{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/journalism.aspx",
  "title": "\r\n\tJournalism | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Journalism Journalism Build storytelling skills with lasting impact As a Journalism major at DePaul, you will develop a skill set that prepares you for a career as a multimedia content producer and video storyteller. Because the Journalism field is constantly evolving with the use of new technology, you will learn about industry trends and how to use professional equipment, software and online tools. Students earning their degree in journalism at DePaul have access to the green screen studio, control room, editing suites and the digital equipment facility. Student journalists also staff our award-winning student media outlets: The DePaulia newspaper, 14 East Magazine, Radio DePaul and the Good Day DePaul news show. The BA in Journalism degree program is offered at our Loop Campus in downtown Chicago, giving you access to many media outlets and opportunities to meet and work professionally with leading companies in the industry. In addition to a variety of combined degree programs, you may choose to combine your undergraduate degree in Journalism with one of the following master’s degree programs: Health Communication, Journalism, Media and Cinema Studies, or Communication and Media. We also offer the 3+3 BA/JD Program, which allows high-achieving first-year undergraduate students to be admitted simultaneously to the College of Communication (CMN) and the College of Law (LAW). You’ll complete your first three years in CMN and your final three years in LAW. Classes Coursework Multimedia News Production Online Reporting and Production News Editing Feature Writing International Reporting Magazine Reporting Photojournalism Radio News Sports Reporting Television News Resources Major Requirements Schedule of Classes Department Website Concentrations/Tracks Latino Media & Communication Minor offered Combined bachelor's + master's degree offered Career Options Common Career Areas Advertising Editing Graphic design Production Promotions Public relations Radio Reporting Social media Web content Writing 93% of Journalism graduates were employed, continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program."
}