{
  "url": "https://www.depaul.edu/admission-and-aid/types-of-admission/freshman-student/Pages/deferral-options.aspx",
  "title": "\r\n\tDeferral Options  |  Freshman Student  |  Types of Admission  |  Admission & Aid  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Types of Admission Freshman StudentDeBlogsFor School Counselors DeBlogs For School Counselors Transfer Student Adult Undergraduate Student Graduate Student International Student Returning Student Visiting Undergraduate Student Non-Degree Student Apply Online Request Info Visit Campus DePaul University>Admission & Aid>Types of Admission>Freshman Student>Deferral Options Deferral Options ​To our newly admitted students—we cannot wait to have you join our community! While we certainly want to have you join our community this fall, if the best decision for you/your family is to postpone your start term, you can defer your admission to our Winter, Spring or next Fall quarters and still maintain your freshman academic scholarship, as long as you do not choose to take courses elsewhere in the meantime. Your scholarship will be pro-rated based on the term you join us. You can defer up to a year, but after a year, you will have to reapply. To update your entry term, follow these steps: Update your applicationthrough your Blue Demon Domain Navigate to “Want to update your Entry Term?” and select “YES” Indicate your updated entry term. Winter Quarter (January–March) Spring Quarter (March–June) Fall Quarter (September–November) Select whether you will be enrolled at another educational institution in the meantime. If you do enroll elsewhere, we will need you to submit transcripts for our review prior to enrollment at DePaul. If you are not enrolling elsewhere, select what your plans are from the list: Gap Year Program Health Reasons Military Service Obtaining Visa Spend Time With Friends and Family Travel Working to Save Money Other We will follow up with you if we have any questions and with your next steps, including course selection information if you indicate you will enroll elsewhere. You will receive a new admit packet prior to your new entry term. Frequently Asked Questions What happens to my tuition deposit if I change my entry term? Your tuition deposit will secure your spot for that new entry term. It won’t need to be paid again and goes directly towards tuition for your first quarter. I already know I'm going to defer my start term at DePaul. Should I still register for and attend Premiere even though I know I will not be taking fall quarter classes and will need to drop the coursework? No, you will attend orientation prior to your entry term and should not attend Premiere over the summer if you have already deferred or know you will defer your start to winter quarter (or later). Our partners in New Student and Family Engagement and First Year Programs have orientation programs throughout the year. What if I decide to defer or withdraw after attending orientation? You will need to be sure to drop all of your courses through Campus Connect, as course registration happens at orientation. If you do not drop your courses, you will still be charged for fall tuition even if you don’t attend fall quarter courses. What about Chicago Quarter? Students that defer their freshman admission will take the Chicago Quarter course in their first term at DePaul—some sections of Explore Chicago are offered in winter and spring. Transfer students don’t have a Chicago Quarter requirement. When do I need to decide about deferring/updating my entry term? You have plenty of time—we suggest updating your term by September 1st so we can start working with you on your next steps, but if you need more time than that, you can update your term any time prior to the start of when you want to enroll with us. Will my Future Forward award, Chicago Success award or EDGE grant still be available to me if I update my entry term? No, these awards, awarded to some admitted freshmen, are only available for the term you were admitted for. If you update your term you can appeal for additional need-based financial aid. If I take courses at another institution, how will I know what to choose that will transfer to DePaul? Visit the Transferring Your Courses pageto view online resources to help you with course selection if you choose to earn some credits while you wait to join us. OurDePaul Transfer Resources videowill walk you through all of the transfer resources on our site. You can also talk with one of our admission counselors about selecting courses that will transfer to DePaul. Is there a limit to how many courses I can take at another institution and maintain my freshman scholarship? If you are planning on taking courses elsewhere and transferring to DePaul for the upcomingWinter or Spring quarter, you can take up to 30 semester hours of credit elsewhere and maintain your scholarship. If you are planning on taking courses elsewhere and transferring to DePaul for the nextFall quarter or later, you will forfeit your first-year freshman scholarship and will have to reapply as a transfer student. I’ve been admitted to the Theatre School or the School of Music. Does all of this apply to me? Students admitted to the Theatre School are not able to defer their admission. Connect with Theatre admissions attheatreadmissions@depaul.edufor more information. Students admitted to the School of Music may be able to defer. Connect with Music admissions atmusicadmissions@depaul.eduto learn more."
}