{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/data-science-bs.aspx",
  "title": "\r\n\tData Science (BS) | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Data Science (BS) Data Science (BS) Manage and analyze complex data sets Through DePaul’s Data Science program, you’ll develop a deep understanding of computer science, mathematics and information management — the three primary components of the data science profession. As you work towards your B.S. in Data Science, program coursework will teach you: Mathematical foundations in data analysis Technical skills for data processing and application development Advanced machine learning and statistical modeling techniques Analytical and communication skills to explain results in a meaningful way You’ll take a common core of courses in computer science, programming, mathematics and software during your first two years, after which you will select data science courses with a more narrow focus based on your interests. For international students: this program is a STEM-designated program, which can qualify you to extend your post-graduation stay in the United States. Classes Coursework Introduction to Computer Science Calculus Data Structures Data Analysis and Statistical Software Data Visualization Database Systems Foundations of Data Science Machine Learning Generalized Linear Models Resources Major Requirements Schedule of Classes Department Website Combined bachelor's + master's degree offered Career Options Common Career Areas Data scientist Data engineer Data analyst Database administrator Statistician Functional analyst Business analyst Predictive modeler Data architect Data governance specialist Data visualization specialist Computational scientist Data analyst for medical/pharmaceutical firms Market analyst 88% of Computing and Digital Media graduates were employed, continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program."
}