{
  "url": "https://www.depaul.edu/admission-and-aid/types-of-admission/transfer-student/university-center-partnerships/harper-college-university-center/Pages/default.aspx",
  "title": "\r\n\tUniversity Center at Harper College | University Center Partnerships | DePaul University, Chicago\r\n",
  "content": "Transfer Student Prepare to Transfer Transferring Your Courses Meet Your Transfer Counselor DePaul Admission Partnership Program University Center PartnershipsUniversity Center at Harper CollegeUniversity Center of Lake County University Center at Harper College University Center of Lake County For Advisors Apply Online Request Info Visit Campus DePaul University>Admission & Aid>Types of Admission>Transfer Student>University Center Partnerships>University Center at Harper College University Center at Harper College The DePaul-Harper College Partnership Earn a degree from DePaul on Harper College’s campus DePaul is pleased to partner with Harper College as a member of the Harper College University Center. With this partnership, you can complete your associate’s degree at Harper College and then finish your DePaul bachelor’s degree by moving directly into one of DePaul’s selected undergraduate degree programs. Contact usRegister for an eventApply Your Tuition Discount DePaul is committed to making sure that completing your degree is affordable. Harper College University Center students majoring in Business Administration and Communication and Media will automatically receive a discounted rate that’s 25% lower than the undergraduate, part-timetuition rate. Depending on the number of credits you need to complete your degree, you could save as much as $16,000 in tuition. DePaul Cohort Program You and your classmates will solve problems and build relationships–together. Learn more Degree Programs We offer customized degree programs, tailored to your academic interests and intended career path. Explore programs Upcoming Events Want to know more about the cohort program? Attend one of our upcoming events. Register for an event Learn more Are you a current or former Harper College student? Based on your answer, you’ll be directed to the form to fill out to receive more information about the Harper University Center. Ready to Get Started? Contact Us Undergraduate Programs Kyra FrazierAssistant Director, Transfer Recruitment & Admission1 E. Jackson Blvd.Chicago, IL 60604 Phone(773) 325-8774 Text(312) 820-8513 EmailKFRAZI14@depaul.edu"
}