{
  "url": "https://www.depaul.edu/admission-and-aid/immunization/Pages/exemptions.aspx",
  "title": "\r\n\tImmunization Exemptions  |  Immunization  |  Admission & Aid  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Immunization Requirements Exemptions FAQ Apply Online Request Info Visit Campus DePaul University>Admission & Aid>Immunization>Exemptions Immunization Exemptions In accordance with Illinois State Law, DePaul University may grant an exemption to students who have valid reasoning. A student may be exempt from one or more vaccination if the proper documentation is provided. Types of Exemptions Medical/Pregnancy Exemption Signed and dated statement from the student’s medical provider indicating which immunization(s) the student is exempt from, the medical condition that contraindicates such immunization(s), and the duration of the exemption. Student will also need to complete theMedical/Pregnancy Exemption Form. Religious Exemption Student will need to complete theReligious Exemption Form. The reasoning must clearly state which immunization the student is requesting exemption from and the specific religious belief that conflicts with the immunization. Religious exemptions must be written by the student. Distance Learning Exemption Online only students are exempt from submitting immunization records. This exemption expires at the end of each term and is reapplied as long as the student maintains online only status. Students with distance learning exemptions are not permitted to be on campus at all. Courses listed as in-person, flex, and hybrid are all considered in-person and do not qualify for a distance learning exemption. Where to submit exemptions VisitMed+Proctordirectly or log intoCampus Connect» Your Records » Immunization Status. New students can also find a link under the Admitted Student Homepage » Next Steps » Immunization Status. For additional information Contact Med+Proctor support Chat: Log intoMed+Proctorand select Chat Now. Email: ​help@medproctor.com"
}