{
  "url": "https://www.depaul.edu/distinctions/Pages/business-ethics-religious-sensibility.aspx",
  "title": "\r\n\tBusiness Ethics with Religious Sensibility: New Journal Closes the Gap  |  Distinctions  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Business Ethics with Religious Sensibility: New Journal Closes the Gap ​Two DePaul professors are bridging religion and business ethics in a new publication. Two years ago, Thomas O’Brien (left) and Scott Paeth (right), both associate professors in the Department of Religious Studies, started the “Journal of Religion and Business Ethics,” a project innovative in both content and delivery. Here, they discuss the journal’s importance, especially in light of contemporary, global business practices. Paeth:The idea of a journal began in conversations between Tom and me while we were editing the book, “Religious Perspectives on Business Ethics.” We realized that very few academic resources address the inter-relationship of religion, as a field of study, and business ethics. Thinking about business ethics with a religious sensibility is a point of view that’s not sufficiently represented in today’s intellectual marketplace. O’Brien:Although business ethics is being taught by religious institutions all over the country, instructors are using textbooks with a secular perspective: the religious content is taken out. The books reference ethical systems that are religious in their roots, but the reader would never know. At the same time, scholars are forced to publish in secular journals, which have—understandably—a filter. Clearly, these journals can’t and won’t accept too many religious papers. “We spoke to colleagues from schools like Georgetown and Fordham who also complained of having a hard time finding a book to teach with, and journals to publish in. Someone had to step in to fill that gap.” Thomas O’Brien, associate professor of religious studies, DePaul University That’s what we did with “Religious Perspectives on Business Ethics,” and that’s what we’re doing with the “Journal of Religion and Business Ethics.” Paeth:We like to think of the journal as a clearinghouse for ideas. The realm of people who teach or write about business ethics is large; those with a religious focus are a subset. But there’s a burgeoning sense that business needs a moral core, and for many people, a moral core is rooted in some sense of religious obligation. Our objective is to represent a broad spectrum of perspectives; the journal is open to scholars of all and any religious persuasions. In addition, we include in the mix substantive theoretical arguments (such as the relationship of a specific philosopher to some question in business ethics) and quantitative inquiries and research. O’Brien:We intend to be the leading journal for talking about religion in business ethics. We publish eight to 10 peer-reviewed articles per issue, two issues per year. For the launch in 2009, we asked people to submit articles, and we got a few big hitters: Robert Kennedy (University of St. Thomas) on “The Practice of Just Compensation” and Michael Naughton (University of St. Thomas) and Jeffrey R. Cornwall (Belmont University) on “Culture as the Basis of The Good Entrepreneur.” Now, we receive unsolicited submissions; in fact, the journal is apparently the publication-of-choice for a few scholars. Our goal over the long term is to have more submissions than we know what to do with. As we develop a reputation in the field, that will happen. And we’re planning to expand our board of reviewers, which now includes Rev. Patrick Flanagan, St. John’s University, and Elizabeth Collier, Dominican University. Paeth:The journal is 100 percent online; in fact, we would not have been able to publish without Via Sapientiae, the library’s channel for providing open access to scholarly works produced by DePaul faculty, staff, and students. The electronic format made publishing a niche journal both possible and practical. In fact, we’re really on the cutting-edge of academic publishing. O’Brien:Few journals are open and free, like ours. And being online gives us flexibility not available to print media. For example, in the future we’re hoping to start dialogical exchanges: a scholar would post a work in progress; others would comment and offer suggestions; the author could take this input and develop his or her bright idea and then publish a completed article down the road. In effect, the journal would become a virtual conference. Paeth:Right now, we’re preparing a special issue on the financial crisis. Business is a venue in which social justice gets worked out in a specific way. “The current global crisis is a classic case of business neglecting the moral foundations of economics, leading to practices that allow people to game the system and engage in moral hazard, thereby damaging the very foundations of an economy that people rely on.” Scott Paeth, associate professor of religious studies, DePaul University “The Journal of Religion and Business Ethics” is Vincentian to the core: it’s rooted in our understanding of public and workplace morality—the idea that a person’s spirituality enters into his or her everyday life. This perspective is at the heart of who we are as a university. ###### A quick look at the journal’s most “popular” articles (based on the number of downloads) reveals the publication’s breadth, depth, and relevance: “A Fourth Use of the Law? The Decalogue in the Workplace” by David W. Gill “Theology of the ‘Real Economy’: Christian Economic Ethics in an Age of Financialization” by Charles A. McDaniel Jr. “Importance of Religious Beliefs to Ethical Attitudes in Business” by Tisha L. N. Emerson and Joseph A. Mckinney “Ethical Methodology: Between Public Theology and Public Policy” by Nimi Wariboko “Kinship and Bystander Effect: The Role of Others in Ethical Decisions” by Susan Fredricks, Michele Ramsey, and Andrea Hornett “Fiduciary Principles: Corporate Responsibilities to Stakeholders” by Susan C. Atherton, Mark S. Blodgett, and Charles A. Atherton “Spe Salvi: Assessing the Aerodynamic Soundness of Our Civilizational Flying Machine” by Jim Wishloff “A Magnetic Pull on the Internal Compass: The Moderating Effect of Response to Culture on the Relationship between Moral Identity and Ethical Sensitivity” by Denise Daniels, Margaret Diddams, and Jeff Van Duzer “Culture as the Basis of the Good Entrepreneur” by Michael Naughton and Jeffrey R. Cornwall Learn what makes DePaul Distinctive Global Health and Human Rights Find out why researchers are working to eliminate health disparities around the world. Protein Puzzles Discover how studying a protein may lead to curing and preventing Alzheimer’s disease."
}