{
  "url": "https://www.depaul.edu/admission-and-aid/types-of-admission/transfer-student/Pages/default.aspx",
  "title": "\r\n\tTransfer Student | DePaul University, Chicago\r\n",
  "content": "Transfer Student Prepare to Transfer Transferring Your Courses Meet Your Transfer Counselor DePaul Admission Partnership Program University Center Partnerships For Advisors Apply Online Request Info Visit Campus DePaul University>Admission & Aid>Types of Admission>Transfer Student Transfer Student You’re an integral part of our community Thinking of transferring to DePaul? You’ll find a unique focus on your needs as a transfer student and an approach to higher education designed to broaden your perspective. DePaul is the choice of thousands of transfer students every year — with transfer students making up more than 40 percent of our undergraduate population. Why? Because of the priority we place on meeting the needs of our transfer students. In fact, we were recently named to the Phi Theta Kappa Transfer Honor Roll for our commitment to transfer students’ academic success. You’ll have access to: Admission counselors who only work with transfer students Extensive choice of majors and programs Small classes that emphasize hands-on learning A vast alumni network How to become a Blue Demon Prepare to TransferRequest InformationAttend an Admission Event Admission Steps Transfer admission takes place on a rolling basis. Your application and transcripts can be reviewed at any time prior to your start date. The earliest time that application and transcript review can take place is one year prior to your desired starting term. Transfer students can be admitted to DePaul during any quarter (Fall, Winter, Spring or Summer), except applicants to the School of Music and The Theatre School, which only allow fall admission. Apply Submit a completed applicationonline. Submit Official Transcripts Required Documents: Your application requirements may differ depending on your age and number of credits completed. Please review the grid below to determine the documents you will need to submit. For information on requesting official transcripts, please visit the website of your previous institution's records office or office of the registrar. DePaul University considers official documents as those mailed or emailed directly from a records or registrar's office directly to the Office of Admissions at DePaul. All transcripts and documents must be originals (faxed or unofficial documents cannot be accepted). Transcripts or documents issued to the student will be considered official only if they are received in a sealed envelope from that school. Send All Required Documents To: Office of Undergraduate Admission1 E. Jackson Blvd., Suite 9000Chicago, IL 60604 Electronic transcripts and test scores may be sent toelectronictranscripts@depaul.edu. If you are submitting transcripts via SCRIP-SAFE, please be sure to connect with the DePaul University Undergraduate Admissions account. As part of the transfer application, students attending the community colleges below will be given the option to have DePaul request your transcript on their behalf. Follow the prompts in the application to take advantage of this opportunity to quickly complete your application at no additional cost. All City Colleges of Chicago College of DuPage College of Lake County Harper College Joliet Junior College McHenry County College Moraine Valley Community College Waubonsee Community College Updating Your Application Please complete the following steps if you need to change any important information (e.g., major, admit term). Go to yourBlue Demon Domainaccount and log in. (If you have multiple applications on file, please select the one you want to check and then click the “Open Application” button.) Review your checklist; any items listed as “Awaiting” still require action on your part. If you need to make an update to your term of entry, major, or other important details from your application, click on the “Update Application” button under “Account Tools”. For any issues accessing your Blue Demon Domain account, please contact the Office of Undergraduate Admission at (312) 362-8300 oradmission@depaul.edu. Animation and Film & Television Applicants New, first-time students applying to enter the Animation (BA or BFA) and Film & Television (BA or BFA) degree programs are required to submit additional materials to be considered for admission.Learn more about what to include and how to submit these materials. International Transfer Admission If you’re an international student or received credit for high school or college courses outside the U.S., review theOffice of International Programs application informationfor additional instruction. Frequently Asked Questions Can I get into DePaul? All transfer students are reviewed holistically on an individual basis, taking into consideration all information supplied during the application process, including academic history and standing at previous institutions. A cumulative grade point average (GPA), calculated from all regionally accredited college credits earned, is used for admission review.We recommend that all students applying to DePaul for transfer admission have a minimum cumulative GPA of 2.0 for admission consideration. Students applying to transfer to the colleges below are recommended to meet the following GPA minimums: College of Education: 2.5 School of Music: 2.5 and an audition required The Theatre School: 2.0 and audition or portfolio review, and interview required Do I need to send all of my transcripts? Yes, we need official transcripts from every college or university you have attended. We cannot accept unofficial transcripts to complete your application. DePaul University considers official documents as those mailed or emailed directly from a records or registrar's office directly to the Office of Admissions at DePaul. All transcripts and documents must be originals (faxed or unofficial documents cannot be accepted). Transcripts or documents issued to the student will be considered official only if they are received in a sealed envelope from that school. When should I apply? Transfer admission takes place on a rolling basis. Your application and transcripts can be reviewed at any time prior to your start date. The earliest time that application and transcript review can take place is one year prior to your desired starting term. What is the application fee? DePaul does not require an application fee for undergraduate applicants. Who is my transfer counselor? Meet our transfer admission team hereand connect with your counselor. If you attend a school that’s not listed, call our office at (312) 362-8300to speak with an admission counselor. Can I meet with a counselor on my current campus? DePaul representatives visit Chicago area community colleges regularly throughout the year.Meet our transfer admission team here. If your school is not listed, we invite you to contact our office to schedule an appointment. How long does it take to get an admission decision? We review transfer applications on a rolling basis. Most applicants will have an admission decision within two to four weeks of their application being completed. We also offer instant admission decision through ourAccelerated Transfer Admissionprogram.Register to attend an admission event. Are there scholarships for transfer students from Chicago City Colleges or Chicagoland community colleges? We are pleased to work with transfer students to navigate the financial aid process, including scholarship awards. Transfer students receive automatic consideration for merit based scholarships at the time of admission (see below), and we encourage you to reviewScholarship Connectto learn about other opportunities that you may qualify for as a transfer student. For example, a generous donor has established theChicagoland Community College Transfer Scholarshipfor those entering DePaul as a full time student at the junior level. Please visitScholarship Connectto learn more about the criteria for this and other awards. How do I know if DePaul will accept my existing courses? DePaul has articulated courses from thousands of institutions. By using ourTransfer Course Lists, you can select your home institution, choose the department, and view which courses we’ve articulated from your school. If the course you’re searching for doesn’t exist on the list, it means it hasn’t previously been reviewed for transfer to DePaul. Should this be the case, learn more about thenecessary documentation required for the review process here. Financial Aid Transfer students are automatically considered for merit scholarships at the time of admission to the university. Select “Transfer Students” on our scholarships page for more information. Learn more about DePaul Financial Aid Transfer Admission Office Transferring can feel overwhelming—that’s why we have an office that centralizes everything you need to prepare to transfer, apply and enroll at DePaul. Our counselors specialize in working with transfer students and can assist you with the entire process. DePaul’s Transfer Admission Office Location DePaul Center9th Floor, Room 91001 E. Jackson Blvd.Chicago, IL 60604 (312) 362-8300transferadmissions@depaul.edu Apply NowFind Your Admission Counselor DePaul University’s Safety & Security Information Report and Fire Safety Report is available upon request and atgo.depaul.edu/CleryASR. The report includes statistics about crimes that occurred on campus and public property immediately adjacent to campus, institutional policies concerning campus security, sexual assault and other matters. It also includes fire statistics, fire safety practices and standards of the institution. For a paper copy of the report, contact DePaul’s Clery Compliance Coordinator at (773) 325-8483​."
}