{
  "url": "https://www.depaul.edu/about/administration/Pages/ghosh.aspx",
  "title": "\r\n\tSoumitra Ghosh, PhD | DePaul University, Chicago\r\n",
  "content": "About Rankings Campuses Chicago Events Mission President Administration Distinctions History & Timeline Accreditation & Licensure Apply Online Request Info Visit Campus DePaul University>About>Administration>Soumitra Ghosh, PhD ​Soumitra Ghosh, PhDVice President for Enrollment Management ​Soumitra Ghosh, PhD Vice President for Enrollment Management Soumitra Ghosh joined DePaul in May 2020 as vice president for Enrollment Management. He provides the vision and leadership to pursue strategic priorities and the university’s ambitious enrollment goals. In this role, he oversees undergraduate admission, graduate and adult admission, financial aid, career services, enrollment and recruitment operations, the university registrar, and access and attainment initiatives. Ghosh brings to the position expertise in designing business processes with human beings and emotion in mind; developing and rolling out a comprehensive brand identity; implementing and optimizing recruitment-oriented CRM solutions; and a demonstrated history of achieving growth in both enrollment and net tuition revenue. Prior to joining DePaul, Ghosh served as vice president for Strategic Enrollment Management at Rowan University in Glassboro, New Jersey, where the university exceeded enrollment goals across multiple populations under his direction. Before Rowan, Ghosh served as vice president for Student Enrollment and Engagement at Quincy University in Quincy, Illinois. During his tenure, Quincy increased new-student enrollment while improving academic quality and diversity. He also brings experience in student support services and retention efforts, starting his administrative career as the director of the Academic Success Center at St. Gregory’s University in Shawnee, Oklahoma. Ghosh received his PhD in English/screen studies from Oklahoma State University. He holds both a BA and an MA in English literature from Calcutta University in West Bengal, India. ​​"
}