{
  "url": "https://www.depaul.edu/about/campuses/Pages/lincoln-park.aspx",
  "title": "\r\n\tLincoln Park Campus  |  Campuses  |  About  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "About Rankings CampusesLoop CampusLincoln Park Campus Loop Campus Lincoln Park Campus Chicago Events Mission President Administration Distinctions History & Timeline Accreditation & Licensure Apply Online Request Info Visit Campus DePaul University>About>Campuses>Lincoln Park Campus Lincoln Park Campus Welcome to the neighborhood DePaul’s Lincoln Park campus is just north of downtown Chicago and feels like a traditional university campus—quad and all. Just Off-Campus in Lincoln Park Lincoln Park is home to a sprawling lakefront park and some of the best restaurants in the nation. The neighborhood is a live music hub, with jazz clubs and leading rock venues. You’ll also find some of the best local bookstores, boutiques and grub. Frankly, just about anything you want is right around the corner. On Campus You can live in one of our 11 residence halls or in an apartment nearby. The library, student center, Brownstone’s coffee shop, Ray Meyer Fitness Center and community garden are just a handful of what you’ll find. The Lincoln Park Campus is home to five colleges/schools: College of Education College of Liberal Arts and Social Sciences College of Science and Health School of Music The Theatre School Directions to the Lincoln Park Campus Office of Admission2400 N. Sheffield Ave.Chicago, IL 60614Driving DirectionsFrom the north and northwestFrom the Kennedy Expressway (I-90/I-94) exit at Fullerton Avenue and turn left (east.) The Lincoln Park Campus is about two miles from the expressway on Fullerton Avenue and Sheffield Avenue.From the westFrom the Eisenhower Expressway (I-290), turn onto the Kennedy Expressway (I-90/I-94) heading toward Wisconsin. From the Kennedy Expressway (I-90/I-94) exit at Fullerton Avenue and turn right (east.) The Lincoln Park Campus is about two miles from the expressway on Fullerton Avenue and Sheffield Avenue.From the southFrom the Dan Ryan Expressway (I-90/I-94) continue as the expressway becomes the Kennedy Expressway (I-90/I-94). Exit at Fullerton Avenue and turn right (east.) The Lincoln Park Campus is about two miles from the expressway on Fullerton Avenue and Sheffield Avenue.From Lake Shore Drive (north or south)Exit Lake Shore Drive at Fullerton Avenue. Head west for about three miles. The Lincoln Park Campus is located on Fullerton Avenue and Sheffield Avenue.Visitor ParkingClifton Parking Deck - 2330 N. Clifton Ave.Discounted parking is available if a validated ticket is presented to the attendant.By Public TransportationCTA TrainsThree rapid transit train lines service the Lincoln Park area and DePaul’s Lincoln Park Campus. Exit at the Fullerton station. After coming down the steps, turn left (west) to Sheffield Avenue. These are the train lines servicing the Lincoln Park Campus:Howard and 95th/Dan Ryan (Red)Linden (Evanston)/Loop (Purple)Kimball/Loop (Brown)You may transfer to these lines from all other train lines in most downtown stations.BusesBus routes interconnect throughout the city. Several buses stop very near the Lincoln Park Campus. All routes are subject to change by the CTA. You may reach the CTA at(312) 836-7000or(800) 972-7000, or for TDD (Hearing Impaired), call(312) 836-4949. For more information, visittransitchicago.com.#74 Fullerton Avenue#11 Lincoln Avenue#8 Halsted StreetBy BikeDivvyDivvyis Chicago’s bike sharing system, with thousands of bikes and hundreds of stations throughout the city. Several Divvy stations are located near DePaul’s Lincoln Park Campus. For more information and pricing, please visitdivvybikes.com. Places to Stay Near the Lincoln Park Campus Visit the Demon Discounts siteto find hotels near our Lincoln Park Campus. Restaurants Chicago is home to thousands of restaurants, varying in cuisine and atmosphere. Although we’re most famous for our deep dish pizza, Chicago has much more to offer. Part of the fun you’ll have while visiting or attending DePaul is trying different restaurants in various neighborhoods. Here are a few resources to help you find your next great meal: Chicago Magazine OpenTable TripAdvisor Yelp"
}