{
  "url": "https://www.depaul.edu/admission-and-aid/Pages/veteran-student.aspx",
  "title": "\r\n\tVeteran Student | DePaul University, Chicago\r\n",
  "content": "Admission & Aid Types of Admission Visit DePaul Tuition Room & Board Scholarships Financial Aid Veteran Student Test Credit & Placement Check Your Application Status Admitted Students Deadlines Immunization Apply Online Request Info Visit Campus DePaul University>Admission & Aid>Veteran Student Veteran Student Join our robust community of leaders We're here to help you reach your educational goals DePaul welcomes students who have served our country as members of the armed forces. Our Office of Admission partners with colleagues in our Office of Veterans Affairs to help you make a seamless transition from military service to DePaul’s campus community. Jump Start Your DePaul Degree Serving returning military members has been a priority here since World War II. As a proud member of the Yellow Ribbon Program – which provides tuition-free education to eligible students – DePaul doesn’t limit the number of veterans who can enroll in this program. Begin Your Application TodayRequest More Information Application and Admission Order your transcripts from all previous colleges and universities you have attended, and have them sent directly to DePaul by all previous colleges. These can be submitted electronically to:electronictranscripts@depaul.edu. Students under 24 are required to submit high school transcripts if you have less than24 semester hoursof college coursework complete Students age 24+ are required to submit high school transcripts if you have less than12 semester hoursof college coursework complete Submit YourApplication. Please note: Military Credits/Joint Service Transcripts are not required for admission, but can be applied to open elective credit. Instructions on how to order official Joint Service Transcriptscan be found here. Veteran Benefit Documents and Financial Aid DD-214:(unless you are still on active duty) Certificate of Eligibility from the VA:Apply for this certificate(scroll down to the green button and select “Find Your Education Benefits Form”) DePaul Veteran Benefits Form: Submit yourDePaul Education Benefits Formto our office. DePaul is committed to helping you pay for college through Veterans Educational Benefits or through federal, state and institutional aid. Check out ourMilitary & Veteran Benefits websitewhere you’ll learn more detailed information about veteran benefits offered at DePaul, the G.I. Bill, helpful FAQs and more. Continuing Commitment to Veterans “One of the great things about this university is its commitment to providing veterans an inclusive environment where they can thrive. As a veteran liaison, I'm part of a team that assists them in their transition to college, ensures they receive their benefits and provides guidance and support they need.” Cory MFA screenwriting student #1 DePaul University has the largest number of veteran students in the Chicago area — and the most of any private, not-for-profit school in Illinois. 500+ Enjoy access to the Veteran Services Office, Veteran Student Lounge, and full-time veteran staff. Contact Us DePaul Transfer Center 9th Floor, Room 91001 E. Jackson Blvd.Chicago, IL 60604(312) 362-8300admission@depaul.edu Additional Resources DePaul’s Office of Veteran Student Services U.S. Department of Veterans Affairs Application for Educational Benefits U.S. Department of Veterans Affairs G.I Bill® website Veterans Benefits Administration VA V.I.T.A.L. program Joint Services Transcript GI Bill® Learn about andcompare the GI Bill benefits you’ll receiveat DePaul. GI Bill® is a registered trademark of the U.S. Department of Veterans Affairs (VA). More information about education benefits offered by VA is available atbenefits.va.gov/gibill."
}