{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/economics-ba.aspx",
  "title": "\r\n\tEconomics (BA) | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Economics BA Economics BA Supplying in-demand economic theories and applications As an economics major, you’ll learn how to analyze production, consumption and distribution decisions. As you work toward your Bachelor of Arts in economics, you’ll gain the theoretical, quantitative and analytical skills necessary to understand business and policy issues. The curriculum for the Bachelor of Arts in economics encourages you to think critically and analytically, gives you the necessary skills to analyze data and the ability to communicate findings effectively to a wide array of constituents, and focuses on microeconomic and macroeconomic theory. As an economics major, you’ll become confident in your ability to diagnose complex problems, develop innovative solutions and make a business case for those solutions in a changing national and global economy. DePaul’s economics department is located at the Loop campus in downtown Chicago, in the center of the city’s financial district, gives you opportunities to intern and work professionally with leading companies in the business sector. Our combined bachelor’s + master’s degree programs include a combined bachelor’s + master’s degree in Economics and Economics Policy Analysis or Secondary Education Social Science. Both programs allow you to complete a bachelor’s degree and a graduate degree in as few as five years. We also offer the 3+3 BA/JD Program to Bachelor of Arts in economics students, which allows high-achieving first-year undergraduate students to be admitted simultaneously to the College of Liberal Arts and Social Sciences (LAS) and the College of Law (LAW). You’ll complete your first three years in LAS and your final three years in LAW. Classes Coursework Principles of Micro/Macroeconomics Global Economies International Trade Urban Economics Economic History Economics and Financial Policy Business and Economic Forecasting Resources Major Requirements Schedule of Classes College Website Minor offered Combined bachelor’s + master’s degree offered Career Options Common Career Areas Business Banking Consulting Public administration Insurance International business Data analysis and research 96% of Economics graduates were employed, continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program."
}