{
  "url": "https://www.depaul.edu/admission-and-aid/types-of-admission/freshman-student/Pages/early-action-program-faq.aspx",
  "title": "\r\n\tEarly Action Program FAQ  |  Freshman Student  |  Types of Admission  |  Admission & Aid  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Types of Admission Freshman StudentDeBlogsFor School Counselors DeBlogs For School Counselors Transfer Student Adult Undergraduate Student Graduate Student International Student Returning Student Visiting Undergraduate Student Non-Degree Student Apply Online Request Info Visit Campus DePaul University>Admission & Aid>Types of Admission>Freshman Student>Early Action Program FAQ Early Action Program FAQ DePaul’s Early Action Program (EAP) provides a non-binding, accelerated path for students who prefer to receive their decision early in their senior year. Students who submit and complete their application by November 15 willreceive an admission decision by December 15. In addition to the accelerated timeline, students receive exclusive benefits by participating in the Early Action Program. As the first students to apply to DePaul, they will: Receive the strongest consideration for academic scholarships Have the chance to apply for additional community service and leadership scholarships Register for Orientation and their first DePaul course with priority access Students admitted under the Early Action Program are not required to commit to DePaul but should declare their intent to enroll by June 1. Due to the 2024 FAFSA delays from the Department of Education, and to make sure everyone has enough time to consider their options, DePaul has pushed back this year’s decision deadline to June 1, 2024. Frequently Asked Questions Who should apply under the Early Action Program? All high school seniors who would like to take advantage of the EAP benefits, including receiving a decision by December 15. If I wait to apply regular decision, will I have a better chance of getting in? Your admission decision will be based on your academic record and supporting documents, not on whether you choose to apply by November 15 or our regular decision deadline of February 1. Do I have a better chance at getting a bigger scholarship if I apply early? You will have access to additional scholarships for which you can apply. I’ve already heard back from all of my other schools. Why haven’t I heard from DePaul? If you have completed your application and have not heard by December, please reach out to your DePaul admission counselor to confirm we are not missing any information. You may contact them by logging into yourBlue Demon Domainor by exploring ourcounselor finder tool. Do all my materials need to be in by November 15 to consider the application complete? Yes. In order to receive your decision by December 15, we must receive all your documents by November 15. What if my transcripts or other materials don’t get there in time? Your admission decision may be delayed; we will need all of your materials in order to complete the review. I’m waiting to apply because my school can’t send transcripts yet. What should I do? Apply now and reach out to your admission counselor to let them know your specific situation. You can find their information in yourBlue Demon Domainafter you apply or by visiting ourcounselor finder tool. What if I don’t know what I want to major in? This is totally fine! You can choose to be “undecided” in the college you may be interested in. This is something we can easily update once you have decided. When will I get my decision? If you submit and complete your application to DePaul by November 15, you will receive a decision by December 15. Right before the holidays! Is early action only for the strongest students? Not necessarily; it is an option for students who like to take action early and get a faster response. By doing so, they will receive the added benefits listed above, as well as the ability to plan ahead when considering colleges. If you know you want to apply to DePaul, there’s really no reason not to apply early! I haven’t decided if I want to go to DePaul. Should I still apply now? Yes! If you do decide to come to DePaul, you will be able to take advantage of the EAP benefits. If you find another school to be a better fit, our EAP program is non-binding."
}