{
  "url": "https://www.depaul.edu/admission-and-aid/financial-aid/forms/Pages/default.aspx",
  "title": "\r\n\tForms  |  Financial Aid  |  Admission & Aid  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Financial Aid Financial Aid Basics Types of Aid Receive Aid Maintain Eligibility Manage Costs Repay Loans Resources for... FormsLoan FormsAppeal FormsTEACH Grant Forms Loan Forms Appeal Forms TEACH Grant Forms Contact Us Apply Online Request Info Visit Campus DePaul University>Admission & Aid>Financial Aid>Forms Forms How do I submit a form or documentation? Financial aid forms and documentation can be submitted using our secure onlineFinancial Aid Document Submission form. Registration is not required to upload documents. Make sure all documents uploaded have required signatures. Do not upload password-protected documents or video/audio files. What are Dynamic Forms? Dynamic Forms are an electronic option that you and your parent can use to complete financial aid forms instead of submitting paper forms. Each user will have a unique dashboard that displays all in-progress and submitted forms. If your form requires a parent signature, you (the student) will always complete your section of the form first. Then, you will enter your parent’s information into the form (this person must be included on your FAFSA). They will receive an email letting them know the form is ready to complete. The form will appear in their Dynamic Forms dashboard. Parents will confirm their identity within their electronic form by entering their 6-digitShare My Informationguest passcode or the last four digits of their Social Security Number. You and your parent access our form software using different links. New users will need to create a new account: Student access to forms(BlueKey login credentials) Parent access to forms Users will receive a confirmation email after electronically submitting a form to our office. Download ourDynamic Forms User Guidefor more information. Printed forms and documentation can also be submitted: In personat OneDePaul (Loop or Lincoln Park) By fax to (312) 476-3213 When possible, please use the secure document upload website or fax. We appreciate your patience while we review your documentation. What type of form are you looking for? Loan Forms Appeal Forms TEACH Forms Veterans Benefits Forms"
}