{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/jazz-studies.aspx",
  "title": "\r\n\tJazz Studies | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Jazz Studies Jazz Studies Learn the many facets of jazz The Jazz Studies program prepares you for a professional career in the recording industry, theatre orchestras, jazz groups and virtually all areas of the commercial music industry. You’ll concentrate on all aspects of jazz performance, composition, history, improvisation and theory. Assignments will take you into the city’s professional recording studios where you’ll have the opportunity to meet and work with the best in the business. Jazz studies majors perform in one of the large jazz bands and many combos. Our jazz ensembles have won national acclaim for their performances on campus, on tour and on recordings. Faculty members in the Jazz Studies program are among Chicago’s top studio artists, composers and arrangers. They have worked with virtually every major group, from Woody Herman and Gerry Mulligan to Maynard Ferguson. As a jazz studies student, you’ll have the opportunity to record and play with guest artists such as Phil Woods, Slide Hampton, Jim McNeely, Clark Terry and Louie Bellson. Classes Coursework Essentials of Jazz Jazz Arranging and Composition Jazz Chamber Ensemble Jazz History and Style Jazz Improvisation Jazz Rhythm Section Techniques Resources Major Requirements Schedule of Classes Department Website Combined bachelor's + master's degree offered Career Options Common Career Areas Arranging Composing Education Music editing Music production Performance Recording Get more information Complete the form below to receive more information about this degree program."
}