{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/german.aspx",
  "title": "\r\n\tGerman | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>German German Immerse yourself in German culture, language and history As a German major, you’ll study German and Austrian cultures (authors, musicians, literature), language and notions of German history. German is the most widely spoken first language in the European Union, and German-speaking countries are among the most influential engines driving culture, business and politics today. Through your studies, you will learn that the German-speaking world is rich and multifaceted, including the works of Mozart, Goethe, Freud, Kafka and Marx. As a German major, you’ll explore the crucial questions of memory and history particular to the German past. You’ll become equipped with crucial skills in reading, writing, critical thinking, and intercultural communication—providing you with career opportunities around the world. You’re encouraged to participate in DePaul’s Study Abroad program with two options: a long-term program in Vienna, and a short-term, human rights-oriented program in Berlin. Through these experiences you’ll grow linguistically and expand your cultural understanding of German-speaking societies. Our German program also has its own chapter of the German Honorary Society Delta Phi Alpha, and is affiliated with the student-led DePaul Deutsch Club. Several students have been awarded prestigious grants and scholarships, including multiple Fulbright grants and Congress-Bundestag Youth Exchange scholarships. We also offer the 3+3 BA/JD program, which allows high-achieving first-year undergraduate German majors to be admitted simultaneously to the College of Liberal Arts and Social Sciences (LAS) and the College of Law (LAW). You’ll complete your first three years in LAS and your final three years in LAW. Classes Coursework Berlin and the Golden Twenties Coffeehouses and Culture in Turn of the Century Vienna German Translation Kafka and the Kafkaesque​ Business German New German Cinema The German Novella Making Grimms' Fairy Tales Breaking News in the German Speaking World The Contemporary German Film Multicultural Germany: Literature, Film, Food, and Culture The Uncanny and the Self Coming to Terms with the Past Voicing Migration: Turkish-German Music, Literature, and Film Resources Major Requirements Schedule of Classes College Website Concentrations/Tracks Commercial German German Language and Literature German Studies Minors offered Combined bachelor’s + master’s degree offered Career Options Common Career Areas Museum Studies Food and Wine industry Translation and Interpreting Services International business Marketing Law Nonprofit/NGOs Education Social services Public Policy Human rights 84% of German graduates were employed, continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program."
}