{
  "url": "https://www.depaul.edu/admission-and-aid/immunization/Pages/requirements.aspx",
  "title": "\r\n\tImmunization Requirements  |  Immunization  |  Admission & Aid  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Immunization Requirements Exemptions FAQ Apply Online Request Info Visit Campus DePaul University>Admission & Aid>Immunization>Requirements Immunization Requirements All students who attend an on-campus location are required to provide proof of immunization unless otherwise exempt. Documentation showing proof of the following is required: Tetanus/Diphtheria/Pertussis(DTP/DTap/DT/Td/Tdap): Three (3) doses – one dose must be Tdap. The last dose must have been received within the past 10 years. Measles(Rubeola): Two (2) doses – doses must be at least 28 days apart and both given on or after first birthday. Mumps: Two (2) doses – doses must be at least 28 days apart and both given on or after the first birthday. Rubella(German Measles): Two (2) doses – doses must be at least 28 days apart and both given on or after the first birthday. Meningococcal:Students under the age of 22 must have one dose taken on or after their 16th birthday. Meningococcal B is not accepted. Alternative to Vaccination What is a titer test? A titer test is a blood test that can determine whether you have enough antibodies in your system to be considered “sufficiently immune” to a disease. A copy of the lab report must be submitted to prove immunity. What vaccinations is a titer test accepted for? If you were previously vaccinated for Measles, Mumps, and/or Rubella but are unable to provide documentation or previously exposed to one or more of the above diseases and believe that you now have immunity, a positive titer result will be acceptable as proof of immunization. What do I need to submit? After receiving a titer test a copy of the lab report must be submitted to prove immunity. A positive result must be shown for each specific disease to prove immunity. If the lab report shows equivocal or negative, you are not immune and should visit your physician to start the series of MMR vaccines. COVID-19 Vaccination (Optional) DePaul University no longer requires the COVID-19 vaccination. While no longer required, everyone at DePaul is encouraged to stay up-to-date with their COVID vaccinations. Students will still have the option to submit proof of their COVID-19 vaccination to their vaccination record if they please. For additional information Contact Med+Proctor support Chat: Log intoMed+Proctorand select Chat Now. Email:help@medproctor.com"
}