{
  "url": "https://www.depaul.edu/admission-and-aid/types-of-admission/adult-undergraduate-student/Pages/default.aspx",
  "title": "\r\n\tAdult Undergraduate Student | DePaul University, Chicago\r\n",
  "content": "Types of Admission Freshman Student Transfer Student Adult Undergraduate Student Graduate Student International Student Returning Student Visiting Undergraduate Student Non-Degree Student Apply Online Request Info Visit Campus DePaul University>Admission & Aid>Types of Admission>Adult Undergraduate Student Adult Undergraduate Student Find the degree that fits your needs We’re focused on your needs as an adult student. DePaul will help you leverage skills you already have and prepare you to hit the ground running. Whether you have some college credit or are starting from scratch, we have the programs and flexible formats to meet your needs. Tailored to your goals and learning preferences, we offer a variety of adult education degree options for adult students. Request Information Adult-Focused Degree Options Adult Accelerated Degree Completion Programs If you have an associate degree and are ready to complete your education, then the accelerated adult degree completion programs are for you. Earn your Bachelor of Arts Degree in 24 months in Applied Behavioral Sciences by attending class on campus one night a week (other courses are available online). Professional Degree Programs for Adults DePaul provides a distinctive approach for adult learners through its professional degree programs. These programs allow you to gain new knowledge and develop innovative skills to help you achieve your personalized career goals. Designed for working adult learners, these professional majors offer a structured path to graduation that may be accelerated through transfer credit and assessment of prior personal and professional experiential learning. BA in Decision Analytics BA in Healthcare Administration BA in Leadership Studies BA in Nonprofit Management BA in Professional Studies with a major in Business Administration (BAPS) BA in Professional Studies with a major in Computing (BAPS) BA in Recreation and Sport Management Traditional Programs DePaul's traditional programs combine liberal studies with majors in more than 150 areas. Find traditional degree programs here. *If you have earned fewer than 12 semester hours (16 quarter) hours of college credit, please submit an official copy of your high school transcript or GED score report. Continuing Education Through DePaul's School of Continuing and Professional Studies (SCPS) you may benefit from high-quality certificate programs for adult learners seeking new skills for professional development and certification for career advancement. The Institute for Professional Development — a unit of the Jarvis College of Computing and Digital Media — offers certificate programs in computer science. These programs are geared towards working professionals in information technology who would like to update a skill, or who are seeking career advancement. Learn More About Continuing Education Admission Steps Adult Undergraduate Student Applicants Apply To begin your journey in adult education, submit a completed applicationonline. Submit Official Transcripts Send official transcripts from all colleges and universities you've attended — regardless of the amount of credit earned or grades. Students applying to the School ofContinuing and Professional Studies with no previous college coursework or applying to traditional degree programs with fewer than 12 semester (16 quarter) hours of transferable credit from another college or university will also be required to submit official high school transcripts or GED score report. For information on requesting official transcripts, please visit the website of your previous institution's records office or office of the registrar. Send Materials Office of Undergraduate Admission1 E. Jackson Blvd., Suite 9000Chicago, IL 60604 Electronic transcripts and test scores may be sent toelectronictranscripts@depaul.edu. If you are submitting transcripts via SCRIP-SAFE, please be sure to connect with the DePaul University Undergraduate Admissions account. Updating Your Application Please complete the following steps if you need to change any important information (e.g., major, admit term). Go to yourBlue Demon Domainaccount and log in. (If you have multiple applications on file, please select the one you want to check and then click the \"Open Application\" button.) Review your checklist; any items listed as “Awaiting” still require action on your part. If you need to make an update to your term of entry, major, or other important details from your application, click on the \"Update Application\" button under \"Account Tools\". For any issues accessing your Blue Demon Domain account, please contact the Office of Undergraduate Admission at (312) 362-8300 oradmission@depaul.edu. International Student Applicants If you're an international student or received credit for high school or college courses outside the U.S., review International Admission'sapplication informationfor additional instructions. Contact International Admission at(312) 362-8376with additional questions. Application Deadlines Adult undergraduate admission takes place on a rolling basis. Your application and transcripts can be reviewed at any time prior to your start date. The earliest time that application and transcript review can take place is one year prior to your desired starting term. Adult Enrollment Center We understand your time is precious — that's why we have an adult enrollment center that centralizes everything you need to enroll at DePaul. Our counselors specialize in serving adult undergraduate students and can assist you with the entire admission process, including: Evaluating your degree options Transferring existing college credit Applying for financial aid Earning credit for life experience Enrolling in programs like employer tuition reimbursement or veteran's assistance Connecting you with other adult education student services (312) 362-8300admission@depaul.edu DePaul’s Adult Enrollment Center location: Loop CampusDePaul Center1 E. Jackson Blvd., Suite 9000Chicago, IL 60604 Apply Now DePaul University’s Safety & Security Information Report and Fire Safety Report is available upon request and atgo.depaul.edu/CleryASR. The report includes statistics about crimes that occurred on campus and public property immediately adjacent to campus, institutional policies concerning campus security, sexual assault and other matters. It also includes fire statistics, fire safety practices and standards of the institution. For a paper copy of the report, contact DePaul’s Clery Compliance Coordinator at (773) 32​5-8483."
}