{
  "url": "https://www.depaul.edu/admission-and-aid/financial-aid/types-of-aid/Pages/study-abroad.aspx",
  "title": "\r\n\tStudy Abroad Financial Aid  |  Types of Aid  |  Financial Aid  |  Admission & Aid  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Financial Aid Financial Aid Basics Types of AidScholarshipsFederal LoansPrivate LoansGrantsMilitary & Veteran BenefitsAssistantshipsStudy AbroadWork-Study Scholarships Federal Loans Private Loans Grants Military & Veteran Benefits Assistantships Study Abroad Work-Study Receive Aid Maintain Eligibility Manage Costs Repay Loans Resources for... Forms Contact Us Apply Online Request Info Visit Campus DePaul University>Admission & Aid>Financial Aid>Types of Aid>Study Abroad Study Abroad Financial Aid ​Your first step in learning about study abroad opportunities at DePaul is to visit theStudy Abroad website. DePaul-sponsored study abroad programs allow you to study off-campus in an approved program through DePaul. This is the most common and often the most affordable study abroad option for DePaul students who are receiving financial aid, as funds apply to these programs. Note: Students pursuingexternal study abroad programs for transfer creditare not able to use DePaul grants and scholarships or any federal/state aid. They pay out-of-pocket directly to the external program. Upon return, students can work with Financial Aid to reinstate their aid. Scholarship and Grant Opportunities Student Loan Resources Available Federal subsidized and unsubsidized student loans can be used to pay for study abroad programs. Additionally, parents of dependent undergraduate students often use the Federal Direct Parent Loan to help fund study abroad expenses. Information about these loans, including application procedures, is available in theFederal Loanssection of this website. Federal Direct Unsubsidized Loans and the Federal Direct Grad PLUS Loans are the most common student loan resources for graduate and professional study abroad opportunities. Graduate and Law students who are already receiving the maximums under the Direct Unsubsidized Loan program can often receive additional funding from the Federal Direct Grad PLUS Loan. Information about this loan, including application procedures, is available in theFederal PLUS Loansection of this website. All Students:Private educational lenders also offer loans for study abroad educational expenses. For more information, please see thePrivate Loansection of this website. Learn More Study Abroad for Undergraduate Students FAQ Study Abroad for Graduate and Law Students FAQ"
}