{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/neuroscience.aspx",
  "title": "\r\n\tNeuroscience | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Neuroscience Neuroscience Study neuroscience theories, applications and research methods DePaul’s Neuroscience bachelor’s degree program is an interdisciplinary program that draws from the natural, behavioral and computational science fields. In the program, you’ll learn: fundamental concepts that underlie the function of the nervous system on a cellular and molecular level how the nervous system produces behavior and cognition the role of computer science and mathematics in new technologies and therapies within the field neuroscience research methods and theory through scientific investigation, laboratory experience and research opportunities Your Neuroscience bachelor’s degree will prepare you for a wide range of science-related careers, including pursuing a professional degree in health and/or medicine. For international students: this program is a STEM-designated program, which can qualify you to extend your post-graduation stay in the United States. Classes Coursework Introduction to Neuroscience Advanced Neuroscience Fundamentals Neuroscience Research Methods Sensory Neuroscience Neuroscience of Movement Introduction to Computational Neuroscience Neuroplasticity Cellular Basis of Learning and Memory Biology Chemistry Data Analysis & Statistics Health Sciences Psychology Resources Major Requirements Schedule of Classes Department Website Concentrations/Tracks Behavioral/Cognitive Cellular/Molecular Computational Pre-Health Integrative Combined bachelor's + master's degree offered Career Options Common Career Areas Medical/Physician Assistant school Biomedical research Artificial intelligence Clinical researcher Neuroeconomics Neuroimaging Neuromarketing Neuropsychology Physical/occupational/speech therapy Clinical Psychology Nursing school Data analysis Health educator Nonprofit work Pharmaceutical sales Post-graduate study Science writer 96% of Neuroscience graduates were employed, continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program."
}