{
  "url": "https://www.depaul.edu/admission-and-aid/financial-aid/types-of-aid/federal-loans/plus-loans/Pages/default.aspx",
  "title": "\r\n\tPLUS Loans  |  Federal Loans  |  Types of Aid  |  Financial Aid  |  Admission & Aid  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Federal Loans PLUS Loans Apply Online Request Info Visit Campus DePaul University>Admission & Aid>Financial Aid>Types of Aid>Federal Loans>PLUS Loans PLUS Loans ​​​​​​Federal Direct PLUS Loans There are two types of PLUS Loans: The Federal Parent PLUS loan is available toeligible parentsof dependent undergraduate students enrolled at least half-time in a degree-seeking program. The Federal Graduate PLUS loan is available to graduate or professional students enrolled at least half-time in a degree-seeking program or a financial aid-eligible non-degree graduate program. PLUS Loans are credit-based loans that require a separate application – in addition to the FAFSA. Borrowers are generally eligible if they do not have an adverse credit history, are not in default on a federal student loan, and meet the requirements in the application. Borrowers must lift or remove any security freeze placed on their credit file at each credit bureau before completing a PLUS loan application. The application process for a PLUS loan cannot be completed if there is a security freeze in place. Select the type of PLUS Loan for more information on how to request this loan. Parent PLUS Loan Application Process File a FAFSA and meet all eligibility requirements. Review your financial aid offers in Campus Connect – specifically the amount offered in the Est. Parent PLUS Loan. This is an estimated amount your parent may borrow in a Federal PLUS loan. To apply for any amount up to the maximum, your parent must: go to theFederal Student Aidwebsite, log in using their FSA ID, not your ID, request a Federal Direct PLUS Loan for Parents. Once completed, your parent will receive the outcome of the credit check on the application confirmation page and the federal loan processor will notify us of your parent's intent to borrow. We will complete the school portion of your parent’s PLUS Loan request and notify you by email if we need additional information. You and your parent must complete a FAFSA and reapply for the PLUS Loan at the Federal Student Aid website every year. Graduate PLUS Loan Application Process Important Consideration before applying: The Federal Direct Grad PLUS Loan program is one of many credit-based educational loan choices for graduate study. You are encouraged to compare the interest rates, credit check requirements, deferment options, terms, and repayment of PLUS Loans with those of private loans. The credit check for the PLUS Loan will not be as stringent as that of most private loans, which often look at debt-to-income ratio. Grad PLUS Loans can be consolidated with other Federal Direct Loans (subsidized/unsubsidized), which allows students to have only one payment after graduation. Private loans cannot be consolidated with federal loans. Interest rates for PLUS Loans tend to be lower than many private loans. Application Process: File a FAFSA and meet all eligibility requirements. Review your financial aid offers in Campus Connect. We encourage you to accept the full amount of your Direct Unsubsidized Loan before requesting a PLUS loan because the interest rate will be lower. Complete the online Grad PLUS application in Campus Connect: Financial Aid tile > View My Financial Aid > Select the aid year > Accept/Decline Awards > Grad PLUS Online Application. Students may borrow up to the full cost of attendance, minus any other financial aid. Disbursement Federal regulations stipulate that Direct PLUS loans be distributed in even disbursements across the loan period. For example, if a borrower requests a loan for the academic year —Autumn, Winter, and Spring terms — the total amount of the loan will disburse evenly across these three terms. We encourage you (and your parent, if applicable) to calculate the amount needed for the entire academic period and request that amount. Repayment Repayment begins after the final loan disbursement is made; however, a borrower can choose to defer payments on the interest and principal until six months after the date the student ceases to be enrolled at least half time. If a borrower chooses to defer payments, the accruing interest can be paid by the borrower monthly or quarterly. If interest is not paid while the loan is in deferment, it will becapitalizedquarterly. If you can afford to make interest-only payments while in deferment, it’s a good way to help manage the cost of the loan.Click herefor more information on your loan repayment options. Federal Direct Parent PLUS Loan Resources Federal Direct Parent PLUS Loan Information Sheet Federal Direct Parent PLUS Loan Credit Balance FAQ Summer Federal Direct Parent PLUS Loan Information Sheet Federal Graduate PLUS Loan Resources Federal Graduate PLUS Loan FAQ Federal Graduate PLUS Denial Options FAQ"
}