{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/actuarial-science-bsb.aspx",
  "title": "\r\n\tActuarial Science (BSB) | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Actuarial Science Actuarial Science Learn to analyze risk and uncertainty Our Actuarial Science degree program will prepare you to analyze and help organizations manage the financial consequences of risk and uncertainty. You’ll learn to interpret statistics to determine probabilities of accidents, sickness, death and/or the loss of property from theft, cybercrime, natural disasters and other phenomena. Graduates will be equipped with the skills necessary to sit for actuary certification exams. In the program, you’ll use mathematics, statistics and financial theory to study uncertain future events, especially those concerning risk management and insurance. As you work toward your Actuarial Science degree, you’ll also learn to apply the laws of probability and statistics to problems, and calculate the financial costs and benefits of insurance for various individuals. Conferences and networking opportunities hosted by DePaul’s Arditti Center for Risk Management provide you with opportunities to explore real-world risk management issues and make industry contacts. DePaul is located in the heart of Chicago’s financial and business community, giving you access to insurance companies, consulting and investment firms, government agencies and other organizations for internships and jobs after graduation. For international students: this program is a STEM-designated program, which can qualify you to extend your post-graduation stay in the United States. Classes Coursework Applied Regression Analysis Linear Algebra Money and Banking Multivariable Calculus Principles of Corporate Finance for Actuaries Principles of Risk and Insurance Probability and Statistics Risk Management Resources Major Requirements Schedule of Classes Department Website Combined bachelor's + master's degree offered Career Options Common Career Areas Actuary Assessor Claims adjustor Cost estimator Credit analyst Financial planner Insurance underwriter Risk analyst 95% of Actuarial Science graduates were employed, continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program."
}