{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/african-black-diaspora-studies.aspx",
  "title": "\r\n\tAfrican and Black Diaspora Studies | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>African and Black Diaspora Studies African and Black Diaspora Studies Examine the interconnected, multiple perspectives of African Diaspora studies African and Black Diaspora Studies (ABD) is an interdisciplinary program at DePaul that will provide you with an opportunity to explore the topics of power, history, identity, gender and race in relation to contemporary understandings of Africa and the movement of Black and African people throughout the world. As an African and Black Diaspora Studies major, you’ll explore the Black experience from a variety of perspectives, including but not limited to historical, artistic, sociological, anthropological, and philosophical approaches. And you’ll study the diverse cultures and societies that make up the global African Diaspora. Concentrate your study regionally (e.g. Africa, Black America, Afro-Caribbean, Latin America, etc.) or thematically (e.g. literature and culture, politics, gender and sexuality, etc.), and work with dedicated faculty and take advantage of a flexible curriculum to tailor your studies to your interests. In addition to a variety of combined degrees, we offer African and Black Diaspora Studies majors a combined bachelor’s + master’s degree in Critical Ethnic Studies. As an ABD major, you’ll begin taking Critical Ethnic Studies courses during your undergraduate senior year, leaving only one remaining year for the MA in Critical Ethnic Studies. We also offer the 3+3 BA/JD program, which allows high-achieving first-year undergraduate students to be admitted simultaneously to the College of Liberal Arts and Social Sciences (LAS) and the College of Law (LAW). You’ll complete your first three years in LAS and your final three years in LAW. Classes Coursework Africa: Peoples, Cultures, Ideas and Movements Afro-Caribbean and Afro-Latin America Harlem Renaissance and Negritude Blacks and Love Principles of African Art Black Migration to the North, 1877–1941 Black Feminist Theories in a U.S. Context Religions of Africa and the Diaspora Resources Major Requirements Schedule of Classes College Website Minor offered Combined bachelor’s + master’s degree offered Career Options Common Career Areas Public policy International business Immigration work Education Social services Human rights Lobbying 93% of African and Black Diaspora Studies graduates were employed, continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program. ​"
}