{
  "url": "https://www.depaul.edu/admission-and-aid/types-of-admission/Pages/visiting-undergraduate-student.aspx",
  "title": "\r\n\tVisiting Undergraduate Student  |  Types of Admission  |  Admission & Aid  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Types of Admission Freshman Student Transfer Student Adult Undergraduate Student Graduate Student International Student Returning Student Visiting Undergraduate Student Non-Degree Student Apply Online Request Info Visit Campus DePaul University>Admission & Aid>Types of Admission>Visiting Undergraduate Student Visiting Undergraduate Student Explore what DePaul has to offer you You are a non-degree, Visiting Undergraduate Student if you're a high school student, high school graduate or a college student interested in taking undergraduate courses for credit that will transfer back to another institution. Admission Requirements Current high school students Submit theonline application (for visiting undergraduate students) You are required to submit a transcript with your high school coursework High school graduates (who have not yet attended college) Submit theonline application (for visiting undergraduate students) You are required to submit a transcript with your high school coursework Current college students Submit theonline application (for visiting undergraduate students) You must be in good standing at another four-year college or university (your transcript is not required) Application Process To apply, please submit theonline application (for visiting undergraduate students). There is no application fee for this process. Visiting students are asked to apply to a specific college at DePaul depending on the courses in which you intend to enroll (e.g., College of Science and Health for students intending to take a math course). Visiting students will be notified of their admission decision and registration instructions within three business days once an application is submitted, along with any required documents as detailed above. Admission as a visiting student is good for one quarter only. If you intend to enroll for more than one quarter at DePaul, you will need to submit a new application for each term. Though not required for admission, if you are interested in taking a course with a prerequisite requirement you will need to submit transcripts showing that you have completed any necessary prerequisites. More information on this will be included in your acceptance information. International Students Visiting international students have a slightly different admission process and should visit theInternational Admission websitefor more information. If you are currently attending college in the U.S. on an F-1 student visa, you may not be eligible for non-degree admission. Please contact theInternational Admission officefor assistance. Classes for Visiting Undergraduate Students To browse DePaul's course offerings for upcoming terms, visit ourSchedule of Classes. Visiting students can be admitted for any quarter at DePaul up to the day before registration closes. DePaul is on a quarter system, so visiting students are admitted four times every year. Classes can be taken on a part-time or full-time basis. Information on term start dates can be found on ourAcademic Calendar. Students interested in only taking courses within The Theatre School or School of Music should contact their offices of admission directly as these schools have specific admission requirements. Already Admitted as a Visiting Student? Additional information on navigatingCampus Connect, paying tuition and obtaining a student ID can be found on ourOneDePaul website. Looking to become more familiar with DePaul's campuses? Take our online campus tour or register for a tour at our Lincoln Park or Loop campuses on ourVisit DePaul page. Questions? Contact a DePaul admission representative:admission@depaul.edu(312) 362-8300"
}