{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/business-administration.aspx",
  "title": "\r\n\tBusiness Administration | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Business Administration Business Administration Broaden your business sense DePaul’s degree in Business Administration is built upon a strong liberal arts foundation that allows you to learn from a broad business curriculum. You’re encouraged to select a variety of courses to build a wide range of expertise in areas that match your career goals. The Business Administration degree program offers a variety of courses, giving you the opportunity to learn about fields such as entrepreneurship, management, economics and marketing. Planning on launching your own start-up or taking over a family business? Consider taking entrepreneurship courses. Thinking about attending law school? Select business and professional ethics courses. Uncertain about your future career path? Take a range of courses across multiple business fields. You’ll also benefit from programs and networking events in DePaul’s Coleman Entrepreneurship Center and the Center for Innovation, as well as DePaul’s presence in Chicago’s 1871 business incubator. DePaul is located in the heart of Chicago’s financial and business community, giving you access to work with leading business and consulting firms. Classes Coursework Business Ethics & Society Career Management Skills Creativity & Entrepreneurship Effective Business Communication Principles of Management Social Media Marketing Sustainable Management Topics in Global Economies Resources Major Requirements Schedule of Classes Minor offered Combined bachelor's + master's degree offered Career Options Common Career Areas Accounting advising services Advertising Banking Brand/product management Business development and management Economic advising Marketing Real Estate Sales Statistical analysis and research 87% of Business Administration graduates were employed, continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program."
}