{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/writing-rhetoric.aspx",
  "title": "\r\n\tWriting and Rhetoric | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Writing and Rhetoric Writing and Rhetoric Study the craft of storytelling Our writing and rhetoric program is dedicated to writing degree students who will study literate activity across time and culture, and produce effective writing in contemporary settings—from the personal to the professional. Because our lives are increasingly mediated by digital technologies that combine writing, sound and image in interactive spaces, you’ll explore what it means to live and work as a digital writer. Faculty members who teach in the writing degree program are published specialists in rhetoric, writing studies, English as a second language (ESL), technical and professional writing, and new media studies. As you work toward your writing degree, you will have the option to earn a combined bachelor’s + master’s degree that combines your writing and rhetoric major with a graduate program, including our master’s program in Writing, Rhetoric and Discourse. We also offer a combined bachelor’s + master’s in Writing and Rhetoric and Secondary Education in English degree. All of these programs allow you to complete a bachelor’s degree and a graduate degree in as few as five years. Additionally, we offer the 3+3 BA/JD, which allows high-achieving first-year undergraduate students to be admitted simultaneously to the College of Liberal Arts and Social Sciences (LAS) and the College of Law (LAW). You’ll complete your first three years in LAS and your final three years in LAW. Online Degree Options An online Bachelor of Arts (BA) degree in Writing and Rhetoric from DePaul’s College of Liberal Arts and Social Sciences (LAS) focuses on the development and expression of ideas in writing. Here, you’ll explore theories of language, rhetoric and write in a variety of contexts and genres covering a wide range of relevant topic areas. You can complete this program entirely online, either in real time or on your time. Tailored to meet the needs of your busy schedule, you'll achieve the same learning outcomes as in-person classes through collaborative and engaged learning. Classes Coursework Style for Writers History of Literacies and Writing Digital Storytelling Writing in Workplace Contexts Ghostwriting Digital Writing Writing with Photographs Visual Rhetoric Resources Major Requirements Schedule of Classes College Website Combined bachelor’s + master’s degree offered Career Options Common Career Areas Content development, strategy, management and administration Publishing and editing Social media writing and management Technical writing Digital marketing Legal, technical, medical/health writing Ghostwriting Non-profit communications 85% of Writing and Rhetoric graduates were employed, continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program."
}