{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/public-relations-advertising.aspx",
  "title": "\r\n\tPublic Relations and Advertising | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Public Relations and Advertising Public Relations and Advertising Study in a global hub of advertising and PR In the Public Relations and Advertising program, you will develop an understanding of public relations and advertising theories and practices. You’ll learn to consider processes, products and effects from multiple perspectives, as well as develop critical thinking skills and your ability to speak and write effectively. When you pursue a public relations and advertising degree, you’ll study with aprogram named the 2022 Outstanding Education Program by industry-leading publication PRWeek. You may choose to take courses that concentrate on either public relations or advertising. Public relations focuses on maintaining and promoting the image of a company. Advertising focuses on persuading an audience to purchase a product or service. If you are interested in both fields, you have the option to take courses from both subject areas. DePaul is located in the heart of Chicago’s business community, giving you opportunities to intern and work professionally with leading public relations and advertising agencies upon degree completion. We also offer the 3+3 BA/JD Program, which allows high-achieving first-year undergraduate students to be admitted simultaneously to the College of Communication (CMN) and the College of Law (LAW). You’ll complete your first three years in CMN and your final three years in LAW. Classes Coursework Advertising & Public Relations Ethics Copywriting Creativity in Advertising Crisis Communication Management Digital Advertising Digital and Social Media Strategy Event Planning Writing for Public Relations and Advertising Resources Major Requirements Schedule of Classes Department Website Minor offered Combined bachelor's + master's degree offered Career Options Common Career Areas Account management Copywriting Event planning Media planning/buying Media relations Risk and crisis management Sales management Social media 93% of Public Relations and Advertising graduates were employed, continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program."
}