{
  "url": "https://www.depaul.edu/admission-and-aid/types-of-admission/transfer-student/transferring-your-courses/Pages/recommended-courses.aspx",
  "title": "\r\n\tRecommended Courses  |  Transferring Your Courses  |  Transfer Student  |  Types of Admission  |  Admission & Aid  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Transfer Student Prepare to Transfer Transferring Your CoursesTransfer GuidesCourse ListsTransferologyRecommended CoursesRecent Transfer Guides Course Lists Transferology Recommended Courses Recent Meet Your Transfer Counselor DePaul Admission Partnership Program University Center Partnerships For Advisors Apply Online Request Info Visit Campus DePaul University>Admission & Aid>Types of Admission>Transfer Student>Transferring Your Courses>Recommended Courses Recommended Courses ​While course requirements are not necessary for admission to the university, please use the information below to help in selecting courses that will best fit your intended DePaul major. A complete list of all undergraduate majors available at DePaul can be found in theUniversity Catalog. Students attending an Illinois community college before transferring to DePaul are advised to take the following recommended courses as part of their Associate of Arts (A.A.) or Associate of Science (A.S.) degree. By completing your degree at an Illinois community college, most other Liberal Studies courses (DePaul’s general education requirements) will automatically be completed through DePaul’s participation in theIllinois Articulation Initiative (IAI). DePaul also has transfer agreements for some Associate Applied Science (A.A.S.) degree programs with specific colleges that can be found on theTransfer Agreementspage. If you are not transferring from an Illinois community college, you can also follow the recommendations below, but will also want to be in contact with our Transfer Admission office for assistance with planning your course selections prior to transfer. Driehaus College of Business To be applied toward the Bachelor of Science in Business (BSB) degree, the courses listed below must be completed with a grade of C or better. See the transfer guide for specific DePaul course numbers and equivalent transfer courses. Keep in mind that Driehaus College of Business majors have few open electives in the degree. Financial Accounting* Managerial Accounting* Business Law, equivalent to BLW 201 Legal & Ethical Aspects in the Business Environment Principles of Microeconomics Principles of Macroeconomics *At some IL community colleges, students must transfer the pair of Financial and Managerial Accountancy to receive credit for ACC 102 Intro to Accountancy II. If the guide below shows No Equivalent Course listed for ACC 102, this is the case for your college. It is recommended that students transfer in these courses from the same college for consistency. Please reach out to your DePaul transfer admission counselor if you have any questions. Math Requirement Begin your math sequence as soon as possible prior to transferring. Business Statistics, equivalent to MAT 137 Students are advised to complete the equivalent to MAT 130 Precalculus with a grade of C- or better prior to transferring, as this course is a prerequisite for other classes in the degree. Students will also have the option to test out of this requirement prior to enrolling in their first term at DePaul. For more information on complete degree requirements, please review the onlineuniversity catalog. College of Communication No matter which major you choose to study, you should find courses at your community college that have equivalents at DePaul. Contact us or use the transfer tools available on the Transferring Your Courses webpage prior to taking courses at your community college. The following courses are recommended to be completed prior to your transfer into the College of Communication. Core courses for all majors: Introduction to Human Communication; Mass Communication; Intercultural Communication; Public Speaking Courses by major: Communication Studies:Performance of Literature; Interpersonal Communication; and Research Methods Journalism:Introduction to Journalism; Feature Writing Media and Cinema Studies:History of Cinema; Film and Video Analysis Organizational Communication:Business and Professional Communication; Small Group Communication; Organizational Communication Public Relations and Advertising:Principles of Advertising; Introduction to Public Relations; Writing for Public Relations and Advertising Jarvis College of Computing and Digital Media No matter which of our three schools your major is associated with, courses from your community college should transfer here to DePaul. Course recommendations vary considerably by major; use the transfer tools available on the Transferring Your Courses webpage or contact us if you have specific questions about whether a course will transfer and apply in a specific major. College of Education No matter which major you choose to study, you should find courses at your community college that are likely to have equivalents at DePaul. Contact us or use the transfer tools available on the Transferring Your Courses webpage prior to taking courses at your community college. The following courses are recommended to be completed prior to your transfer into the College of Education: U.S. History and Introduction to the American Political System:these are required courses for all education majors. Introduction to Education:check for transfer equivalences specific to your program and community college where the course is taken. Human Development:select the courses that correlate to the age level you hope to teach (for example, early childhood human development, elementary age human development, adolescent human development, etc.). Educational Psychology:check for transfer equivalence specific to your program and community college where the course is taken. Mainstreaming Students with Disabilities:typically transfers to elementary education and secondary education. Math for Elementary Teachers 1 and 2:typically transfers to elementary education. Begin math sequence as soon as possible at your community college. Physical Education Courses:typically transfers to physical education and exercise science (10 hours required). College of Liberal Arts and Social Sciences Most majors can follow the General LAS Recommendations below, but listed majors have additional recommendations. Please use the DePaul Transfer Guides and Transfer Course Lists to find the courses at your institution that match the recommendations below. General LAS Recommendations Criminology Recommendations DePaul has a transfer agreement with the College of DuPage for students completing the Associate of Applied Science (A.A.S.) in Criminal Justice. More information on this agreement can be foundhere. Latin American and Latino Studies Recommendations Political Science Recommendations Sociology Recommendations College of Science and Health If you plan to major in science, we recommend that you select your major early in your college career. Most science majors require a large number of introductory and prerequisite courses. If you don’t take certain classes right away, it may take you longer than four years to complete your degree. For many of the science, health and math majors, we recommend that you complete two semesters or three quarters of calculus before you transfer here. This will help you be prepared for the math required to take many upper level science and major courses. You don’t have to complete these core requirements before transferring, but we highly recommend you take equivalent courses whenever possible. Along with general education courses, we recommend you take some of these core course in your intended majors: Biological Sciences, Chemistry, Clinical Lab Sciences, Environmental Sciences, Health SciencesandNeuroscience: a yearlong sequence of general biology, a yearlong sequence of general or analytical chemistry. Actuarial Sciences, Data Science, Mathematics,andPhysics*: a yearlong sequence of college calculus. *A yearlong sequence of university physics is recommended if you're considering majoring in Physics. Contact Us Our transfer counselors are always available to answer your questions. Get in touch today with aTransfer Admission Counselor. Phone(312) 362-8300or toll-free(800) 4DePAULoutside Illinois Emailadmission@depaul.edu"
}