{
  "url": "https://www.depaul.edu/admission-and-aid/types-of-admission/transfer-student/Pages/prepare-to-transfer.aspx",
  "title": "\r\n\tPrepare to Transfer | DePaul University, Chicago\r\n",
  "content": "Transfer Student Prepare to Transfer Transferring Your Courses Meet Your Transfer Counselor DePaul Admission Partnership Program University Center Partnerships For Advisors Apply Online Request Info Visit Campus DePaul University>Admission & Aid>Types of Admission>Transfer Student>Prepare to Transfer Prepare to Transfer Transferring to DePaul is simple, but it can be difficult to know where to start. Are you planning ahead or ready to apply? Either way, the following steps will guide you to the information you need: Plan ahead Step 1: Request information from DePaul. Learn more about the transfer process, timelines, credit transfer and your program of interest.Fill out the form. Step 2: Determine which courses will transfer to DePaul. Use these tools to find out how credits will transfer to DePaul.Learn more. Step 3: Connect with your transfer admission counselor. Our transfer admission counselors work to ensure your success.Find your counselor and schedule an appointment. Step 4: Join the DePaul Admission Partnership Program (DAPP). If you attend or are planning to attend a Chicago area community college,consider joining DAPP, a transfer preparation program. Step 5: Attend an upcoming admission event. Visit DePaul, take a tour, learn about transfer partnerships and more.View our admission events calendar. Prepare to apply Transfer students are admitted to DePaul each quarter. (The School of Music and Theatre School only have fall admission.) Step 6: Learn about the transfer admission process. Find out about cumulative GPA requirements, application deadlines and more on ourTransfer Student Admission Process page. Step 7: Familiarize yourself with official transfer policies. Dig into the detailsabout academic policies and graduation requirements. Apply Ready to apply? Go directly to DePaul’s online application for transfer students. Apply Now"
}