{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/organizational-communication.aspx",
  "title": "\r\n\tOrganizational Communication | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Organizational Communication Organizational Communication Develop and practice ethical communication skills The Organizational Communication program explores effective and participatory communication across business and organizational settings. As an organizational communication major you will learn how to think, speak and write clearly—and how to act as an ethical communicator with confidence. And you will also begin to understand the multicultural character of communication in contemporary workplaces and society through courses that blend theory and practice. The College of Communication is located in downtown Chicago, at DePaul’s Loop campus, giving you access to many media outlets and allowing you to meet and work professionally with leading companies in the industry. We also offer the 3+3 BA/JD Program, which allows high-achieving first-year undergraduate students to be admitted simultaneously to the College of Communication (CMN) and the College of Law (LAW). You’ll complete your first three years in CMN and your final three years in LAW. Classes Coursework Communication and Organizational Change The Dark Side of Organizational Communication Human Resources Communication Communication Consulting Diversity, Leadership and Team Building Communication and Corporate Culture Conflict Management and Negotiation Resources Major Requirements Schedule of Classes Department Website Concentrations/Tracks Latino Media & Communication Minor offered Combined bachelor's + master's degree offered Career Options Common Career Areas Advertising account executive Communication analyst Communication coach Communication specialist Content manager Corporate communication coordinator Event coordinator Human resources Leadership skills developer Project manager 94% of Organizational Communication graduates were employed, continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program."
}