{
  "url": "https://www.depaul.edu/Pages/default.aspx",
  "title": "\r\n\tDePaul University | DePaul University, Chicago\r\n",
  "content": "DePaul University DePaul University Nationally Respected, Personally Focused Entrepreneurship program ranked #12 Read more from the Princeton Review Request Info 21,210 60% 3,800+ 214,000+ 72% More about DePaul Academics 130+ 170+ 10 Explore Campus Virtually Learn more about our Lincoln Park and Loop campuses. We Are DePaul Explore DePaul and Chicago through the student lens. Applying to DePaul Visit DePaul Request More Info Join our mailing list to learn more about DePaul and what you’re interested in here. Request More Info Join our mailing list to learn more about DePaul and what you’re interested in here. Take the Next Step Join our mailing list to learn more about DePaul and what you’re interested in here. News and Headlines Give to DePaul Create endless opportunities for countless current students. Make your gift to support DePaul today! Our Commitment to Anti-Discrimination DePaul University does not discriminate on the basis of race, color, ethnicity, religion, sex, gender, gender identity, sexual orientation, national origin, age, marital status, pregnancy, parental status, family relationship status, physical or mental disability, military status, genetic information or other status protected by local, state or federal law in matters of admissions, employment, housing, scholarships, loans, athletics and other school-administered programs. Individuals who believe they have been subjected to discrimination, harassment or retaliation are encouraged toreport what happened. DePaul also complies with federal and state laws that prohibit discrimination, including Title IX of the Education Amendments of 1972 and its implementing regulations. To that end, DePaul prohibits discrimination based on sex (including sexual harassment) in the university’s educational programs and activities, including in matters of employment and admissions. Any alleged violations of this policy or questions specific to sex discrimination (including sexual misconduct and sexual harassment) should be directed to DePaul’s Title IX Coordinator/Director of Gender Equity. Visit DePaul’sTitle IX websitefor contact information and to learn about more options for reporting allegations of sex or gender-based discrimination, harassment or violence."
}