{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/physics.aspx",
  "title": "\r\n\tPhysics | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Physics Physics Explore the underlying principles of physics The bachelor’s degree in Physics program coursework focuses on scientific investigation, laboratory experience and research opportunities to give you hands-on experience in the field of physics. You’ll work with faculty members on research projects, which may result in your work being published in journals. Faculty members conduct research projects in a variety of areas, including complex fluids, materials science, ultra-fast physics, nuclear physics and observational astronomy. The physics and astrophysics department offers a five-year joint program in engineering with the Illinois Institute of Technology (IIT). Upon completion of the bachelor’s degree in physics program, you will earn a Bachelor of Science in Physics with a concentration in Engineering Physics from DePaul and a Bachelor of Science in Aerospace, Computer, Electrical or Mechanical Engineering from IIT. DePaul offers a variety of combined degree options, including a combined bachelor's degree in Physics/master's in Secondary Education Physics, which allows you to complete a bachelor's degree and a graduate degree in five years. For international students: this program is a STEM-designated program, which can qualify you to extend your post-graduation stay in the United States. Classes Coursework Biology Calculus Earth System Science Electricity and Magnetism Experimental Physics Mechanics Methods of Computational and Theoretical Physics Programming Languages Quantum Mechanics Resources Major Requirements Schedule of Classes Department Website Concentrations/Tracks Standard Physics Computational Physics Engineering Physics Interdisciplinary Physics Minor offered Combined bachelor's + master's degree offered Career Options Common Career Areas Computer science Electronics development Engineering Optics Photonics Post-graduate study Research Scientific computing 95% of Physics graduates were employed, continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program."
}