{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/italian.aspx",
  "title": "\r\n\tItalian | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Italian Italian Discover Italian language and culture As an Italian major, you will study the language, literature and culture of the Italian-speaking world. You will learn how the Italian influence extends throughout the world in art, music, literature, fashion and cuisine. Chicago is home to vibrant Italian and Italian-American communities, providing you with opportunities to visit the Little Italy neighborhood, dine at Italian restaurants and attend Italian cultural events, all while developing proficiency in Italian language. Take advantage of DePaul’s study abroad program at Italiaidea in Rome or at Università Cattolica in Milan. Short-term study abroad programs are also available in Milan, Bologna, Parma and Modena titled “Italy: Food and Fashion.” We also offer the 3+3 BA/JD program, which allows high-achieving first-year undergraduate students to be admitted simultaneously to the College of Liberal Arts and Social Sciences (LAS) and the College of Law (LAW). You’ll complete your first three years in LAS and your final three years in LAW. Classes Coursework Origins of Italian Literature: The Middle Ages Masterpieces of the Italian Renaissance 20th Century Writers and Culture The Italian Novel Translation Italian for Business Italian Language in the Society of Communication Eat Italy: the History, Culture and Politics of Italian Food Resources Major Requirements Schedule of Classes College Website Concentrations/Tracks Commercial Italian Italian Language and Literature Italian Studies Modern Languages minor offered Combined bachelor’s + master’s degree offered Career Options Common Career Areas Public policy International business Translation services Governmental work Education Immigration work Social services Law Human rights 84% of Italian graduates were employed, continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program."
}