{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/real-estate.aspx",
  "title": "\r\n\tReal Estate | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Real Estate Real Estate Study real estate in a world-class city Our Real Estate degree program will prepare you to work and excel in the real estate community at the local and national levels, and to adapt to future changes in the industry. As a Real Estate major, you’ll strengthen your financial and analytical skills, including risk analysis, portfolio construction and management, cash flow analysis and investment strategy. As you work towards your degree, you’ll gain an understanding of the organizational structure of financial institutions and the impact of financial markets on real estate. You’ll also examine how historical development of real estate impacts present and future development patterns. You’ll learn from a faculty of scholars and professionals with a wealth of real-world experience in the real estate industry. Our Real Estate degree program offers robust mentoring and internship services. DePaul is located in the heart of Chicago’s financial and business community, and its Real Estate Center is a leading place for professional real estate education and networking in the Midwest. An active network of students and alumni, members of public institutions, private real estate firms, scholars and executives participate in events held by The Real Estate Center, allowing you to build relationships with industry professionals. Classes Coursework Geographic Information Systems Investment Theory and Practice Planning and Public Policy Real Estate Finance and Investment Real Estate Law Sustainable Development Urban Economics and Planning Resources Major Requirements Schedule of Classes Department Website Minor offered Combined bachelor's + master's degree offered Career Options Common Career Areas Acquisitions Asset management Construction management Corporate financing Financial analysis Leasing management Marketing management Mortgage financing Operations management Project management Property management Real estate development 94% of Real Estate graduates were employed, continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program."
}