{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/game-design.aspx",
  "title": "\r\n\tGame Design | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Game Design Game Design Create unforgettable game experiences through design DePaul’s Game Design degree program teaches the fundamentals and details of game design, and prepares you to work in computer gaming and interactive media fields as storytellers, critical thinkers, entrepreneurs and leaders in the field of gaming. Throughout the Game Design program, you’ll collaborate on interdisciplinary teams with programmers, artists, writers and audio designers. You’ll learn about the entire game development cycle, from ideation to documentation, prototyping, implementation, iteration and testing. As a Game Design major, you’ll have four different gaming labs to take advantage of: development and research labs, the game play lab, the augmented reality lab and the playtest and usability lab. Classes Coursework 3-D Design and Modeling Animation Game Development Game Sound Design Playgramming Practical Scripting for Games Visual Design Resources Major Requirements Schedule of Classes Department Website Combined bachelor's + master's degree offered Career Options Common Career Areas Animation Commercial production Computer graphics Film production Game development Software engineering Television production 88% of Computing and Digital Media graduates were employed,continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program."
}