{
  "url": "https://www.depaul.edu/about/administration/Pages/vasquez-de-velasco.aspx",
  "title": "\r\n\tGuillermo Vásquez de Velasco, PhD | DePaul University, Chicago\r\n",
  "content": "About Rankings Campuses Chicago Events Mission President Administration Distinctions History & Timeline Accreditation & Licensure Apply Online Request Info Visit Campus DePaul University>About>Administration>Guillermo Vásquez de Velasco, PhD ​​Guillermo Vásquez de Velasco, PhDDean, College of Liberal Arts and SciencesWebsite ​​Guillermo Vásquez de Velasco, PhD Dean, College of Liberal Arts and Sciences Guillermo Vásquez de Velasco is dean and professor of Art, Media and Design in theCollege of Liberal Arts and Social Sciences. Previously, he has served as vice provost and dean of the College of Architecture and Planning at Ball State University, and as executive associate dean of the College of Architecture at Texas A&M University. Prior to his tenure at DePaul, Ball State, and Texas A&M, Vásquez de Velasco held teaching and research positions at Delft University of Technology in the Netherlands, and the Sagrado Corazón University in Lima, Peru. He earned his bachelor’s degree in architecture and urban planning in 1979 from Ricardo Palma University in Lima, Peru; his master’s degree in architecture in 1982 from the University of Toronto in Canada; and his doctoral degree in architecture from Delft University of Technology in The Netherlands in 1991. Recipient of multiple awards and recognitions, Vásquez de Velasco has combined professional practice in architecture and urbanism, with teaching, scholarship, and academic administration into a career that celebrates Design Thinking, multidisciplinary collaboration and the constant exploration of digital technologies in design and education. He is a passionate advocate of the critical mission of the liberal arts in the 21st century and its key function in the education of future leaders. In recognition of his seminal work in the early development and use of digital technology in education he received a Teaching Excellence Award from the Association of Former Students of Texas A&M University, and for the development of a wide variety of innovative international programs in Europe, Latin America, and Asia he was also recognized with the TAMU International Excellence Award. Vásquez de Velasco is married to Antonieta Angulo who shares many of his same professional and academic credentials. Their son, Adrian is a filmmaker based in New York City and co-founder of the TotalCinema360 Studio."
}