{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/recreation-sport-management.aspx",
  "title": "\r\n\tRecreation and Sport Management (BA) For Adult Students | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Recreation and Sport Management (BA) For Adult Students Recreation and Sport Management (BA) For Adult Students Become a leader in recreation and sports management By earning your DePaul recreation and sports management degree online as an adult working professional, you can advance or start your sports management and recreation career. Our Bachelor of Arts (BA) in Recreation and Sports Management program emphasizes a multidisciplinary understanding of leisure services management and leadership that will prepare you to manage recreation and sports organizations. As you work toward your degree, you’ll develop your professional portfolio with further study in sports management, fitness, recreation administration and event planning. Courses you’ll take in this online degree program emphasize leadership and talent development, sports psychology, community health, nutrition and motor development. Sports management and recreation services are some of the largest and fastest growing industries in the world, especially in Chicago—home of the largest municipal parks and recreation organization in the country. With our online degree program, you’ll take all your courses online, with the exception of a few elective courses that you’ll complete on campus. Classes Coursework Organization/Administration of PE, Sport and Fitness Event Planning Creativity and Entrepreneurship Leisure, Recreation and Health Personal & Community Health Psychology of Sport Behavior Talent Development for Managers Theory and Techniques of Coaching Resources Major Requirements Schedule of Classes College Website Combined bachelor’s + master’s degree offered Career Options Common Career Areas Sports director Park supervisor Corporate sports agency director Director of recreation Health and fitness manager Event manager Recreation program director Sports information specialist Sports marketing director Get more information Complete the form below to receive more information about this degree program."
}