{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/game-programming.aspx",
  "title": "\r\n\tGame Programming | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Game Programming Game Programming Learn from game development pioneers DePaul’s Game Programming program will teach you the fundamentals and details of programming, with a focus on the interdisciplinary aspects of game development. Throughout your game development degree coursework, you’ll collaborate on teams with other programmers, artists, game designers, producers, writers and audio designers. Upon completion of the program, you’ll be prepared to work in computer gaming and programming, as well as interactive media fields. You’ll have four different gaming labs to take advantage of: development and research labs, the game play lab, the augmented reality lab and the playtest and usability lab. For international students: this program is a STEM-designated program, which can qualify you to extend your post-graduation stay in the United States. Classes Coursework 3-D Design and Modeling Computer Graphics Development Computer Systems Discrete Mathematics Game Engine Programming Practical Scripting for Games Resources Major Requirements Schedule of Classes Department Website Combined bachelor's + master's degree offered Career Options Common Career Areas Animation Commercial production Computer graphics Film production Game development Software engineering Television production 88% ​of Computing and Digital Media graduates were employed, continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program."
}