{
  "url": "https://www.depaul.edu/distinctions/Pages/to-the-streets.aspx",
  "title": "\r\n\tTaking Art To The Streets  |  Distinctions  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Taking Art To The Streets Associate professor Jim Duignan founded the Stockyard Institute over 20 years ago. This “traveling circus” of opportunities for underserved youth has grown into a model for arts education in the years since. In 1995,Jim Duignan, associate professor in the College of Education, wanted to start an arts education program that would be relevant to young, at-risk students. “I imagined a place where troubled kids in tough neighborhoods could use art—in all its many forms—to figure things out,” he says. The place of Duignan’s imagination became the Stockyard Institute, a “traveling circus” of educational and artistic opportunities for the underserved youth in communities like Back of the Yards and Austin. The Stockyard Institute finds spaces in Chicago neighborhoods where artists, writers, musicians, filmmakers, poets, broadcasters, activists, and educators work with teens in projects and programs that enable the youth to develop, exchange, and disseminate stories and build structures to organize their ideas. As a model for arts education, the Stockyard Institute combines two worlds, as Duignan explains. “When it comes to creative practice, education falls short in its offerings to a wide range of students; when it comes to recognizing the visionary status of young people, the art world is often closed off. The Stockyard Institute raises questions of what we teach and how we teach it. Here, we invite kids into the design of what they’re learning; we encourage them to interpret their experiences and become ‘producers’ instead of consumers of content.” Jumping The Gap The first project of the Stockyard Institute in 1995 was an art curriculum for a Back of the Yards middle school. “The artists were a bunch of boys from neighboring drop-out list,” recalls Duignan. “I decided to create projects based on their lives. One of the kids said his greatest fear was being shot in the back on the way to school; so, as a class we designed and built a ‘gang-proof suit’ to protect him. Other students were interested in radio, so we built a one-watt station and started broadcasting.” “We’re representing the artists who work in alleys, park districts, and schools.” Jim Duignan, associate professor, DePaul University Since then, theStockyard Institutehas worked with youth from nearly 40 area schools, community centers, and social facilities. Duignan’s idea—to make art relevant to high school students by involving them in what famed educator and theorist Paulo Friere calls the “construction of their own knowledge”—has proved successful. His first students were all accepted by private high schools and continued their educations. “Their confidence to apply came from feeling chosen,” he says. And Stockyard Institute “alumni” came back to teach the next generation. “No one really touched by the Institute has completely left.” See For Yourself The Institute’s current incarnation is the Nomadic Studio — a special exhibit at the DePaul University Art Museum (July 8 through November 20) that replicates and is an active Stockyard Institute site in both space and content. “In this museum space, we’re showing new audiences what the Stockyard Institute is all about and how it works,” says Duignan. For four months, the art museum has been “repurposed” as a working studio—a space for production, exhibition, development, performance, publication, and education. One half is exhibition and performance space, the other half is an area for production, research, workshops, and the Stockyard Institute printing press. Visitors can see art programs, live music, lectures, a recording studio, radio broadcasts, and more. The Nomadic Studio is part of Studio Chicago, a year-long, collaborative, city-wide project celebrating the working artist in a variety of contexts through exhibitions, lectures, publications, tours, and research. Participating organizations include the Chicago Department of Cultural Affairs, Columbia College Chicago, DePaul University Art Museum, Gallery 400 at UIC, Hyde Park Art Center, Museum of Contemporary Art, The School of the Art Institute of Chicago, and threewalls. “The Nomadic Studio is a public exploration of the incidental and provisional spaces where people make art of all kinds,” says Duignan. “We’re representing the artists who work in alleys, park districts, and schools.” ■ Learn what makes DePaul Distinctive Global Health and Human Rights Find out why researchers are working to eliminate health disparities around the world. Protein Puzzles Discover how studying a protein may lead to curing and preventing Alzheimer’s disease."
}