{
  "url": "https://www.depaul.edu/about/administration/Pages/clements.aspx",
  "title": "\r\n\tAdministration  |  About  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "About Rankings Campuses Chicago Events Mission President Administration Distinctions History & Timeline Accreditation & Licensure Apply Online Request Info Visit Campus DePaul University>About>Administration>Elizabeth Clements Elizabeth ClementsVice President, University CommunicationsWebsite Elizabeth Clements Vice President, University Communications Elizabeth is t​he vice president forUniversity Communications​at DePaul University. She is responsible for leading all communications strategies across the university, including crisis response, issues and reputation management, media relations, and executive and internal communications. A strategic communications leader, Elizabeth has more than 20 years of experience in higher education and government institutions. She previously served as associate vice president for University Communications. She first joined DePaul’s Office of Public Relations and Communications in 2012, leading executive and internal communications initiatives across the university. Prior to DePaul, Elizabeth led communications for multiple global particle physics projects at Fermilab, a U.S. Department of Energy laboratory in Batavia, Illinois. Her work included developing and implementing strategic communication plans for national and international scientific projects. She also managed communications for Fermilab’s government relations activities and organized public relations events, including an international pajama party to celebrate the startup of the Large Hadron Collider at CERN. Elizabeth is active in her local community and served as chair for the City of Geneva Strategic Plan Advisory Committee from 2017-19. She was a member of the Strategic Plan Advisory Committee from 2014-19. She volunteers for the Lazarus House Homeless Shelter and the Northern Illinois Food Bank. She is also a member of CHIEF. Elizabeth has a bachelor’s degree and a master’s degree in English literature from Brown University. She also has a 1st degree black belt in Kyuki-Do, a mixed martial art."
}