{
  "url": "https://www.depaul.edu/academics/Pages/default.aspx",
  "title": "\r\n\tAcademics | DePaul University, Chicago\r\n",
  "content": "Academics Academics DePaul looks good on paper — solid rankings, impressive outcomes — but it’s your experience that matters. Here, you’ll be challenged by professors to analyze and solve real-world problems. 130+Undergraduate Majors Take all the basic classes you expected. Add real-world experiences you didn’t. Graduate Programs Tie theory to practice. Refine your skills. Advance your career. Colleges and Schools Whether you’re just beginning college or seeking an advanced degree, DePaul’s schools and colleges adhere to the highest standard of academic rigor and innovation. Visit each site for information on its departments, faculty, research and vision. Driehaus College of Business Established in 1912, theDriehaus College of Businessis the nation's 10th-oldest business school. It serves undergraduate students. TheKellstadt Graduate School of Business, housed within Driehaus, offers graduate business degrees and executive education programs. College of Communication TheCollege of Communicationprovides students with a combination of timeless principles and up-to-the-minute tools, whether they're pursuing communication studies including media and cinema studies, multicultural, organizational, and relational communication; digital communication; health communication; sports communication; journalism; or public relations and advertising. Jarvis College of Computing and Digital Media (CDM) TheJarvis College of Computing and Digital Media (CDM)offers students a collaborative education where technology, artistry and business intersect. CDM is organized into three schools:The School of Cinematic Arts,The School of Computingand,The School of Design. College of Education TheCollege of Educationprepares educators, counselors and leaders who are committed to creating compassionate, intellectually rich and socially just environments. College of Law The DePaulCollege of Lawwas one of the first law schools in the country to introduce educational innovations like the study of negotiation techniques, courses in international criminal law and pre-trial courses in skills techniques. Today, our health law and intellectual property programs are among the best in the country, according to U.S. News & World Report. College of Liberal Arts and Social Sciences (LAS) The oldest college at DePaul, theCollege of Liberal Arts and Social Sciences (LAS)offers more than 31 undergraduate and 30 graduate degree programs. Courses meet during the day, evenings and on weekends, primarily on the Lincoln Park Campus. College of Science and Health (CSH) TheCollege of Science and Health (CSH)was established in 2011 to help its students meet the demands of the growing fields of science and health. CSH offers multiple undergraduate majors and graduate programs in the areas of biology, chemistry and biochemistry, environmental science, health sciences, mathematics, neuroscience, nursing, physics and psychology. School of Music DePaul'sSchool of Musicwas founded in 1912 and is dedicated to excellence in both music teaching and performance. When they're not working with DePaul students, many of the school's faculty serve as members of the Chicago Symphony Orchestra, Lyric Opera of Chicago or the Grant Park Symphony Orchestra — or as some of the city's most prominent freelance, chamber and jazz musicians. School of Continuing and Professional Studies (SCPS) TheSchool of Continuing and Professional Studies (SCPS)launched on July 1, 2019, offering adult learners the opportunity to expand their knowledge base and leverage their experience. SCPS’ comprehensive, innovative approach to continuing and professional education provides flexible scheduling and delivery modalities to accommodate the unique needs of adult students. The Theatre School Founded in 1925 as the Goodman School of Drama,The Theatre Schoolat DePaul is the Midwest's oldest theatre training conservatory. Known for its highly structured program and set in a world-renowned theatre city, the school has earned a reputation as a standard of excellence in American professional theatre training."
}