{
  "url": "https://www.depaul.edu/about/administration/Pages/zdziarski.aspx",
  "title": "\r\n\tGene Zdziarski, PhD | DePaul University, Chicago\r\n",
  "content": "About Rankings Campuses Chicago Events Mission President Administration Distinctions History & Timeline Accreditation & Licensure Apply Online Request Info Visit Campus DePaul University>About>Administration>Gene Zdziarski, PhD Gene Zdziarski, PHDVice President for Student AffairsWebsite Gene Zdziarski, PHD Vice President for Student Affairs Gene Zdziarski became vice president forStudent Affairsin July 2014. Previously, he served as vice president and dean of students at Roanoke College, providing overall leadership and direction to a comprehensive set of departments and units, including Athletics, Campus Safety, Colket Student Center, Counseling Services, Dean of Students Office, Greek Life, Health Services, Intramurals & Campus Recreation, Multicultural Affairs, Residence Life, Student Activities and Student Conduct. Zdziarski received his Bachelor of Science degree from Oklahoma State University, his Master of Science degree from the University of Tennessee at Knoxville, and his PhD from Texas A&M University. His dissertation was titled “Institutional Preparedness to Respond to Campus Crisis as Perceived by Student Affairs Administrators at Selected NASPA Member Institutions.” Zdziarski also has held positions in a variety of other administrative roles at the University of Florida, University of Tennessee and Texas A&M University. While serving as associate director of Student Life at Texas A&M, Zdziarski was responsible for the coordination and training of the Division of Student Affairs Critical Incident Response Team and was heavily involved in the response to the 1999 bonfire collapse. At the University of Florida, Zdziarski chaired the Division of Student Affairs Crisis Response Team, served as a member of the University Counseling Resource Network and a member of the university’s Emergency Operations Team. At Roanoke College, Zdziarski led the college’s campus crisis management initiatives. Professionally, Zdziarski recently served as the regional vice president for Region III in the National Association of Student Personnel Administrators (NASPA) and was also a member of the NASPA National Board of Directors and the Region III Advisory Board. He currently serves as an associate editor for the Association for Student Judicial Affairs Journal Board and is an active member of the American College Personnel Association. Zdziarski frequently has represented these professional organizations at governmental meetings and summits with the U.S. Department of Education, U.S. Department of Justice and the U.S. Secret Service. He served on the “Expert Panel on Emergency Management in Higher Education” (November 2007), the “Campus Safety Summit” (February 2008) and as a panelist on “Education News Parents Can Use” (November 2008). He has also been invited to serve as a subject matter expert in a collaborative effort between the U.S. Department of Education Office of Drug and Safe Schools, the Federal Bureau of Investigation Behavioral Analysis Unit and the U.S. Secret Service National Threat Assessment Center to study incidents of targeted school violence in institutions of higher education. In addition to his involvement in such governmental efforts, Zdziarski regularly makes professional presentations at national, regional and state meetings on topics including crisis management, dispute resolution and legal issues in higher education. He has co-authored two books: “Crisis Management: Responding from the Heart” and “Campus Crisis Management: A Comprehensive Guide to Planning, Prevention, Response, and Recovery.” Following the release of the “Report to the President on Issues Raised by the Virginia Tech Tragedy,” Zdziarski was asked to serve as a co-editor on a NASPA monograph titled “In Search of Safer Campuses: Emerging Practices for Student Affairs in Addressing Campus Violence.” He also has written several articles and book chapters and served as a consultant to a variety of colleges and universities. ​​"
}