{
  "url": "https://www.depaul.edu/admission-and-aid/visit-depaul/undergraduate-virtual-visits/Pages/default.aspx",
  "title": "\r\n\tVisit DePaul - Undergraduate Students | DePaul University, Chicago\r\n",
  "content": "Undergraduate Visits Undergraduate Visits Here are the ways you can experience DePaul Admitted Student Preview Days At an Admitted Freshman Preview Day, you will get an in-depth look at your academic college by meeting current faculty, participating in a sample class, hearing from our Career Center and meeting other newly admitted students. Space is limited for this in-person event! Register for an Admitted Student Preview Day On-Campus Visits Are you ready to experience DePaul in person? Join us for a prospective student information session, student-led tours of our campuses, or one of our other in-person visit opportunities! FreshmanTransferAdult UndergraduateAdmitted Virtual Visits Can’t make it to campus just yet? Attend one of our many virtual events, including information sessions and tours, to get a head start prior to visiting campus! FreshmanTransferAdult UndergraduateAdmitted Individual Appointments with an Admission Counselor Meet with your counselor online in a personal one-on-one appointment to go over specific questions. FreshmanTransferAdult UndergraduateInternational Meeting with a Current Transfer Student Transfer students only: Transfer Peer Mentor meetings are available for those who would like to connect with current transfer students to learn more about the student experience! Transfer Peer Mentor Meetings Virtual Campus Tour Life at DePaul Learn about student life at DePaul, including campus housing, social events, and the city of Chicago. On-Campus Housing Take a look at the housing options we have available on our Lincoln Park and Loop campuses. View our student-run Instagram page See our alumni stories on YouTube Watch Our Student Q&A Videos Hear directly from students about their DePaul experience. Read our student blogs Get advice and read stories by DePaul students about their personal experiences."
}