{
  "url": "https://www.depaul.edu/admission-and-aid/financial-aid/basics/Pages/qualify-for-aid.aspx",
  "title": "\r\n\tQualify for Aid  |  Financial Aid Basics  |  Financial Aid  |  Admission & Aid  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Financial Aid Financial Aid BasicsQualify for AidApply for AidCost of AttendanceImportant DatesNotificationsPrivacy & FERPAExternal Resources Qualify for Aid Apply for Aid Cost of Attendance Important Dates Notifications Privacy & FERPA External Resources Types of Aid Receive Aid Maintain Eligibility Manage Costs Repay Loans Resources for... Forms Contact Us Apply Online Request Info Visit Campus DePaul University>Admission & Aid>Financial Aid>Financial Aid Basics>Qualify for Aid Qualify for Aid Before you can be considered for financial aid, you must be admitted to DePaul as a degree-seeking student, a non-degree aid-eligible graduate student, or a post-baccalaureate non-degree graduate prep student. In addition, you must meet the federal eligibility requirements for aid. Federal Eligibility Requirements To receive financial aid, you must meet the followingfederal eligibility requirements: You must be a U.S. citizen or eligible non-citizen. You must be accepted and currently active in an eligible degree program, an aid-eligible non-degree graduate program, or approved post-baccalaureate non-degree graduate preparatory coursework. You must have a high school diploma, General Educational Development (GED) certificate, or have completed a high school education in a homeschooled setting approved under state law. You must enroll in your program at least half time for most financial aid programs and for loan deferment. You must enroll in courses that are part of your degree or aid-eligible non-degree graduate program or approved post-baccalaureate non-degree graduate preparatory coursework. If it is determined that you have completed your requirements, or if you wish torepeat a coursefor which you have previously earned credit, your financial aid options are limited. You must be in compliance with theSatisfactory Academic Progress (SAP)requirements. You must not be in default on any federal loan or owe a repayment on any federal grant. You must comply with federal regulations governing the use of funds for educational purposes. Students in Special Degree or Approved Non-Degree Scenarios Students pursuing a second undergraduate degree: Students returning for a second undergraduate degree program are eligible for consideration only in the Federal Direct Student Loan program and Private Educational loan programs. When determining overall financial aid eligibility for a second undergraduate degree, there are two lifetime limit regulations students must consider: The Federal Direct Student Loan Program has anaggregate loan limitfor undergraduate studies. The FederalSatisfactory Academic Progress (SAP) policyhas an overall maximum program length for financial aid that is applied when considering attempted credits towards any degree. Undergraduate students pursuing a double major and/or multiple concentrations: Undergraduate students pursuing a double major and/or multiple academic concentrations should be aware that federal, state and institutional funding availability is limited for optional elective courses. Graduate Non-Degree Study Approved for Federal Student Aid Review yourfinancial aid eligibility requirementsif you are pursuing: post-baccalaureate coursework to prepare for entrance into a graduate program, a graduate post-baccalaureate certificate approved under the gainful employment provisions, or a graduate post-baccalaureate teacher-preparation certificate in the College of Education."
}