{
  "url": "https://www.depaul.edu/admission-and-aid/financial-aid/receive-aid/Pages/graduate.aspx",
  "title": "\r\n\tGraduate  |  Receive Aid  |  Financial Aid  |  Admission & Aid  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Financial Aid Financial Aid Basics Types of Aid Receive AidUndergraduateGraduateLaw Undergraduate Graduate Law Maintain Eligibility Manage Costs Repay Loans Resources for... Forms Contact Us Apply Online Request Info Visit Campus DePaul University>Admission & Aid>Financial Aid>Receive Aid>Graduate Graduate ​ Financial Aid Disbursement Eligibility Chart for Fall, Winter, and Spring Quarters ​ Note: Graduate/Doctoral students completing thesis or dissertation research and registered in program-approved thesis or dissertation research courses are considered to be enrolled half time. **Federal Work-Study recipients: Federal Work-Study funds are not disbursed to your university account. You receive federal work-study funds through either direct deposit or a paycheck based on hours worked in a qualified on-campus job. Eligibility Notes Assumes all general financial aid eligibility requirements, need requirements and program-specific enrollment requirements are met, including active confirmed attendance/participation in all courses for which financial aid is authorized. Also assumes enrollment in courses that apply toward your degree program, and compliance with thefinancial aid repeat-course policy. December intersession is treated as part of winter quarter for financial aid purposes. Graduate students who plan to enroll only in December intersession without enrollment in winter quarter may be eligible for lesser loan amounts. Pleasecontact the Office of Financial Aid at OneDePaulfor questions about December intercession enrollment. Summer enrollment requirements may vary; please refer to the online Request for Summer Financial Aid (available in Campus Connect after April 1 each year). Withdrawal from courses may have serious consequences. Your aid may be recalculated based on a failure to begin attendance in classes or failure to participate in online classes, and you may no longer be eligible for the financial aid disbursed to you. For more information, please refer to theWithdrawal From Classessection of this website. Federal Work-Study assumes active participation in a Federal Work-Study-eligible DePaul student employment position. Also assumes all general financial aid eligibility requirements and program-specific enrollment requirements are met, including active confirmed attendance/participation in all courses for which financial aid is authorized."
}