{
  "url": "https://www.depaul.edu/Pages/terms-of-use.aspx",
  "title": "\r\n\tDePaul University | DePaul University, Chicago\r\n",
  "content": "DePaul University Recent Apply Online Request Info Visit Campus DePaul University>Terms of Use Terms of Use DePaul University (“DePaul”) provides the official pages of its website and any Sites provided herein (collectively, the “Sites”) to you subject to the terms and conditions of use (“Terms”) contained herein.By accessing or using the Sites subject to these Terms, and in consideration for the Sites we provide to you, you agree to abide by these Terms.Please read them carefully before accessing or using the Sites. If you do not agree to be bound by these Terms, please promptly exit the Sites. DePaul Policies and Guiding Principles Acceptable Use Policy/Network Security Digital Millennium Copyright Act (DMCA) Response Endorsements Policy Copyright and Fair Use Progressive Discipline DePaul University Guiding Principles on Speech and Expression Rules for Online Conduct Posting You agree that you will not post content, and DePaul reserves the right to remove certain content that you may post, if it is illegal, obscene, defamatory, threatening, infringing of intellectual property rights, in violation of University policy, invasive of privacy or otherwise injurious or objectionable. By posting content within the Sites, you warrant and represent that you either own or otherwise control all of the rights to that content, including, without limitation, all the rights necessary for you to provide, post, upload, input or submit the content, or that your use of the content is a protected fair use. You agree that you will neither knowingly and with intent to defraud provide material and misleading false information, nor will you access or attempt to access another user’s account, or misrepresent or attempt to misrepresent your identity while using the Sites. You also represent and warrant that the content you supply does not violate these Terms and that you will indemnify and hold DePaul harmless for any and all claims resulting from content you supply or your violation of these Terms. Collecting Personal Information from Children Collecting personal information from children under the age of 13 is prohibited. No content should be directed toward such children without the express written permission of DePaul. Permission to Use Materials In consideration for your agreement to the Terms, DePaul grants you a personal, non-exclusive, non-transferable license to access and use the Sites. You may download materials from the Sites only for your own personal, non-commercial use. You may not otherwise copy, reproduce, retransmit, distribute, publish, commercially exploit or otherwise transfer any material. The burden of determining that use of any information, software or any other content on the Sites is permissible rests with you. Unmoderated Forums and Links to Other Sites The Sites may include unmoderated forums containing personal opinions or expressions of posting individuals. The content of these forums represent individual author opinions and are not reviewed, approved or endorsed by DePaul. DePaul is not a publisher of any of the content on these Sites, or of any content that may be available through links to and from them, and is acting solely as an internet service provider. 47 U.S.C. § 230(c)(1). The Sites may also include hyperlinks to websites maintained or controlled by others. DePaul is not responsible for and does not routinely screen, approve, review or endorse the contents of or use of any of the products or sites that these websites may offer. Disclaimer of Warranties and Limitation of Liability The Sites are provided on an “as is” and “as available” basis. DePaul makes no representations or warranties of any kind, express or implied, as to the Sites’ operation or the information, content or materials included on the Sites. Any information that a college, school, department or office of DePaul presents on or through the Sites is made available solely for general information purposes. DePaul does not warrant the accuracy, completeness or usefulness of this information. To the full extent permissible by applicable law, DePaul hereby disclaims all warranties, express or implied, including but not limited to implied warranties of merchantability and fitness for any particular purpose. DePaul will not be liable for any damages of any kind arising from the use of or inability to use the Sites.You expressly agree that you use the Sites or rely upon information within the Sites solely at your own risk. Copyright Complaints DePaul respects the intellectual property of others and requires that users do the same. If you believe that your work has been copied and is accessible on the Sites in a way that constitutes copyright infringement or that your intellectual property rights have been otherwise violated, please contact us at:abuse@depaul.edu. Privacy Policy Please read ourPrivacy Policy, which is incorporated herein by reference. Applicable Law and Forum for Disputes DePaul hosts the Sites on computing resources in the Chicago, Illinois area. You agree that any dispute arising out of or relating to these Terms or any content posted to a Site, including copies and republications thereof, will be governed by the laws of the State of Illinois. You further consent to the personal jurisdiction of and exclusive venue in the federal and state courts located in Cook County, Illinois as the proper legal forum for any such dispute. Modification to These Terms DePaul reserves the right to change, at any time, at our sole discretion, the Terms under which we offer these Sites. You are responsible for regularly reviewing these Terms. Your continued use of the Sites constitutes your agr​eement to all such Terms."
}