{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/healthcare-administration.aspx",
  "title": "\r\n\tHealthcare Administration (BA) For Adult Students | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Healthcare Administration (BA) For Adult Students Healthcare Administration (BA) For Adult Students Build a valuable, varied skill set in healthcare The Bachelor of Arts (BA) in Healthcare Administration is designed for working adults seeking to advance their healthcare career, or want to pursue a career in healthcare. As you work toward your degree, you’ll develop your professional portfolio with further study in healthcare, business administration and management. Courses you’ll take in this program emphasize immediate practical application of academic knowledge and acquiring skills in the healthcare workplace. Our professors are leaders in their fields, and are committed to teaching and mentoring adult students. With our dedicated adult student advisors, you’ll have the road map and resources you’ll need to succeed — while you’re completing your degree and after graduation. Classes Coursework The Business of U.S. Healthcare in a Changing Environment Community Health Assessment Healthcare Management Healthcare Policy in the U.S. Introduction to Health Science Introduction to Public Health Management Information Systems Resources Major Requirements Schedule of Classes College Website Combined bachelor's + master's degree offered Career Options Common Career Areas Clinical administrator Health insurance specialist Hospital administrator Insurance underwriter Nursing home administrator Practice manager Social and community service manager Social welfare administrator Get more information Complete the form below to receive more information about this degree program."
}