{
  "url": "https://www.depaul.edu/admission-and-aid/types-of-admission/transfer-student/for-advisors/Pages/default.aspx",
  "title": "\r\n\tFor Advisors  |  Transfer Student  |  Types of Admission  |  Admission & Aid  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Transfer Student Prepare to Transfer Transferring Your Courses Meet Your Transfer Counselor DePaul Admission Partnership Program University Center Partnerships For AdvisorsIllinois Articulation InitiativeTransfer Agreements Illinois Articulation Initiative Transfer Agreements Apply Online Request Info Visit Campus DePaul University>Admission & Aid>Types of Admission>Transfer Student>For Advisors For Advisors In order to serve the needs of transfer advisors at Illinois community colleges, we've compiled a collection of links to help you advise students about transferring to DePaul University. Applying for AdmissionLearn moreabout the transfer admission process, orapply for admissionas a transfer student. Transfer Articulation Center (TrAC)Ask questions regarding transfer credit or Form 13 by contactingTrAC@depaul.edu. Community CollegesTheCommunity College Partnerships siteshows contact names and special agreements DePaul has with Illinois community colleges.Check ourUndergraduate Visits pageto find out about other events held here on campus sponsored by the Office of Admission. Illinois Articulation Initiative (IAI)DePaul is a member of the Illinois Articulation Initiative. Read about DePaul'sIAI agreement, which requires some mission-specific courses, along with the General Education Core Curriculum. Major RequirementsYou can see the requirements in all DePaulmajorsalong with the Liberal Studies Requirements at this link. Transfer Course WorkTransfer Course Lists: Check the Transfer Course Lists to see if courses transfer.Transferology(formerly u.select) will give you quick answers on how your college credits will transfer to DePaul. Set up an account, add your coursework and get your results immediately. Read about ourAcademic Policies,includinginformation for Transfer Studentsat DePaul in our Undergraduate Catalog. Course RecommendationsLearn more aboutcourses we recommendtransfer students take before enrolling here at DePaul. If you want to inquire about a partnership with your institution,contact the Director of Community College Partnerships."
}