{
  "url": "https://www.depaul.edu/distinctions/Pages/supply-chains.aspx",
  "title": "\r\n\tSupply Chains on Steroids  |  Distinctions  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Supply Chains on Steroids Nezih Altay discusses solutions to bring relief to devastated places and people. Nezih Altay—called the 'disaster guy' because of his recognized research in humanitarian supply chain management—is looking for a better way to bring relief to devastated places and people. The seed of Nezih Altay’s interest in humanitarian supply chains was planted in 1999 during a 7.2 earthquake in Istanbul only days before his wedding. Asking the right questions “My wife and I were staying with our parents, and we were lucky because our homes did not collapse. But we lived for the next five days, with our wedding guests, in a public park. It took the government 72 hours to establish emergency operations. Afterward, questions stayed with me: What took so long? Why isn’t disaster relief more effective and efficient?” Seven years later, Altay—an associate professor in the Driehaus College of Business—published his first paper about humanitarian supply chains and, in doing that, asked colleagues to join him in finding answers. “After a disaster—whether a hurricane, or an earthquake, or a tsunami, or an act of terrorism—priorities are always the same: Lives need to be saved, and then people need shelter, water and food. Given this universality, you’d think countries and NGOs would have in place proven policies and procedures. But they don’t, really,\" he says. \"The process of delivering goods—which happens commercially everywhere, every day—breaks down because everything that’s lacking needs to be brought to the disaster zone from other areas. This creates a temporary, but immense, material convergence in one place. What can be done to fix that? Very little substantive research has been done on that question.” Multiple Problems, No Simple Solution Commercial enterprises prepare for disruptions by making their supply chains resilient, whether by mapping alternative pathways to markets, or prepositioning stock in accessible locations, or running operations from an emergency command center. These strategies require business intelligence and collaboration, and that’s the rub for humanitarian supply chains. “First of all, humanitarian relief is a political game.” Nezih Altay, Associate Professor, Driehaus College of Business “A country hit by a disaster has to ask for assistance: No one can just show up and say ‘We’re here to help.’ When an earthquake devastated southeastern Iran in 2003, the government refused help from Israel, even though Israel has the world’s best search-and-rescue teams, which could have been on-the-ground immediately. It was Iran’s choice to put politics before people. Also, customs laws need to be relaxed so shipments can enter the country quickly, and that can be politically problematic because all kinds of things can cross an open border.” Next, the sheer scope-of-need defies organization. Of the two million Syrian refugees in Turkey today, 850,000 are in camps. A camp in Jordan has 800,000 refugees, making it the country’s fourth largest city. No food is grown in a camp; no products are made for export. Sanitation is a problem, as is crime, hoarding, looting and other forms of black market opportunism. And some refugee camps never disperse, so a temporary crisis becomes a permanent problem, says Altay. “In Haiti 300,000 people still live in camps. One reason is corruption: A lot of the $10 billion in aid sent to Haiti never trickled down. Another reason is that life in the camp is better than it was before: In the camp, people are fed and sheltered. Why go back to homelessness? Twenty years ago in Kenya, a camp for 5,000 war refugees from Somalia was set up; now 500,000 people live there. A whole generation has been born in, and has never left, that camp.” The role of NGOs (non-government organizations) poses additional challenges. Since there’s no certification system for relief work, some NGOs know what they’re doing and some don’t. Large NGOs—which get funds from the United Nations Office of Crisis and Humanitarian Assistance—are pressured to spend, fast. So, they subcontract relief work to local, smaller groups which spring up overnight. Again, there are plenty of opportunities for confusion and corruption. Another somewhat surprising problem is what Altay calls donation pollution. “When unsolicited goods are sent by people or companies—usually with good intentions, but sometimes to dump excess inventory—they cause, in the words of one NGO executive, a ‘second disaster’: No one wants the items, and no one owns the items, but they have to be processed, somehow, anyway. That takes up already scarce resources, costing time and money.” Searching for a Better Way Altay calls disaster relief “a supply chain on steroids” because of the big powers, the big money, and the big pressure to do everything very, very fast. The large number of players creates material convergence and gridlock: The governments and relief workers, the NGOs, the military people, the helpful volunteers, all run to the same location, at the same time. “The process is difficult to control, and there’s typically no single coordinating body. Even people with the best of intentions can mess things up.” Nezih Altay, Associate Professor, Driehaus College of Business In his work, Altay is using mathematical modeling to find ways to optimize the equitable allocation of relief funds. And he’s mapping information flows within and between relief organizations and inside refugee camps to improve the delivery of goods and services during a disaster and after. His class, Managing Humanitarian Supply Chains, is an elective in the MA in Refugee and Forced Migration Studies program. “When it comes to humanitarian supply chains, there are so many questions that urgently need answers,” says Altay. “But I’m an optimist, and I’m a believer in education. As we gain in understanding, we’ll develop smarter solutions. Then, we’ll just have to challenge governments to implement them.” ■ Learn what makes DePaul Distinctive Health Informatics Enid Montague discusses the Health Informatics program’s distinctive value. Mission to Mars Suzanne Bell discusses her research and how it is contributing to long-distance space exploration."
}