{
  "url": "https://www.depaul.edu/admission-and-aid/financial-aid/types-of-aid/Pages/private-loans.aspx",
  "title": "\r\n\tPrivate Loans  |  Types of Aid  |  Financial Aid  |  Admission & Aid  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Financial Aid Financial Aid Basics Types of AidScholarshipsFederal LoansPrivate LoansGrantsMilitary & Veteran BenefitsAssistantshipsStudy AbroadWork-Study Scholarships Federal Loans Private Loans Grants Military & Veteran Benefits Assistantships Study Abroad Work-Study Receive Aid Maintain Eligibility Manage Costs Repay Loans Resources for... Forms Contact Us Apply Online Request Info Visit Campus DePaul University>Admission & Aid>Financial Aid>Types of Aid>Private Loans Private Loans Private loans are non-federal educational loans. These loans are typically offered by private lenders (educational financing institutions, guaranty agencies, banks) to assist with educational and living expenses not covered by other financial aid. In general, you may borrow up to the cost of education minus all other financial aid you receive. For many students and parents, private loans represent an important resource to help finance educational expenses. Private loans can help fill the gap between need-based financial aid and your total educational costs. Private loans also can help with “one-time” educational expenses, such as studying abroad. Before considering a private loan, make sure that you have taken advantage of all your federal student loan opportunities. Selection of a private lender is an important decision, and you should carefully research your lender. DePaul does not enter into student loan lending agreements or arrangements with external agencies, nor does it enter into any agreements with agencies outside the United States. This is important to know if you are an international student or a student considering international study. Things to Know Before You Apply for a Private Loan The maximum amount of your loan FAFSA filersYour eligibility for a private loan is determined by the difference between your total Cost of Attendance (COA) and any other financial aid. If you have applied for and have been awarded financial aid, you can refer toCampus Connector your financial aid award letter to find your total COA and the amount of aid you've already been awarded. To calculate your maximum eligibility, subtract your total aid awarded from your total COA. For example, if your total COA is $30,000 and you already are receiving $10,000 in other forms of aid, you can request up to $20,000 in a private loan. Non-FAFSA filersWe recommend that you complete a FAFSA and apply for financial aid before applying for a private loan, as federal loans are generally more advantageous for student borrowers. However, if you do not plan to complete aFAFSAand wish only to pursue a private loan, you can obtain tuition and fee information in theStudent Accounts Tuition web page. Requesting a loan for a past-due balance Not all lenders will allow you to borrow a loan for a past-due balance. Before you begin the application process, make sure the lender you have selected approves loan applications to cover a past-due balance. If you are obtaining a loan for a past-due balance, you will need to set the loan period to the academic term(s) related to the past-due balance. Determining your loan period When you apply for a private loan, you will be required to enter a loan period, with start and end dates. Your loan period start and end dates are the months associated with academic term(s) for which you are borrowing. Usually you will request a loan for the entire academic year or for a specific term within the academic year. Private loans for summer term must always be applied for separately.Loan periods cannot overlap academic years. If you have questions about term dates, refer to theAcademic Calendar. See thePrivate Loan FAQfor additional loan periods based on enrollment. Your level of enrollment Most lenders require that you are enrolled at least half time in a degree-seeking program in order to obtain a loan. There are some lenders who will provide loans for less than half time. Repayment When you borrow money for your education, you sign a promissory note legally obligating you to repay the loan according to the stated terms and conditions. When the time comes for repayment, usually after your education is complete, meeting your student loan obligation helps you earn a good credit rating, which follows you throughout your life. Lenders may offer different repayment options which may influence the loan’s interest rate. You may not be able to change the repayment option after you apply for the loan. Not repaying your loans may result in the following: If your loan has a cosigner, the lender will seek repayment from them. You may not be able to obtain more credit, i.e., to buy a car or house. You may be turned down for a credit card. Your employer can be ordered to garnish your pay, i.e., withhold what you owe from your paycheck. You will be sued and will owe collection fees and attorney fees, in addition to repaying your loan. Private student loans are almost impossible to discharge in bankruptcy. Remember, you must repay your student loans even if you do not graduate or otherwise complete your education. Failure to find a job after graduation will not relieve you of this responsibility. Interest rates Various interest rates and fees are available from lending institutions. You also should consider what income you can realistically expect in your proposed career. Instead of a flat interest rate that is easy to compare, such as 8 or 10 percent, private loan programs generally have interest rates that are variable. Usually, they are based on either the prime rate or a treasury bill rate, such as the 91-day T-Bill or 13-week T-Bill rate. Some lenders may base their pricing on LIBOR, the London Interbank Offering Rate. LIBOR is an index similar to the U.S.T-Bill and Commercial Paper indexes. Interest rates on private loans are usually based on one of these variable rates plus a set percentage, such as the 91-day T-Bill plus 3.75 percent. As these rates fluctuate with the market, the interest rates on the loans go up or down. Usually lenders adjust interest rates on a quarterly basis, but may adjust them as often as monthly. There also may be different interest rates used when you are in school versus when you are in repayment. Fees There are different kinds of fees that a private loan company may charge. Origination fees may be charged for the creation of the loan. Lenders also may add an additional fee when you enter into repayment. This fee may be assessed on the original principal alone or on the original principal plus the accrued interest. So, when looking at how much a loan program charges in fees, make sure that you add up both the fees charged initially at disbursement and any fees charged at the time you go into repayment. Always be sure to ask your chosen lender about such fees. Choosing a Lender You should carefully review your expenses before deciding whether you need a private loan. Choosing a private loan is a personal decision and DePaul University has partnered withELMSelectto offer a tool to assist students and families. ELMSelect is a tool that allows you to compare lenders that specialize in your area of study, rates, and conditions, and if needed, select a loan product that best fits your needs. The ELM tool includes various filter options to help in your review as well as highlighting the private lenders used by DePaul students in the past five years. New lender loan products may be reviewed annually for student borrower benefits. DePaul does not recommend any particular private lender and does not have a preferred lender list. As you determine if a private loan is for you, use the questions below to compare lender products in ELMSelect: Whom do I contact when I have a question or a problem about my loan? What are the current interest rates? How often do these rates fluctuate? Is there an interest rate cap? Are there any fee reductions, interest reductions or other incentives offered during the life of the loan? Do the loan interest rates (or other incentives) change based on my credit, academic level or whether I have a co-signer? When are late charges assessed? How much are these charges? How is the interest on my loan capitalized — quarterly, annually or only at repayment? What are the repayment terms? Are there any penalties for pre-payments, late payments or any other reason? Are death and disability discharge options available under those circumstances? Loan Application and Approval Once you choose a lender, you’ll need to complete the application process. Most lenders offer online and/or phone applications. In general, the lender will run a credit check before it agrees to offer you a loan. If you fail to pass the credit check, the lender may give you the option to reapply with a creditworthy co-signer. Most lenders also will offer counseling to determine why you failed and provide guidance for correcting your credit. Applying for a loan with a creditworthy co-signer is always a good idea, as lenders may offer incentives such as a lower interest rate or reduced fees. Be sure to inquire about this possibility with your lender. Because credit is the main component in a private loan approval, you may want to obtain a copy of your credit report for yourself. You can obtain that information usingAnnual Credit Reportor by contacting any of the credit bureaus listed: *You may be charged a fee to access your credit report from these credit bureaus Final Steps Fill out the lender’s application. Your lender will review your application and will do a credit check. Complete the promissory note process required by your lender. Provide any additional documentation your lender may require from you and/or your co-signer. You are required to complete and submit a Private Education Loan Application Self-Certification Form to your lender. You can obtain this form from your lender; if you are unable to obtain one from your lender, please notify the Office of Financial Aid. Follow-up with your lender to make sure you (and your co-signer) have submitted all required documentation. Your lender will electronically transmit (or fax) a request for school certification to DePaul once your private loan is approved and all steps have been completed. Our office will verify enrollment, along with the loan period start and end dates, to ensure your requested loan amount is within your financial aid budget. We may be required to adjust accordingly. DePaul will not be able to certify your loan until all the required documentation has been submitted to the lender. Disbursement Most lenders distribute private loan funds electronically. In some instances, however, lenders send funds to DePaul via paper check that you may then need to endorse. We will contact you if you are required to sign the check before the loan can be deposited and disbursed. Lending regulations require a waiting period called the “right to cancel,” so lenders may not disburse the funds to DePaul for up to 10 business days after approving the loan application. In general, the total annual loan amount that you request will be evenly split over the terms of the current academic year. However, if you are applying for a private loan to assist with a one-time educational expense, or a single term, you must indicate to the lender the correct academic terms for which you are applying for the loan. You will need to set the loan period in the loan application to match the academic period for which you want the loan."
}