{
  "url": "https://www.depaul.edu/admission-and-aid/financial-aid/maintain-eligibility/Pages/returning-title-iv.aspx",
  "title": "\r\n\tReturn Title IV Aid  |  Maintain Eligibility  |  Financial Aid  |  Admission & Aid  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Financial Aid Financial Aid Basics Types of Aid Receive Aid Maintain EligibilitySatisfactory Academic Progress (SAP) PolicyReturn Title IV AidWithdrawal from ClassesFinancial Aid Terms & ConditionsLimits & Maximums Satisfactory Academic Progress (SAP) Policy Return Title IV Aid Withdrawal from Classes Financial Aid Terms & Conditions Limits & Maximums Manage Costs Repay Loans Resources for... Forms Contact Us Apply Online Request Info Visit Campus DePaul University>Admission & Aid>Financial Aid>Maintain Eligibility>Return Title IV Aid Return Title IV Aid If you withdraw, either officially or unofficially, from all classes before completing the term and you have received Title IV federal funds, we are required to review your eligibility for those funds. We must determine how much of the federal funding was “earned” up to the time of your withdrawal using a federally mandated formula. We must return to the federal government any Title IV funds disbursed in excess of your “earned” amount. Withdrawing before completing 60% of the term will result in the return of some federal financial aid. This review and recalculation is called a “Return of Title IV Aid” and, if necessary, we will revise your financial aid offers to reflect the result of this review. Determining Aid Earned To determine the amount of aid you earned, the Office of Financial Aid will calculate the percentage of the term that you attended using either: the date you, or an administrator, withdrew from all classes in Campus Connect (official withdrawal) or, the last date of academically-related activity if you stop attending all classes without withdrawing using Campus Connect or notifying the University and resulting in FX grades (unofficial withdrawal). That percentage is then used with your institutional costs and total federal funds that you received (disbursed directly to your student account and possibly refunded to you) or that you were eligible to receive, to determine the amount of aid that you are allowed to keep. We must return any unearned Title IV aid to the federal government within 45 days of the date of the determination of your withdrawal. Returned Title IV Aid Allocation Financial aid funds must be reduced and returned in the following order: Federal Direct Unsubsidized Loan Federal Direct Subsidized Loan Federal Direct PLUS Loans Federal Pell Grant Federal Iraq Afghanistan Service Grant Federal Supplemental Educational Opportunity Grant (SEOG) Federal TEACH Grant Learn more about R2T4"
}