{
  "url": "https://www.depaul.edu/about/Pages/rankings.aspx",
  "title": "\r\n\tRankings  |  About  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "About Rankings Campuses Chicago Events Mission President Administration Distinctions History & Timeline Accreditation & Licensure Apply Online Request Info Visit Campus DePaul University>About>Rankings Rankings Rankings and accolades can’t tell our whole story, but they do point to important aspects of who we are and what makes us unique. Named one of theBest MidwesternColleges in the U.S. The Princeton Review (2025) Ranked one of the Best College Locationsin America Niche (2025) Among the nation’s Top Performers onSocial Mobility U.S. News & World Report (2025) Ranked one of the Best Colleges in the U.S. Wall Street Journal (2025) Named one of the nation’s Best Value Colleges U.S. News & World Report (2025) Diversity Higher Education Excellence in Diversity award INSIGHT into Diversity Magazine (2024) Technology Named a top graphic design school Graphic Design USA (2024) Among the best colleges for Information Technology in America Niche (2025) #5Game Design MFA program in the nation Animation Career Review (2021) #34undergraduate school for Game Design The Princeton Review (2024) #23graduate school for Game Design The Princeton Review (2024) Business #10Best Master’s in Entrepreneurship College Rank (2024) #15MBA Entrepreneurship program in the nation The Princeton Review (2025) #12undergraduate Entrepreneurship program in the nation The Princeton Review (2025) #44part-time MBA program The Princeton Review (2019) #41graduate school for Accounting The Princeton Review (2019) Arts #11film school in the nation The Hollywood Reporter (2024) Among the country’s best colleges for film and photography Niche (2025) #21graduate acting MFA program in the nation The Hollywood Reporter (2019) Communication 33Illinois College Press Association Awards The DePaulia student newspaper (2023) 4Intercollegiate Broadcasting System Awards Radio DePaul (2022) Outstanding Chapter Award Public Relations Student Society of America (2023) Outstanding PR Education Program PRWeek Awards (2022)"
}