{
  "url": "https://www.depaul.edu/distinctions/Pages/beyond-the-bottom-line.aspx",
  "title": "\r\n\t|  Distinctions  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Beyond the Bottom Line DePaul’s new MS in Sustainable Management enable students to acquire a systemic view of the role a business should play in society. “Sustainable management isn’t something ‘nice to do’—it’s something that must be done, and organizations of all kinds and sizes are beginning to acknowledge that,” says Ron Nahser, the director of Urban Sustainable Management Programs. Talking about the rationale behind DePaul’s new MS in Sustainable Management, Scott Kelley, an assistant vice president in the Office of Mission & Values and assistant professor in religious studies, elaborates: “Today’s managers are stepping beyond the scope of traditional business practices—they’re being creative in imagining new strategies for achieving not only financial viability but also social justice and environmental responsibility. The program’s interdisciplinary focus gives students the skills to understand organizational dynamics and to deliver products and services that address society’s bigger needs while still making a profit.” The MS in Sustainable Management includes faculty from the Department of Environmental Science and Studies, the Driehaus College of Business, the School of Public Service, the Department of Religious Studies and the College of Communication. “The program is all about pragmatic inquiry,” says Jim Montgomery, an associate professor in environmental science and co-chair of the DePaul Sustainability Network. “Sustainability means thinking about problems—say, improving supply chain efficiency—in ways that focus on both return on investment and values. It means looking beyond technical answers to include the environmental and social impacts of decisions. For a supply chain redesign, for example, it would mean taking into account the value of a reduced carbon footprint or better community relationships. With sustainable management, business solutions satisfy multiple objectives.” Bridging the Gap The program’s first graduate, Zach Waliullah (MS ’14), has already applied that lesson in his job as a pricing and supply chain analyst with American Hydrotech, a leader in the development, production and distribution of premium waterproofing, roofing and green roofing products: “As an undergrad I studied finance, and then in the MS program I learned to include natural capital and social costs in calculating a product’s value. Because my company was under competitive pressure, I used my graduate research project to imagine ways we could innovate yet still stay true to our core values. My new product proposal, which reflects a sustainable business model, was well received. “When I started the MS program, no other university was offering anything like it. I didn’t want to work in a business whose only goal was making money: I was looking for real value creation. Now, my work, my company and my education are a good fit. I came out of my undergrad with a strong financial skill set; the grad program gave me purpose.” Old and New “People ask, ‘When did DePaul get interested in sustainability?’ I say 1617. That’s when Vincent de Paul began practicing sustainable management in Paris,” says Nahser. “He wasn’t just passionate about human rights; he was also efficient and effective in solving practical problems. In the MS program, we enable students to acquire a systemic view of the role a business should play in society: How does one run an organization to serve the general needs of society? We own this idea because that’s what Vincent did. “In fact, I’d say DePaul is uniquely positioned to participate in the global conversation about sustainability. We’re one of only three universities in the world to be a signatory of both the ‘United Nations Global Compact’ and ‘Principles of Responsible Management Education Secretariats’ which are platforms for organizations to work together to achieve the common objective of building an inclusive global economy.” “People ask, ‘When did DePaul get interested in sustainability?’ I say 1617. That’s when Vincent de Paul began practicing sustainable management in Paris,” Ron Nahser, director of Urban Sustainable Management Programs Kelley agrees: “The idea of sustainability presupposes a certain world view and a commitment to ‘human flourishing’ and that’s why it’s not just a technical challenge. One thing that's unique about our program is that students are required to create original business plans that break out of the old ways of thinking about profit and value.” In fact, because the program is project-focused, each student works throughout 12 courses on a problem or need that they think they can positively impact. “This gets them career-ready,” says Nahser. Steve Lu, while an MBA grad student and early member of the Sustainable Initiatives Task Force (which coordinates DePaul’s efforts in curriculum, operations, research and community engagement), tackled the challenge of urban farming and wrote a business plan that came to life as Garfield Produce Company, an indoor hydroponic farm in Garfield Park. “The new MS puts two skill sets together—business and sciences—so that students are prepared to tackle real-world issues,” he says. “Sustainability is a ‘big picture’ problem: It's not about changing light bulbs or driving electric cars; it’s about our whole economic and social system. That’s why the program is so good and so important: It takes students beyond a conventional, narrow framework.” “Investors and employers appreciate people who can think broadly, critically and creatively, and then communicate clearly,” Nahser concludes. “I like to say, ‘It’s not what you know, but how you think.’ In this program our students learn to ask better questions. That’s how we’re preparing leaders who’ll have a positive impact on the world.” ■ Learn what makes DePaul Distinctive Global Health and Human Rights Find out why researchers are working to eliminate health disparities around the world. Protein Puzzles Discover how studying a protein may lead to curing and preventing Alzheimer’s disease."
}