{
  "url": "https://www.depaul.edu/admission-and-aid/types-of-admission/Pages/non-degree-student.aspx",
  "title": "\r\n\tNon-Degree Student | DePaul University, Chicago\r\n",
  "content": "Types of Admission Freshman Student Transfer Student Adult Undergraduate Student Graduate Student International Student Returning Student Visiting Undergraduate Student Non-Degree Student Apply Online Request Info Visit Campus DePaul University>Admission & Aid>Types of Admission>Non-Degree Student Non-Degree Student Take the course you need Here at DePaul, you are considered a Non-Degree Student if: You are a college graduate interested in taking courses for credit (i.e., for graduate school preparation, career development, ourPost-Baccalaureate Pre-Health program, or personal interest) without the intent of completing a degree. You are a professional seeking an online certificate, endorsement or review course. If you are a current high school student, high school graduate or a current college student interested in taking undergraduate courses for credit that will transfer back to another institution, you are classified at DePaul as a Visiting Student.Learn more. Application Process College graduate interested in taking undergraduate coursework If you have already earned a bachelor's degree and want to take additional undergraduate courses as a non-degree student, please submit the following: Online application for non-degree students An unofficial transcript from the institution where you earned your bachelor's degree Students applying to thePost-Baccalaureate Pre-Health Programmust submit official transcripts from all colleges/universities attended Non-degree students are asked to apply to a specific college at DePaul based on the courses in which you intend to enroll (e.g., College of Science and Health for students intending to take a math course). All students who have completed secondary education outside the U.S. must submit proof of English proficiency. A minimum TOEFL score of 550 (or 213 on the computer-based test) or proof of having completed English Composition I and II with grades of C or better is required for all undergraduate applicants. Send all transcripts to:Office of Undergraduate Admission1 E. Jackson Blvd.Chicago, IL 60604 You can also arrange to have official electronic transcripts and test scores sent toelectronictranscripts@depaul.edu. If you are submitting transcripts via SCRIP-SAFE, please be sure to connect with the DePaul University Undergraduate Admissions account. Certificate Programs Continuing Education Programs Certificate Program in Geographic Information Systems Students applying to this program are required to submit an official transcript confirming a bachelor's degree has been earned. Students must complete the undergraduate non-degree application for the College of Liberal Arts and Social Sciences and select \"Certificate – Cartography & Geographic IS\" as the intended major. Transcripts must indicate that the student is in good academic standing. The pre-requisite LSP120 will be automatically waived if the student has a completed a bachelor's degree program recognized by DePaul. For more information, please visit theCertificate in GIS pageof the College of Liberal Arts and Social Sciences website. Certificates in Modern Languages The department offers certificates in American Sign Language, Arabic, Chinese, French, German, Italian, Japanese, Russian and Spanish. Students must complete the undergraduate non-degree application for the College of Liberal Arts and Social Sciences. For more information, please visit theModern Languages certificate page."
}