{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/early-childhood-education.aspx",
  "title": "\r\n\tEarly Childhood Education | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Early Childhood Education Early Childhood Education Engage and inspire young learners DePaul’s Early Childhood Education program will prepare you to teach and engage infants through second-graders in a variety of urban and suburban education settings. Early childhood educators teach in public and private preschools, elementary schools and child care centers. As part of your Early Childhood Education degree program, you will learn educational theories and effective teaching practices and conduct research projects. You’ll be immersed in the real world through field experiences—which require you to observe and participate in teaching activities at multiple elementary schools and child care centers—and student teaching in classrooms around Chicago. Classes Coursework Art Child and Family Child Growth and Development Child Health, Safety and Nutrition Children's Literature Curriculum Development Exceptional Child Development and Instruction Math and Science Instruction in Early Childhood Reading Instruction Speech and Language Development Teaching Strategies Resources Major Requirements Schedule of Classes Department Website Minor offered Combined bachelor's + master's degree offered Career Options Common Career Areas Teaching Administration Education policy 92% of Early Childhood Education graduates were employed, continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program."
}