{
  "url": "https://www.depaul.edu/admission-and-aid/financial-aid/maintain-eligibility/Pages/withdrawal.aspx",
  "title": "\r\n\tWithdrawal from Classes  |  Maintain Eligibility  |  Financial Aid  |  Admission & Aid  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Financial Aid Financial Aid Basics Types of Aid Receive Aid Maintain EligibilitySatisfactory Academic Progress (SAP) PolicyReturn Title IV AidWithdrawal from ClassesFinancial Aid Terms & ConditionsLimits & Maximums Satisfactory Academic Progress (SAP) Policy Return Title IV Aid Withdrawal from Classes Financial Aid Terms & Conditions Limits & Maximums Manage Costs Repay Loans Resources for... Forms Contact Us Apply Online Request Info Visit Campus DePaul University>Admission & Aid>Financial Aid>Maintain Eligibility>Withdrawal from Classes Withdrawal from Classes ​Withdrawing from classesmay have serious consequences for your current financial aid awards as well as your future financial aid eligibility. Withdrawal also may have far-reaching effects in other areas of student life. If you are considering withdrawing from your courses, or leaving the university, review ourWithdrawal Checklistto understand the possible consequences of withdrawal. Consider the cost of withdrawal The total cost of your educational program will escalate as a result of lost time, unearned coursework, delayed graduation and increased educational debt if you are borrowing to attend school. If you need to withdraw, work with your financial aid and academic counselors to find strategies to minimize this cost. Listed below are some possible effects of withdrawal. If you are... Receiving federal, state or institutional financial aid (including scholarships) Federal financial aid:Withdrawal from all classes can affect your current-term federal student aid eligibility and result in a balance owed to DePaul. Go to the federalReturn of Title IV Aidpolicy to see how we may recalculate and return your loans and grants based upon your last date of attendance. Institutional aid (including scholarships):Withdrawal from some or all classes can affect your current-term and/or future eligibility for any institutional scholarship and grant funds. Many DePaul University merit scholarships require continuous full-time enrollment and a minimum grade point average for renewal. Your overall financial aid eligibilityRepeated withdrawals from some or all classes could compromise your future eligibility for financial aid because oflifetime eligibility limitsor you may not be meeting the financial aidsatisfactory academic progress (SAP) policy. Your loan deferments:If you have student loans, they will enter repayment in six months if you do not re-enroll at least half-time. Living on campus Residents living on-campus must be enrolled in school. If you plan on withdrawing, contactDePaul Housingfor more information. Receiving insurance or benefits Withdrawal may affect your insurance or benefits. Many insurance policies (health, auto, etc.) or benefit policies require active enrollment. Check your policy before deciding to withdraw. Required Exit Counseling If you borrowed a Federal Direct Loan, Federal Perkins Loan, or received the Federal TEACH Grant and you withdraw from the university (even if your withdrawal is temporary), you will need to completeexit counseling. Completing exit counseling will not have any negative impact on your account or prevent you from receiving financial aid in the future."
}