{
  "url": "https://www.depaul.edu/admission-and-aid/financial-aid/manage-costs/Pages/maximize-aid.aspx",
  "title": "\r\n\tMaximize Aid  |  Manage Costs  |  Financial Aid  |  Admission & Aid  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Financial Aid Financial Aid Basics Types of Aid Receive Aid Maintain Eligibility Manage CostsPayment PlansNet Price Calculator Payment Plans Net Price Calculator Repay Loans Resources for... Forms Contact Us Apply Online Request Info Visit Campus DePaul University>Admission & Aid>Financial Aid>Manage Costs>Maximize Aid Maximize Aid By maintaining steady progress toward your degree, avoiding costly withdrawals and wisely using DePaul'stuition package plan, you can help control your educational costs and reduce your potential student loan borrowing. Consider the following: Use the savings in your tuition plan:It's important to understand your tuition plan. Most full-time undergraduate students in DePaul's traditional colleges are billed based on a tuition-package plan. This means you will be charged the same price whether you enroll in 12, 15 or 18 credit hours. Using your tuition plan wisely can save money and accelerate your time to degree. Part-time undergraduate students are charged by the credit hour. Graduate and professional students are charged according to their program and enrollment status. You can find out more abouttuition ratesat the Student Accounts website. Use your academic planning tools:Once you understand your tuition plan, you will want to take advantage of it by planning wisely. Take the time to meet with your academic advisor early and often to make sure you understand your program requirements. Get familiar with your degree progress report and use it to make good enrollment decisions. Plan your enrollment carefully:Most financial aid eligibility is based on projected full-time enrollment. If you receive grants, it is likely that your grant eligibility is calculated at full-time enrollment and that you will receive a reduced amount if you enroll less than full time. Some state grant programs reduce if you enroll for fewer than 15 hours. If you participate in the loan programs, try not to use more loan than you absolutely need. Avoid costly withdrawals:Withdrawing from courses prolongs your education and dramatically increases the cost of your education because of lost tuition dollars and delayed graduation. Don't withdraw or drop courses if you can possibly avoid it. Consider the lifetime financial aid maximums:All financial aid programs have lifetime maximums. You can learn more about the maximums by visitingLifetime Limits and Aggregate Maximums for Financial Aid Programs."
}