{
  "url": "https://www.depaul.edu/admission-and-aid/types-of-admission/freshman-student/Pages/default.aspx",
  "title": "\r\n\tApply for Freshman Admission | DePaul University | DePaul University, Chicago\r\n",
  "content": "Types of Admission Freshman StudentDeBlogsFor School Counselors DeBlogs For School Counselors Transfer Student Adult Undergraduate Student Graduate Student International Student Returning Student Visiting Undergraduate Student Non-Degree Student Apply Online Request Info Visit Campus DePaul University>Admission & Aid>Types of Admission>Freshman Student Freshman Student Admission Process Welcome to your 234 sq. mile classroom Application Steps Apply by November 15 for the Early Action Program or by February 1 for Regular Notification usingtheCommon Application. Applications will be considered on a space-available basis after February 1. Early Action applicants will receive a decision by December 15. Regular notification applicants will receive a decision by March 15. Music and Theatre applicants will receive a decision by April 1. All applicants are required to submit official high school transcripts.Send your official high school transcripts to:Office of Undergraduate Admission1 E. Jackson Blvd.Chicago, IL 60604Email your transcripts or test scores toelectronictranscripts@depaul.edu. The following curricular requirements arestrongly recommended:Four years of EnglishThree years of mathematics (minimum course work equivalent to Algebra I, Geometry, Algebra II)Three years of science (two of which must be lab science)Two years of social scienceTwo years of language study other than EnglishApplicants must have earned a high school diploma or its equivalent at the time of enrollment. Four years of English Three years of mathematics (minimum course work equivalent to Algebra I, Geometry, Algebra II) Three years of science (two of which must be lab science) Two years of social science Two years of language study other than English We have been atest-optional universitysince 2012.Decide whether you would like to have your ACT or SAT test scores submitted as part of your application. We have a long history of evaluating test-optional candidates for both admission and academic scholarships. If you would like to discuss further the test-optional application option, please contact youradmission counselor.If you choose to submit your test scores, we will accept self-reported test scores from freshman applicants. Freshman applicants can list test scores on their Common Application, and these will fulfill the test requirement for those students submitting test scores. Students also will have the option to add self-reported test scores through theirBlue Demon Domainportal throughout the application process. Invite your high school counselor to submit the Common Application School Report. If you wish to submit additional letters of recommendation with your application, you can invite other recommenders through the Common Application as well. We recommend submitting no more than three additional letters of recommendation along with your application. If you have earned college credit while in high school,request the college, International Baccalaureate or Advanced Placement service which granted you credit to forward your official record to DePaul. Learn more abouthow DePaul awards college creditfor IB and AP exams. Deadlines Updating Your Application Go to yourBlue Demon Domainaccount and log in. (If you have multiple applications on file, please select the one you want to check and then click the “Open Application” button.) Review your checklist; any items listed as “Awaiting” still require action on your part. If you need to make an update to your term of entry, major, or other important details from your application, click on the “Update Application” button under “Account Tools.” For any issues accessing your Blue Demon Domain account, please contact the Office of Undergraduate Admission at (312) 362-8300 oradmission@depaul.edu. Early Action Program DePaul’s Early Action Program (EAP) requires that you apply by November 15. You will be notified by December 15 of the year you expect to enroll at DePaul. If you are admitted under EAP, you will receive strongest consideration for academic scholarships and priority consideration for advising and registration.Learn more about the Early Action Program. Advanced Course Work Credit If you’ve taken advanced course work in high school (Advanced Placement, International Baccalaureate, College Level Examination Program or specific advanced credit equivalencies), we offer credit for demonstrated prior learning at the college level. For detailed information, visit ourTest Credit and Placement site. Additionally, we offer credit to satisfy undergraduate general education, major field and elective requirements for dual (high school–college) enrollment programs. For these dual enrollment programs, credit is evaluated by the Office of Admission. Send an official transcript from the institution awarding credit. Music and Theatre School Applicants DePaul’s School of Music and The Theatre School require additional application steps, including auditions, interviews and application fees. Visit theSchool of Musicfor detailed application processes and requirements. VisitThe Theatre Schoolfor detailed application processes and requirements for your intended major. Using the link above, select your intended major and “How to Apply” at the bottom of the page for more information. Music and Theatre School applicants are not eligible to participate in the Early Action Program and will be given strongest consideration for academic scholarships if they meet their respective application deadlines. Animation and Film & Television Applicants New, first-time students applying to enter the Animation (BA or BFA) and Film & Television (BA or BFA) degree programs are required to submit additional materials to be considered for admission.Learn more about what to include and how to submit these materials. Home School Applicants Students who have been home schooled through high school will need to submit the following materials with the application for admission consideration: An official transcript showing courses taken and credit earned Official community college transcripts for any courses taken Optional materials that we recommend submitting include textbooks used, specifically for math and science. International Applicants Visit ourOffice of International Admissionfor detailed application and admission requirements. Contact Information Lincoln Park CampusOffice of Admission2400 N. Sheffield Ave.Chicago, IL 60614 Loop CampusDePaul Center1 E. Jackson Blvd.Chicago, IL 60604 Phone(312) 362-8300or toll-free(800) 4DePAULoutside Illinois Emailadmission@depaul.edu DePaul University’s Safety & Security Information Report and Fire Safety Report is available upon request and atgo.depaul.edu/CleryASR. The report includes statistics about crimes that occurred on campus and public property immediately adjacent to campus, institutional policies concerning campus security, sexual assault and other matters. It also includes fire statistics, fire safety practices and standards of the institution. For a paper copy of the report, contact DePaul’s Clery Compliance Coordinator at (773) 325-8483."
}