{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/religious-studies.aspx",
  "title": "\r\n\tReligious Studies | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Religious Studies Religious Studies Understanding the impact of religion Understand how religion impacts our political and social systems while exploring and analyzing religious dimensions of life and culture. Develop critical thinking and writing skills with a religious studies degree and learn how religion impacts culture, politics, identity and conflict around the world. You will study traditional areas of sacred texts, myths, rituals, mystical experiences and doctrines, but also the ways in which political, social and economic forces shape these phenomena for religious communities. In addition to a variety of combined degree programs, we offer the 3+3 BA/JD, which allows high-achieving first-year undergraduate students to be admitted simultaneously to the College of Liberal Arts and Social Sciences (LAS) and the College of Law (LAW). You’ll complete your first three years in LAS and your final three years in LAW. Classes Coursework Methods and Approaches in the Study of Religion The American Religious Experience Themes in Catholic Social Thought Interpreting Sacred Texts Religion and Popular Culture Religion and Political Conflict Sustainability and Religious World views Religion and Social Engagement Resources Major Requirements Schedule of Classes College Website Minor offered Combined bachelor’s + master’s degree offered Career Options Common Career Areas Public policy International relations Education Immigration work Social services Law Human rights Conflict resolution and strategy 93% of Religious Studies graduates were employed, continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program."
}