{
  "url": "https://www.depaul.edu/admission-and-aid/types-of-admission/transfer-student/transferring-your-courses/Pages/course-lists.aspx",
  "title": "\r\n\tCourse Lists | DePaul University, Chicago\r\n",
  "content": "Transfer Student Prepare to Transfer Transferring Your CoursesTransfer GuidesCourse ListsTransferologyRecommended CoursesRecent Transfer Guides Course Lists Transferology Recommended Courses Recent Meet Your Transfer Counselor DePaul Admission Partnership Program University Center Partnerships For Advisors Apply Online Request Info Visit Campus DePaul University>Admission & Aid>Types of Admission>Transfer Student>Transferring Your Courses>Course Lists Course Lists ​This tool is for students attending a college or university anywhere in the world or those with military credits. (You can filter courses for School of Continuing and Professional Studiesrequirements as well.) How does the tool work? Course Lists will help you determine whether specific courses at your college or university will transfer to DePaul and if they will fulfill Liberal Studies or General Education requirements. Search pre-approved courses by selecting information about your college or university/course of interest: Select the country it's located in. Select the state it's located in. Pick the name of your college or university. Pick the subject area of the course(s) you're interested in (or select the General Education subject, School for New Learning or Military Science designation). A table will be generated immediately. How to Read Your Course List Your table will include nine columns: Trns Subj– Subject of the course you're transferring Trns Num– Course number of that class Transfer Course Title Trns Units– Credit given for that course Term– Term type for your course: semesters, trimesters or quarters DPU Subj– Equivalent DePaul subject area DPU Num– Equivalent DePaul course number DePaul Course Title Gen Educ– General Education/Liberal Studies requirement the course meets Column(s): One–five:Information about the course being transferred Six–eight: Information about the equivalent course at DePaul Nine:Requirement your course fulfills at DePaul Note: If you do not see your institution or the course you want to transfer, visit theTransfer Articulation Center FAQ page​."
}