{
  "url": "https://www.depaul.edu/admission-and-aid/types-of-admission/transfer-student/university-center-partnerships/university-center-of-lake-county/Pages/cohort-program.aspx",
  "title": "\r\n\tThe DePaul Cohort Program  |  University Center of Lake County  |  University Center Partnerships  |  Transfer Student  |  Types of Admission  |  Admission & Aid  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Transfer Student Prepare to Transfer Transferring Your Courses Meet Your Transfer Counselor DePaul Admission Partnership Program University Center PartnershipsUniversity Center at Harper CollegeUniversity Center of Lake County University Center at Harper College University Center of Lake County For Advisors Apply Online Request Info Visit Campus DePaul University>Admission & Aid>Types of Admission>Transfer Student>University Center Partnerships>University Center of Lake County>The DePaul Cohort Program The DePaul Cohort Program You’ll join a cohort for this program, which means you’ll be part of a collaborative learning group or a “team of academic colleagues.” You’ll learn, solve problems and build relationships together. Cohort Program Benefits Benefits of our cohort program include: Starting and finishing the degree program together.You’ll develop a solid network over an extended time where you’ll also have the consistent support of your colleagues. Establishing life-long relationships.You’ll establish a vital professional network that you’ll carry throughout your career. Sharing similar goals.Specific roles, talents or interests of the cohort members often vary, which gives each cohort its own profile and personality. Scheduling your courses for the entire degree program.You’ll be able to easily plan your commitments and manage your schedule. Being taught by DePaul faculty.Our faculty members have extensive experience teaching working with adults like you. And they recognize that as a working professional, you need to balance the demands of home, work and school. Making your DePaul degree more affordable.You will complete half of the degree at CLC’s tuition rate and the other half from DePaul with special University Center pricing, resulting in a more affordable bachelor’s degree from a private university. Belonging to the DePaul network of more than 210,000 alumni. Learn More Want to learn more about DePaul programs offered at the University Center of Lake County? Request more information."
}