{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/information-technology.aspx",
  "title": "\r\n\tInformation Technology | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Information Technology Information Technology Create tomorrow’s technological solutions DePaul’s Information Technology degree program emphasizes the technical aspects of IT while also providing you with a foundation in business and technical communication. You will gain expertise in computer security, database construction, programming, problem-solving and project management. The Jarvis College of Computing and Digital Media (CDM) is located on the Loop Campus, in the heart of Chicago’s technology and business districts, providing you many opportunities to intern and work in IT with leading companies and organizations. Many CDM faculty members are working professionals and active consultants, allowing you to learn firsthand from innovators in the information technology field. For international students: this program is a STEM-designated program, which can qualify you to extend your post-graduation stay in the United States. Online Degree Options Get prepared to excel in the dynamic field of IT with a Bachelor of Science (BS) degree in information technology from DePaul’s Jarvis College of Computing and Digital Media. Here, you’ll be prepared with the right mix of theory and practical knowledge across a wide range of relevant topic areas. You can complete the last two years of this program entirely online, either in real time or on your time. And with our generous credit transfer policy, it may be possible to reduce the time and tuition costs required to earn your degree. Classes Coursework Accounting Database Programming Information Assurance Marketing Networks and Security Programming Project Management Technical Writing Web Development Resources Major Requirements Schedule of Classes Department Website Concentrations/Tracks Standard Web Development Minor offered Combined bachelor's + master's degree offered Career Options Common Career Areas Consulting Database administration Database programming Network security Programming Project management Software development Web development 91% of Information Technology graduates were employed, continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program."
}