{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/nonprofit-management.aspx",
  "title": "\r\n\tNonprofit Management (BA) For Adult Students | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Nonprofit Management (BA) For Adult Students Nonprofit Management (BA) For Adult Students Develop key leadership and management skills in the nonprofit sector DePaul’s Bachelor of Arts in nonprofit management is designed for adult students who are looking to advance to leadership or management positions in the nonprofit sector of the workforce. With this nonprofit management degree, you will develop knowledge and skills in a wide range of areas critical to nonprofit organization, including project management, program development and evaluation, fundraising, human resources, risk management, workplace law, ethical conduct, finance and professional communications. In our nonprofit management degree program, you will have the opportunity to earn credit for college-level learning achieved from prior work and life experience. And you’ll integrate the critical thinking skills you learn through your liberal arts coursework from a nonprofit management perspective. Most courses are offered online; others are offered on weekday evenings at the Loop Campus to accommodate a working professional’s busy schedule. Classes Coursework Advocacy and Lobbying Data Analytics Fundamentals of Human Resource Management Fundraising for Nonprofit Organizations Introduction to Nonprofit Organizations Program Development and Evaluation for Nonprofit Organizations Quantitative Reasoning Research Methods Social Justice in the Workplace Strategic Management and Planning Resources Major Requirements Schedule of Classes College Website Combined bachelor's + master's degree offered Career Options Common Career Areas Community organizer Community outreach coordinator Community relations director Fundraising manager Grant administrator Nongovernmental organizations policy analyst Nonprofit business office manager Nonprofit agency program director Volunteer services manager Get more information Complete the form below to receive more information about this degree program."
}