{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/psychology.aspx",
  "title": "\r\n\tPsychology | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Psychology Psychology Gain insight into psychological theories and methods In the Bachelor of Arts (BA) and the Bachelor of Science (BS) in Psychology programs, you’ll learn psychological theories and research methodologies, as well as gain an understanding of both scientific and applied psychology. As you work towards your bachelor’s degree in Psychology, you’ll design and conduct psychological research studies and learn how to read and analyze scientific data. Your coursework will focus on theories, experimental and statistical work, and laboratory and fieldwork, allowing you to gain hands-on research experience. You’ll have the opportunity to work with faculty members on research projects, as well as develop and conduct your own research projects through our independent study program. Psychology (BS) program You’ll choose from one of three concentrations: a General concentration, a Cognitive Neuroscience concentration, and a Healthcare concentration. These concentrations require you to take advanced courses through the Biology, Chemistry, and/or Mathematics departments. Students in the Cognitive Neuroscience program may declare a minor in Biology. Psychology students may meet pre-health requirements while earning their degree. To ensure success, students in the Healthcare concentration are part of DePaul’s Pre-Health/Pre-Med Advising program. DePaul offers combined degree programs such as a combined bachelor’s + master’s degree in Psychology and Secondary Education Social Sciences, allowing you to complete a bachelor’s degree and a graduate degree in as few as five years. Psychology (BA) program Bachelor of Arts students will choose from one of six concentrations: Community, Comprehensive Evening Program, Human Development, Human Services, Industrial/Organizational, or Standard. The Psychology Department also offers two internship programs that place you in human service organizations, community and industrial settings. DePaul offers a combined bachelor’s + master’s degree program in Industrial-Organizational Psychology and a combined bachelor’s + master’s degree program in Psychology and Secondary Education Social Sciences. These programs allow you to complete a bachelor’s degree in Psychology and a graduate degree in as few as five years. Online Degree Options An online Bachelor of Arts (BA) degree in psychology from DePaul’s College of Science and Health (CSH) will provide the knowledge, critical thinking abilities and communication skills you need for a successful career in psychology. Choose from two concentrations: Standard, which prepares you for graduate school, or Human Development, which focuses on child/adolescent behavior and allows you to customize your major. The psychology program provides convenience and flexibility. Our online courses are taught by the same expert faculty who teach in our classrooms. And DePaul’s generous credit transfer policy makes it possible to reduce the time and tuition costs required to earn your degree. Classes Coursework Abnormal Psychology Alcoholism, Drug Addiction and Recovery Child Psychology Community Psychology Human Development Organizational Behavior Physiological Psychology Psychology of Interpersonal Relationships Social Psychology Theories of Personality Training and Development in Organizations Resources BA Major Requirements BS Major Requirements Schedule of Classes Department Website Concentrations/Tracks Standard Concentration Community Comprehensive Evening Program Human Development Human Services Industrial-Organizational Minor offered Combined bachelor’s + master’s degree offered Career Options Common Career Areas Community relations Counseling Human resources Management Nonprofit work Prevention and intervention work Research Social work 94% of Psychology graduates were employed, continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program."
}