{
  "url": "https://www.depaul.edu/admission-and-aid/types-of-admission/transfer-student/Pages/trac.aspx",
  "title": "\r\n\tTransfer Articulation Center FAQ  |  Transfer Student  |  Types of Admission  |  Admission & Aid  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Transfer Student Prepare to Transfer Transferring Your Courses Meet Your Transfer Counselor DePaul Admission Partnership Program University Center Partnerships For Advisors Apply Online Request Info Visit Campus DePaul University>Admission & Aid>Types of Admission>Transfer Student>Transfer Articulation Center Transfer Articulation Center FAQ DePaul’s Transfer Articulation Center (TrAC) reviews your files, undergraduate coursework and determines its transferability to DePaul — posting credits to your record. If your courses are not appearing in theCourse Lists tool, you may submit a request for course review. Understanding Your Posted Credits I’ve been accepted. When will I see my credits posted to my record? What do “TRNS, 4RVW, No Rule and Rejected” mean? TRNS:You will receive credit for your course, but it won’t apply specifically toward any school or college at DePaul. 4RVW:A faculty is evaluating whether this course is equal to one at DePaul. You will receive transfer credit for all courses that are listed as 4RVW regardless of whether the course meets a specific DePaul equivalency. You may need to provide a syllabus in order for a decision to be made. View the specific4RVW documentation requirements here. No Rule:No action has been made, and additional information may be necessary. If you see \"No Rule\" in the early stages of your admittance into DePaul, chances are that the course has yet to be reviewed. If you see that a course is \"No Rule\" after a majority of your courses have been posted and you are currently attending classes at DePaul, chances are there is information missing that you need to provide. Review your Transfer Credit Report in Campus Connect for additional information on what may be required by you in order to make an articulation decision. Rejected:TrAC has determined that the course is either not comparable to the academic objectives of DePaul University or is not a course we accept in accordance with the DePaul University transfer policies. No credit will be awarded. Some of my course equivalencies don’t look like normal classes. What does it mean if it says something like ART TR200? Why didn’t I earn liberal studies credit for my course? TrAC looks at several factors when determining whether a course will count as a Liberal Studies course. The most important factor is how closely the course meets the goals and objectives of DePaul’s Liberal Studies program and, specifically, the goals and objectives of the Common Core or Learning Domain requirements.At DePaul, Liberal Studies courses and Learning Domains are the same as “general education” courses. Transfer Course Lists My institution is not listed in the Transfer Course Lists. Does that mean none of my courses will transfer to DePaul? My institution is listed in the Transfer Course Lists, but my course is not. Does that mean the course will not transfer to DePaul? Repeating Courses If I repeat a course at DePaul that I took at another institution and earn a worse grade, can I keep the higher grade? If I petition for the re-review of a course I completed at a different institution and it comes back as equivalent to a DePaul course I already completed, can I earn credit and be refunded my money for the DePaul course or earn credit for both courses? Placement Tests Am I exempt from taking placement tests? Review theTest Exemption Gridto see whether you’ve satisfied all of the requirements that will exempt you from taking a placement test. Transfer Credit for Current Students Completethis formif you are a current student and plan to take courses at another institution (e.g., summer courses at a community college or a non-DePaul study abroad program). If you are studying abroad on a non-DePaul program, upload the completed form to your Transfer Credit Application toStudy Abroad. More Questions? *Note:If you have questions about the transferability of graduate level coursework toward a graduate degree program, please contact the individual graduate program you’re looking to transfer to for more information. TrAC only determines the articulation of external undergraduate coursework."
}