{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/nursing.aspx",
  "title": "\r\n\tNursing | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Nursing Nursing Nurture a career of compassion and care DePaul’s Bachelor of Science in Nursing (BSN) program provides the solid foundation for your successful career in this high-demand profession. Here, you’ll find the ideal combination of academic reputation, supportive learning atmosphere and health care community connections. You can enter our BSN program directly from high school, while current DePaul undergraduates and transfer students may consider ourMaster’s Entry to Nursing Practice program. As you pursue your B.S. degree in Nursing, you’ll learn from passionate, experienced nursing faculty members who will give you the same one-on-one, individualized attention that you’ll give your patients. In small classes led by nursing faculty members—active clinicians, researchers and leaders who are accomplished in the profession—you’ll receive the instruction, feedback and mentoring needed to help you achieve your goals. Throughout the BSN program, you’ll learn to: Apply leadership skills, healthcare informatics technologies and interdisciplinary collaboration within complex healthcare systems Demonstrate professional nursing practice standards based on legal and ethical principles Integrate what you learn in your liberal arts courses with nursing concepts that provide contextually relevant and culturally appropriate care to your patients Our B.S. degree in Nursing program equips you with the knowledge you need to succeed in the always-evolving nursing field. Here, you’ll get hands-on experience using the latest physical assessment tools and technology, including simulation labs that feature high-fidelity computerized adult, child and baby mannequins, and exam rooms. As a graduate of the BSN program you’ll be eligible to take the NCLEX examination, which qualifies you to become a registered nurse in any state in the U.S. DePaul’s School of Nursing has a long history of successfully preparing students to pass the nursing licensure exam–with a NCLEX pass rate of 97% last year–helping ensure that you’ll be ready to work in a wide array of nursing practices. Classes Coursework Community and Population Health Contemporary Healthcare Issues General Biology for Science Majors General, Organic and Biological Chemistry Human Anatomy and Physiology Leadership and Management for Safe Nursing Care Nursing Informatics and Technology Nursing Research Nursing Theory for Professional Nursing Practice Resources Major Requirements Schedule of Classes Department Website Career Options Common Career Areas Case management nurse Clinical nurse specialist Conservation biology Clinical research nurse Nursing director Nurse educator Nurse manager Public health nurse Registered nurse 90% of College of Science and Health graduates were employed, continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program."
}