{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/film-television.aspx",
  "title": "\r\n\tFilm and Television | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Film and Television Film and Television Tell impactful stories as a filmmaker As a DePaul Film and Television major, you’ll choose between two degrees: a Bachelor of Arts (BA) degree or a Bachelor of Fine Arts (BFA) in Film and Television. Our BA in Film and Television program will provide you with a generalist approach to filmmaking and tv production by teaching you how to use the latest digital technology and examining classic cinema narrative theory and aesthetics. Our BFA in Film and Television program emphasizes the technical aspects of media production and explores the relationship between cinema production technologies and creative artistic expression. You’ll choose one of 11 filmmaking concentrations. Film and Television major students will gain practical production experience through classes, internships and DePaul’s Project Bluelight program, where you’ll work alongside other students and faculty members on a full-length feature film or independent short productions. You’ll take classes at Cinespace Chicago Film Studios, where you’ll learn your craft on a DePaul dedicated soundproof soundstage. You’ll work in the same space as professional directors, lighting technicians, filmmakers, set designers and actors. Take advantage of the DePaul LA Quarter, a ten-week immersion program that enables Film and Television majors to experience the inner workings of Hollywood firsthand. You’ll live in Los Angeles, take classes on a historic studio lot, and intern at high-profile companies. Classes Coursework Advanced Documentary Concepts and Screenwriting Techniques Cinema and Television History, Theory and Production Cinematography Editing Interactive Audio and Video Rendering for Designers Studio and Field Production for Video and Television Technical Drawing Resources BA Major Requirements BFA Major Requirements Schedule of Classes Department Website Concentrations/Tracks Cinematography Comedy Filmmaking Creative Producing Directing Documentary Editing Production Design Screenwriting Showrunner Sound Design Visual Effects Combined bachelor’s + master’s degree offered Career Options Common Career Areas Cinematography Editing Film/television directing Film/television production Filmmaking Post-production management Screenwriting Visual effects Sound design 88% of Film and Television graduates were employed, continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program."
}