{
  "url": "https://www.depaul.edu/admission-and-aid/financial-aid/basics/Pages/apply-for-aid.aspx",
  "title": "\r\n\tApply for Aid  |  Financial Aid Basics  |  Financial Aid  |  Admission & Aid  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Financial Aid Financial Aid BasicsQualify for AidApply for AidCost of AttendanceImportant DatesNotificationsPrivacy & FERPAExternal Resources Qualify for Aid Apply for Aid Cost of Attendance Important Dates Notifications Privacy & FERPA External Resources Types of Aid Receive Aid Maintain Eligibility Manage Costs Repay Loans Resources for... Forms Contact Us Apply Online Request Info Visit Campus DePaul University>Admission & Aid>Financial Aid>Financial Aid Basics>Apply for Aid Apply for Aid ​2025-2026 FAFSA Application – Now Available We strongly encourage you to complete yourFree Application for Federal Student Aid (FAFSA) for the 2025-2026academic year as soon as possible. Completing the FAFSA is crucial for accessing federal and state financial aid, as well as institutional aid, scholarships, and grants. Submitting the FAFSA early increases your chances of receiving the maximum amount of aid you're eligible for, as some funds are awarded on a first-come, first-served basis. Plus, getting this crucial step out of the way now can help reduce stress as you focus on your studies. View somevideoscreated by the Department of Education to help you through the FAFSA process. Also, make sure to check your BlueM@il for important emails from our office regarding the changes to the FAFSA and the new timeline. Steps to Apply Create or Update Your FSA ID:Your FSA ID acts as your legal signature. If you don’t have one,create a FSA ID. If you do, make sure your information is up-to-date.When you create your account, be careful to enter your name and Social Security number (SSN) exactly as they appear on your Social Security card. For information about the FSA ID process, view theFSA ID video.Everycontributorto the FAFSA form (student, the student's spouse, a biological or adopted parent, or the parent's spouse) will need their own FSA ID to access and complete their section of the online form. Create or Update Your FSA ID:Your FSA ID acts as your legal signature. If you don’t have one,create a FSA ID. If you do, make sure your information is up-to-date. When you create your account, be careful to enter your name and Social Security number (SSN) exactly as they appear on your Social Security card. For information about the FSA ID process, view theFSA ID video. Everycontributorto the FAFSA form (student, the student's spouse, a biological or adopted parent, or the parent's spouse) will need their own FSA ID to access and complete their section of the online form. Gather Your Documents for yourself and your contributors:This may include social security number, federal income tax returns, W-2s, and other records of money earned, asset information, child support received, business or farm information. Gather Your Documents for yourself and your contributors:This may include social security number, federal income tax returns, W-2s, and other records of money earned, asset information, child support received, business or farm information. Complete the FAFSA Form:Visitfafsa.govto submit your application. Complete the FAFSA Form:Visitfafsa.govto submit your application. Make Sure Your FAFSA Form Was Processed You can track the status of your form atstudentaid.govin the Status Center under “My Activity” section of your account dashboard (you must log in). You will get your FAFSA Submission Summary after your FAFSA form is processed. Look over your FAFSA Submission Summary to make sure you didn’t make a mistake on your FAFSA form. View ourvideofor more information. Instructional Videos for Completing the FAFSA We've compiled a selection of videos to assist you with completing the FAFSA. Please take advantage of these resources to help you accurately complete your FAFSA and secure your financial aid. Careful attention to detail can save time and prevent unnecessary errors in your application process. Understanding the FAFSA:This video provides an overview of the FAFSA process and the types of financial aid available. \"6 Things Students Need Before They Fill Out the FAFSA Form\":Read the Federal Student Aid article to learn what to gather to access and complete the FAFSA form. Filling Out the FAFSA:Filling Out the FAFSA: Follow these step-by-step instructions to fill out your FAFSA correctly and efficiently. FAFSA Tips and Common Mistakes to Avoid:Ensure a smooth FAFSA application process by reviewing tips and common mistakes before you submit. Pro Tips for the FAFSA Form:Visit The Federal Student Aid webpage for key information that will help you fill out the FAFSA forms and avoid issues. FAFSA Help Center:Use the webpage to find frequently asked questions, help articles, videos, infographics, webinars, and more. FAFSA deadlines:For states, schools, and the federal government. “What Happens After Submitting Your FAFSA Form?”:Watch the Federal Student Aid video for information on next steps and communications you should look for while Federal Student Aid processes your FAFSA form. Requesting Summer Aid If you decide to enroll in summer courses, we need you to do a few things first. Students seeking summer financial aid will need to complete an online summer application, which is available each April, in Campus Connect. If you’re new to DePaul, you’ll need to add our school code (001671) to your FAFSA. If you have additional questions about financial aid for the summer terms, view ourSummer Financial Aid FAQ. Application Review Process Once your application is complete, our office reviews the information provided on your FAFSA. We use your Student Aid Index (SAI) from the FAFSA to determine financial need and offer financial aid. The Department of Education may select you at random for a process calledVerificationafter completing the FAFSA. We will request various documents to substantiate your income. We also may need to request documents if we come across inconsistencies in your application data. We identify and request required documentation in your To-Do List inCampus Connect. For more information select the FAQ for the appropriate academic year: 2024-2025 Verification FAQ 2025-2026 Verification FAQ (under construction) Your Financial Aid Offer Federal financial aid is determined by analyzing a student’s “need”, which is your Cost of Attendance minus your SAI. After calculating your need and completing the review of any required documentation from your To-Do list, we will put together your financial aid offer. An email notification will direct you to the Financial Aid tile within Campus Connect so that you can view your financial aid package. You must accept, reduce, or decline any loans offered. Aid you are not required to repay is already accepted on your behalf. For information about the type of aid type awarded select the name of the item. Download the Financial Aid Guide to learn more about merit aid, grant aid, and student loans. 2024-2025 Financial Aid Guide 2025-2026 Financial Aid Guide​ We package financial aid throughout the academic year. If you have any questions,contact usfor assistance. Need to Appeal Your Circumstances? Financial situations can change from year to year. We realize that your FAFSA may not reflect your current financial picture. If your family’s financial situation has changed significantly since you completed the FAFSA, you may appeal your financial aid decision in order for us to assess your current family circumstances. Important Update: This is an important update for students who have submitted an income/expense special circumstance appeal for the 2024-25 academic year and are waiting to hear the results of the appeal. There are several types of appeals: Income/Expense Related Special Circumstance Appeal Submit this type of appeal if one of the following special circumstances exists. If your SAI is zero or negative, do not select an Income/Expense Special Circumstance Appeal. Loss or reduction of employment, or significant reduction of income (job loss with 12 weeks of continuous unemployment, death of parent, etc.) You or your parents received a one-time, nonrecurring income (pension payout, inheritance, employer reimbursements) that artificially inflated your adjusted gross income (AGI) Out-of-pocket medical or dental expenses in excess of 11% of your parent(s) AGI Change in employment Loss or reduction of benefits (work, federal, or other benefits) IRA and /or pension rollover Private school tuition paid toward elementary or secondary education for the academic year for which you’re appealing Unusual Circumstance When completing a FAFSA, several questions are asked to determine a student’sdependency status. In some cases, a student who the FAFSA determines to be a dependent student may be experiencing specific conditions which may justify an aid administrator making a change to their dependency status. A parent’s inability or disinterest in assisting a student in paying for college is not in and of itself a reason for a dependency override; however, if you have unusual circumstances, please contact us so we can discuss your situation in greater detail. Non-Income/Non-Expense Appeal Submit this type of appeal if you have circumstances that are not related to an income or expense change, or you have a zero or negative SAI. You will need to provide details about financing your DePaul education, your academic accomplishments, and your anticipated graduation date. Submitting a special or unusual circumstance appeal does not guarantee an increase in your financial aid. We will thoroughly review your situation to determine if any further aid can be made available, and this may result in additional loan options. If you were selected for verification, that process must be finished before your appeal can be reviewed. We must receive all necessary documentation before we can begin assessing your appeal."
}