{
  "url": "https://www.depaul.edu/distinctions/Pages/sustainable-change.aspx",
  "title": "\r\n\tEnabling Sustainable Change  |  Distinctions  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Enabling Sustainable Change Lexa Murphy and other DePaul University faculty hope to eventually work themselves out of their jobs fighting HIV and AIDS in Kenya. It’s impossible to avoid superlatives when talking about the HIV and AIDS prevention work being done in Kenya by a team of faculty and staff from the Department of Psychology, the Master of Public Health program, and the College of Communication. More than 300,000 youths reached and 2500 teachers trained. Nearly 400,000 miles traveled in more than 20 trips over seven years. The first and still the only, non-clinically-oriented partnership funded through the U.S. President’s Emergency Plan for AIDS Relief (PEPFAR) working with Kenyan youth in HIV and AIDS prevention. The project was born in 2004 when Gary Harper (professor of Psychology and director of the Master of Public Health program) and Lexa Murphy (associate professor, College of Communication) went on a University-sponsored faculty and staff trip to Kenya. “Our intent was to see what kind of relationships DePaul could create in Nairobi and the surrounding areas,” recalls Murphy. “At that time, Gary already had years of experience in HIV and AIDS prevention behavior work, so we were able to propose a partnership in which we would bring technical and capacity building skills, and our peers in Kenya would contribute local and cultural knowledge. We would work together to address complex problems.” The DePaul team paired with the Kenya Episcopal Conference-Catholic Secretariat to develop a comprehensive, faith-based abstinence and behavior change program targeting youth ages 11 to 14. The program is extra-curricular and the teachers volunteer to participate. “Everyone wants this information,” says Murphy. Breaking The Silence “Working with our peers in Kenya, we’ve created the program, piloted it, gathered feedback, modified the program, and are now evaluating it by using pre-and post-program tests to assess changes in knowledge, attitude, and future behavior-related intentions,” says Leah C. Neubauer, program manager, with DePaul’s Master of Public Health program. “We’re working with teachers to establish a script, a language to ‘talk’ about HIV/AIDS—they are dedicated to addressing and fighting this disease.” “We hope to play a role in breaking the silence around issues of HIV and AIDS,” says Harper. “We don’t see ourselves as coming in and ‘saving’ these communities, but instead, we’re helping to find their areas of strength and then working side-by-side to build their capacity to lower the rates of HIV infection.” The program includes a complementary radio component that reinforces the content of the school program. The team helps create broadcasts—audio documentaries and radio theater with youth-friendly messages—played on Radio Waumini, the Catholic radio station. “When I interview parents after they’ve participated in the program, I feel like I’m seeing a true cultural change.” Lexa Murphy, associate professor, DePaul University The Momentum Of Success In 2008, Andrew Riplinger joined the team to coordinate the team members’ activities and act as a liaison between all the parties. “We help design and deliver training, capacity building, and technical assistance to national teams of teachers and administrators, who have so far expanded the program out into 24 dioceses and more than 15,000 schools,” he says. In fact, the program has been so successful that last year, the team piloted a five-week parent-child communication program called “Families Matter!” “Talk of sex is taboo in many parts of Kenyan society, and parents couldn’t talk with their children about what they were learning in the school program,” says Murphy. “When I interview parents after they’ve participated in the ‘Families Matter!’ program, I feel like I’m seeing a true cultural change. Parents say how much the program has changed their dynamics with their kids and their partners. They even talk about other topics more easily now.” Teresa Mastin, associate professor in the DePaul University College of Communication, joined the team this year to start a new relationship with the University of Nairobi’s Centre for HIV Prevention and Research. “We’re aiming to strengthen a community of sex workers so they can get funding, be chosen as a test group for an anti-HIV microbicide being developed elsewhere in Africa, or receive the skills training they need to leave the sex trade. By encouraging mass media to advocate for these women, we are improving their chances of success.” Creating Sustainable Change In all the Kenyan projects, “system strength” and sustainability are the goals. “Because we follow a community-based capacity-building model, we work collaboratively with our Kenyan partners to share and enhance existing resources and expertise,” says Riplinger. “Our shared objective is long-term change; ultimately, our Kenyan partners will continue to do this work in our absence. In the end, we hope to work ourselves out of a job.” ■ Learn what makes DePaul Distinctive Global Health and Human Rights Find out why researchers are working to eliminate health disparities around the world. Protein Puzzles Discover how studying a protein may lead to curing and preventing Alzheimer’s disease."
}