{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/history-art-architecture.aspx",
  "title": "\r\n\tHistory of Art and Architecture | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>History of Art and Architecture History of Art and Architecture Gain a critical understanding of art history The History of Art and Architecture program focuses on the diverse visual traditions of different societies around the world. You will develop visual literacy by critically thinking about how art and architecture affect individuals and societies. As an art history major, you’ll enhance your persuasive writing, research and oral communication skills and take advantage of Chicago’s extensive cultural resources. As you earn your art history degree, you’ll enrich your classroom experience though site visits to exhibits, museums, urban landscapes and architectural monuments around the city. We offer the 3+3 BA/JD Program, which allows high-achieving first-year undergraduate students to be admitted simultaneously to the College of Liberal Arts and Social Sciences (LAS) and the College of Law (LAW). You’ll complete your first three years in LAS and your final three years in LAW. Classes Coursework Arts of the Americas African Art Historical Research and Writing Art Historical Theory and Methodology Japanese Film Arts Northern Renaissance Art History of Photography Museum Studies Italian Renaissance Chicago Architecture Latin American Art Resources Major Requirements Schedule of Classes College Website Minors offered Combined bachelor’s + master’s degree offered Career Options Common Career Areas Architectural conservation Art librarian Curatorial work Education Historic preservation Art conservation Research 82% of History of Art and Architecture graduates were employed, continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program."
}