{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/secondary-education.aspx",
  "title": "\r\n\tSecondary Education | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Secondary Education Secondary Education Make a lifelong impact on your students The Secondary Education program prepares you to teach 5th through 12th grade in a variety of urban and suburban education settings, including public and private middle schools and high schools. You can graduate with a State of Illinois license to teach designated subject-area content (listed below). The program also provides you an opportunity to receive a Diploma Year Program Award (IB certification) to teach in International Baccalaureate schools world-wide. As part of the secondary education major, you’ll learn educational theories and effective teaching practices, including how to design and implement curriculum; participate in extensive field experiences at multiple schools, and student-teach for 10 weeks. The secondary education major program, in preparing you to meet Illinois State Licensure requirements, combines education courses from the College of Education with subject-area courses. Through the program, you have two options for becoming a licensed 5th- through 12th-grade teacher: complete the secondary education major degree and a second major in the subject area you intend to teach (double major), or complete as part of your secondary education major degree coursework in the subject area you intend to teach. You can earn either a Bachelor of Arts or a Bachelor of Science degree from the College of Education, depending on your subject area. Classes Coursework Assessment Issues Curriculum Development Educational Foundations Instructional Delivery Instructional Strategies International Baccalaureate Pedagogy and Theories of Teaching and Learning Research Methods Resources Major Requirements Schedule of Classes Department Website Concentrations/Tracks English (BA) History (BA) Mathematics (BA) Social Science (BA) Visual Art (BA) Biology (BS) Chemistry (BS) Environmental Science (BS) Mathematics (BS) Physics (BS) Combined bachelor's + master's degree offered Career Options Common Career Areas Teaching Administration Education policy 86% of Secondary Education graduates were employed, continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program."
}