{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/economic-data-analytics.aspx",
  "title": "\r\n\tEconomic Data Analytics | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Economic Data Analytics Economic Data Analytics Earn your economic data degree DePaul’s bachelor’s degree in Economic Data Analytics prepares you to use economic data to inform important business decisions and provide real-world, data-driven solutions for companies and organizations of all sizes. As you take coursework for your economic data major, you’ll: establish a solid foundation in quantitative methods of economics learn to evaluate big data using economic theory and cross-sectional and time-series data-analysis techniques obtain a deep understanding of econometrics and economic policy analysis learn how to question data through an understanding of theory and applications in a variety of markets gain critical and creative thinking skills to generate innovative ideas and strategies acquire statistical analysis software skills with STAT, R and SAS programs As an economic data major, you’ll take classes in downtown Chicago—in the heart of the city’s financial district, where you’ll have countless opportunities to intern and work with leading business and technology firms. We offer a combined degree with a Master of Science in Economic Policy Analysis for eligible students who want to earn both a bachelor’s and a master’s degree. Utilizing your undergraduate coursework, you’ll be able to complete both degrees in five years. As a STEM-designated bachelor’s degree program, international students who wish to start their careers with significant work experience in the U.S. will benefit. The Optional Practical Training period is extended from 12 to 36 months once an international student graduates with this degree. Classes Coursework The Chicago Economy Economic Analytics Using SAS and R European Economic History Labor Economics and Organization Law & Economics Managerial Decision Making Market Structure and Regulation of Business Mathematical Economics Professional Writing for Business Sustainable Strategies for Energy and the Environment Time Series Analysis Resources Major Requirements Schedule of Classes Department Website Combined bachelor’s + master’s degree offered Career Options Common Career Areas Actuarial science Business intelligence analysis Data science Data products analysis Economic research Financial consulting Investment analysis Market research Predictive analysis Program management Get more information Complete the form below to receive more information about this degree program."
}