{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/political-science.aspx",
  "title": "\r\n\tPolitical Science | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Political Science Political Science Understand the politics that shape our lives DePaul’s political science program studies the organization and behavior of people, groups and institutions that make up political and governmental systems. You will be introduced to questions, perspectives and arguments about the political forces that shape your life. A degree in political science incorporates historical, psychological, sociological, economic and philosophical dimensions to help you develop critical thinking, research and communication skills. Chicago, one of the most dynamic political scenes in the United States, offers many opportunities for you to become involved in politics, non-profit organizations and advocacy organizations, allowing you to apply your coursework to real life situations. You can earn a combined bachelor’s + master’s degree in Political Science and Journalism. This program allows you to complete a bachelor’s degree and a master’s degree in as few as five years. We also offer the 3+3 BA/JD Program, which allows high-achieving first-year undergraduate students to be admitted simultaneously to the College of Liberal Arts and Social Sciences (LAS) and the College of Law (LAW). You’ll complete your first three years in LAS and your final three years in LAW. The political science department also offers minors in American Politics, International Politics, and Public Law/Political Thought. Classes Coursework The American Political System International Relations Comparative Politics Public Law Political Analysis and Research Politics and Multiculturalism Political Action and Social Justice Resources Major Requirements Schedule of Classes College Website Concentrations/Tracks American Politics International Politics Law and Theory Standard Minor offered Combined bachelor’s + master’s degree offered Career Options Common Career Areas Law Social service International relations Humanitarian efforts Research and urban planning Campaign management Political work Education 91% of Political Science graduates were employed, continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program."
}