{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/criminology.aspx",
  "title": "\r\n\tCriminology | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Criminology Criminology Improve the criminal legal system The criminology program will prepare you to study the frequency, location and causes of crime. You’ll learn how to collect data, analyze your findings and present policy recommendations. A Bachelor of Arts in criminology will provide you with the analytical, research and organizational skills needed to improve the criminal legal system for both victims and offenders. You will learn the processes and institutions of the criminal legal system. Explore how law enforcement, courts, corrections and community organizations address crime in society. Through program coursework, you will examine structural challenges, behavior patterns and criminal trends. A criminology degree provides you with a foundation for graduate work in law, social work, sociology, public policy and public health. We offer the 3+3 BA/JD Program, which allows high-achieving first-year undergraduate students to be admitted simultaneously to the College of Liberal Arts and Social Sciences (LAS) and the College of Law (LAW). You’ll complete your first three years in LAS and your final three years in LAW. Classes Coursework Crime and the Media Criminal Law and Procedure Federal Law Enforcement Agencies Introduction to the Criminal Legal System Law Enforcement Race, Class, Gender and the Criminal Legal System Research Methods in Criminology Victimology Resources Major Requirements Schedule of Classes College Website Concentrations/Tracks Community Justice Criminal Justice Administration Race, Class, Gender, and Justice Minor offered Combined bachelor’s + master’s degree offered Career Options Common Career Areas Attorney Correctional officer Crime scene investigator Judge Mental health counselor Police officer Victim advocate 86% of Criminology graduates were employed, continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program."
}