{
  "url": "https://www.depaul.edu/academics/undergraduate/Pages/combined-degrees.aspx",
  "title": "\r\n\tCombined Degrees | DePaul University | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Combined Degrees Combined Degrees Earn both your undergraduate and graduate degrees — saving you money and time Is graduate school part of your plan? It is for many of our students. Consider getting a combined degree here at DePaul. Benefits of earning a combined degree Shorten your time in school DePaul’s combined bachelor’s + master’s degree programs allow you to earnboth your undergraduate and graduate degreesin as few as five years (rather than the traditional six or more). You’re able to do this because some of the courses you’ll take during your senior year will count toward both your bachelor’s and master’s degrees. You’ll go seamlessly from your undergraduate classes right into your graduate coursework. Save money Once you earn your bachelor’s degree at DePaul, you’ll receive theDouble Demon Scholarship. You’llsave about 40 percent on tuitionfor your master’s degree with this scholarship and the graduate courses you took during your senior year. Enhance your career path With both your bachelor’s and master’s degrees, you’ll stand out among your peers with your additional educational credentials — giving you a leg up as you begin your career. Choose from hundreds of degree options A number of undergraduate majors can be combined with graduate programs tocreate the combined degree that’s right for you. If you’re interested in pursuing a combined degree, we recommend you discuss your options with your academic advisor, usually at the beginning of your sophomore year. A few of the unique degree paths our students have chosen include: an Economics major pursuing a graduate degree in Sociology a Health Sciences major pursuing a graduate degree in Nursing an Information Systems major pursuing a graduate degree in Business Information Technology a Media and Communication major pursuing a graduate degree in Health Communication Still deciding?"
}