{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/health-sciences.aspx",
  "title": "\r\n\tHealth Sciences | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Health Sciences Health Sciences Promote good health and improve lives The Health Sciences major program will prepare you for a variety of healthcare professions by combining biomedical instruction with an understanding of how societal factors impact health. Whether you want to become a healthcare practitioner, administrator or policy-maker, you’ll learn how to solve health-related problems as part of a team. As a Health Sciences major, you’ll choose one of two concentrations. The Bioscience concentration focuses on the scientific elements of an individual’s health, preparing you for a career in dentistry, medicine, nursing, pharmacy or physical therapy. The Bioscience - Accelerated Program is for qualified Health Sciences majors in the BioScience concentration who have been accepted into an accelerated 3+ College of Science and Health pre-professional program in conjunction with Rosalind Franklin University of Medicine and Science (RFUMS). The Public Health Sciences concentration focuses on understanding the health care needs of populations, preparing you for a career in community health, health care administration, health communication and public health. DePaul offers combined bachelor’s + master’s degree programs, which allows you to complete a bachelor’s degree and a graduate degree in as few as five years. Health Sciences majors may choose to combine your bachelor’s in Health Sciences degree with a Health Communication, Public Health, or Nursing master’s degree. Health Sciences faculty members come from a number of disciplines, including biology, chemistry, communication, nursing, psychology, public health and sociology – allowing you to learn about the healthcare industry from a variety of perspectives. Chicago is home to extensive healthcare systems and numerous insurance companies, medical associations and pharmaceutical corporations. You’ll have multiple opportunities to gain hands-on experience through internships and research projects in hospitals, laboratories and medical-industry settings. Classes Coursework Health Research Literacy Introduction to Public Health General Biology Microbiology Resources Major Requirements Schedule of Classes Department Website Concentrations/Tracks Bioscience concentrationGeneral TrackLab Investigations TrackMedical/Graduate TrackPre-Nursing Track General Track Lab Investigations Track Medical/Graduate Track Pre-Nursing Track Bioscience—Accelerated Program Medicine Pathologists’ Assistant Pharmacy Physical Therapy Physician Assistant Podiatry Public Health Sciences concentration Combined bachelor's + master's degree offered Career Options Common Career Areas Clinical trials management Community health worker Health care administration Health communication Health policy Hospital administration Medical school Nursing school Pharmacy school Physical therapy school Public health 97% of Health Sciences graduates were employed, continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program."
}