{
  "url": "https://www.depaul.edu/distinctions/Pages/health-informatics.aspx",
  "title": "\r\n\tWorking Smarter with Health Informatics  |  Distinctions  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Working Smarter with Health Informatics Associate Professor Enid Montague on the MS in Health Informatics. Enid Montague joined DePaul in 2015 to head the innovative MS in Health Informatics program—bringing together expertise from three colleges—the Jarvis College of Computing and Digital Media (CDM), the Kellstadt Graduate School of Business, and the College of Communication—to teach students how to use technology to improve health care access, quality, and outcomes, for more patients in more settings, through better information management, health care analytics, enterprise management, and information security. More than a computer science degree The program provides distinctive value for both the health care industry and DePaul students. “We’ve created a solution to satisfy an important and growing need,” says Montague. Because the delivery of health care is so complex in the US, even people with great computational skills need a fundamental and practical understanding of the health care industry, Montague explains. Knowing how health care is delivered and how various parts of the sector work together or fail to do so is essential so that technology can be applied to make improvements. “And the need for improvement is huge,” Montague says. “In the US, we’re talking about high costs, lots of issues around patient safety, worker burnout, a shortage of nurses and primary care physicians, and an aging population. In the next few years, the industry is going to have to figure out how to do a lot more with a lot less.” Montague also notes that the industry has been slow to adapt to technology to improve work. “For example, health care providers—hospitals, clinics, physicians—are just beginning to use databases to organize and share patient information, even though that would be efficient and effective. In other industries, like banking, electronic record management has been common practice for a long time,” she says. “So, in health care, there’s a lot of 'newness' with technology, a lot of room to develop new technology, and many, many ways to use technology to improve processes and outcomes.” This is where health informatics comes in. Students use new and evolving technology to address the health care industry’s tough and unique challenges. “I like to say that they’re not just computer scientists; they’re the next generation of problem solvers.” Enid Montague, Associate Professor, Jarvis ​College of Computing and Digital Media DePaul’s approach to health informatics Montague says that one of the things that attracted her to this program is its intellectual diversity. “Our program is broad and deep, and I think that’s exactly the kind of training the industry needs and wants. Beyond the core courses, we offer all kinds of specialties.” For example, a student interested in health care analytics can take classes in data analysis and regression, data visualization, intelligent information retrieval, social network analysis, service design and the patient experience. If a student wants expertise in enterprise management, he or she can learn about IT project management, business continuity and disaster recovery, managerial and marketing epidemiology, or information storage and management. We also offer electives in database processing, technology innovation, and information security management—all within the health care context. “Lots of choices, which is great for our students and great for their future employers,” Montague says. “I’m confident that our graduates will succeed in many different sectors within health care. Right now, there are so many career opportunities—they could work in quality improvement in a hospital, or begin a startup to develop new technologies that would improve patient care management, or trace trends in diseases based on patient data—really, the options are nearly unlimited. And these are good jobs, with good salaries and good work environments.” Enid Montague, Associate Professor, Jarvis College of Computing and Digital Media “Maybe most satisfying for our students, and most in line with DePaul’s mission, the work matters; it’s work that can save lives,” says Montague. “That’s really special, I think.” ■ Learn what makes DePaul Distinctive Supply Chains on Steroids Nezih Altay discusses solutions to bring relief to devastated places and people. Mission to Mars Suzanne Bell discusses her research and how it is contributing to long-distance space exploration."
}