{
  "url": "https://www.depaul.edu/distinctions/Pages/theatre-role-model.aspx",
  "title": "\r\n\tTheatre Role Model  |  Distinctions  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Theatre Role Model Nan Cibula-Jenkins’s impressive career in costume design brings invaluable experience into the classroom. Nan Cibula-Jenkins, a former professor at The Theatre School, has designed costumes for Broadway, feature films, and regional theatres. Her work can be seen in Good People at Steppenwolf Theatre. \"Costumes are a visual representation — an illumination — of a play’s characters and their world. Sometimes our intent is to reveal the characters; sometimes it’s to disguise them. Costume designers and technicians need to understand so many things — the play itself, the director’s intentions, the economic and social climate of a specific time period, and each character’s emotional and psychological dimensions. \"DePaul theatre students get training that’s current and cutting-edge, because DePaul teachers are contemporary theatre artists and active participants in the profession. My \"research and scholarship\" is designing for theatre companies. (I’m lucky, really — and so are my students — that Chicago has such a terrific, vibrant theatre community.) What this means, practically speaking, is that we’re preparing talented people to work in the real world. A practical approach \"Every time I work on a play, I learn new techniques and see things in different ways. And my students benefit. When I bring them to dress rehearsals, they have a rare and wonderful opportunity to see design theories in action and to question me about my choices. Then, I invite professionals from the theatre community to speak in class — these are costume designers and technicians from the Goodman Theatre, the Chicago Shakespeare theatre, the Steppenwolf Theatre, and other Chicago groups. The in-class dialogue is terrific, but even more important the students meet someone from the 'real world' who they can contact later with questions. They gain a way to find answers on their own, and that’s wonderful! As my students work on shows for The Theatre School, I supervise them (as part of a large support staff) to assure the development and application of their skills. \"Theatre is a community activity, and The Theatre School way at DePaul recognizes a bigger picture in this fact. Working in theatre, a person sees the world from many sides and learns to understand his or her community from many perspectives. For our students, the theatrical experience can inspire imagination, leading them to address difficult issues creatively, to question the status quo, and to make a difference in the world. Here, we appreciate that the theatre can be — should be — a personally transformative experience.\" Nan Cibula-Jenkins, former professor and head of costume design, DePaul University Nan Cibula-Jenkins’ work has been exhibited nationally and internationally, most recently in “Curtain Call: Celebrating a Century of Outstanding Women Designers in Live Performance” at the New York Public Library for the Performing Arts (2008). She received her MFA from Yale University. Recent works Who's Afraid of Virginia Woolf— Booth Theatre, Broadway (2012)Good People— Steppenwolf Theatre (2012)Angels in America— Court Theatre at the University of Chicago (2012)Ah, Wilderness— Arena Stage, Washington D.C. (2012)Clybourne Park— Steppenwolf Theatre (2011)Other Desert Cities— Arena Stage, Washington D.C. (2013) Learn what makes DePaul Distinctive Global Health and Human Rights Find out why researchers are working to eliminate health disparities around the world. Protein Puzzles Discover how studying a protein may lead to curing and preventing Alzheimer's disease."
}