{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/arabic-studies.aspx",
  "title": "\r\n\tArabic Studies | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Arabic Studies Arabic Studies Experience Arabic language and culture By majoring in Arabic Studies, you will develop the ability to speak, understand, read and write the Arabic language. You will also expand your knowledge of the Middle East and be encouraged to foster an appreciation of Islamic literature and civilization. The Arabic language is one of the United Nations’ six official languages, and the U.S. Government considers it one of the most critical languages for Americans to learn. Chicago has one of the nation’s largest Arab-American populations in the U.S., giving you opportunities to visit its communities and gain first-hand knowledge about the Arab culture and language. We also offer the 3+3 BA/JD program, which allows high-achieving first-year undergraduate students to be admitted simultaneously to the College of Liberal Arts and Social Sciences (LAS) and the College of Law (LAW). You’ll complete your first three years in LAS and your final three years in LAW. Classes Coursework Cultures of the Middle East Media in the Arab World Middle East Politics Islam in Global Contexts Media and Cultural Studies Arab Culture Modern Arabic Literature in Translation Resources Major Requirements Schedule of Classes College Website Minor offered Combined bachelor’s + master’s degree offered Career Options Common Career Areas Public policy International business Translation services Immigration work Social services Law Human rights 84% of Arabic Studies graduates were employed, continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program."
}