{
  "url": "https://www.depaul.edu/admission-and-aid/financial-aid/maintain-eligibility/Pages/compliance.aspx",
  "title": "\r\n\tComplying with Terms & Conditions  |  Maintain Eligibility  |  Financial Aid  |  Admission & Aid  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Financial Aid Financial Aid Basics Types of Aid Receive Aid Maintain EligibilitySatisfactory Academic Progress (SAP) PolicyReturn Title IV AidWithdrawal from ClassesFinancial Aid Terms & ConditionsLimits & Maximums Satisfactory Academic Progress (SAP) Policy Return Title IV Aid Withdrawal from Classes Financial Aid Terms & Conditions Limits & Maximums Manage Costs Repay Loans Resources for... Forms Contact Us Apply Online Request Info Visit Campus DePaul University>Admission & Aid>Financial Aid>Maintain Eligibility>Financial Aid Terms & Conditions Complying with Terms & Conditions ​​Students that are interested in financial aid must file a FAFSA application annually. By participating in federal financial aid programs, it is your responsibility to maintain eligibility, and to continuously comply with the federal eligibility requirements as explained in your FAFSA, your award notification, and as outlined below: You must make steady progress in your program and comply with theSatisfactory Academic Progress Policy. Once you have completed your program requirements, you are no longer eligible for federal or state financial aid, and your options for institutional aid may be limited. In addition, if you wish torepeat a coursefor which you have previously earned credit, your financial aid options are limited. For most financial aid programs, and for loan deferment, you must enroll in your program at least half time. Your classes must be taken for credit and must be part of your program requirements. Audited courses are not eligible for financial aid consideration. If any FAFSA information is incorrect or has changed, you must notify the Office of Financial Aid. You must notify the Office of Financial Aid atofascholarships@depaul.eduif you are receiving any additional financial aid that does not appear on your award notification. This includes financial assistance from any source — external scholarships or grants, fellowships, assistantships, educational benefits, employee benefits or tuition assistance. The Office of Financial Aid will need to take these resources into consideration when determining your eligibility for any federal, state and institutional aid you may be awarded, including any institutional tuition-restricted or need-based aid. If a revision is required, the Office of Financial Aid will send you a revised award notification. You must actively begin and participate in your courses each quarter to establish and maintain your eligibility for federal financial aid. If you change academic programs, you must notify the Office of Financial Aid so we may review your federal aid eligibility in your new program. You must meet the enrollment requirements to receive the aid you have been awarded. If you participate in any financial aid program that uses your academic level to determine you eligibility, it is your responsibility to notify the Office of Financial Aid by completing ourRequest to Adjust Federal Loans Formif your academic grade level changes after we offer your aid. If at any time you stop attending, complete the universitywithdrawal processin Campus Connect. You must not be in default on a federal student loan or owe a refund on federal student aid. This also applies to parent borrowers of the Federal Direct PLUS Loan Program. You must respond to requests for additional documentation within the specified timeframe. You must certify that any federal student aid funds received during the award year will be used solely for educational expenses related to attendance during the year. You must notify the Office of Financial Aid if you, or your parent borrowing a Federal Direct PLUS Loan on your behalf:are convicted of a drug offense while enrolled at DePaul and receiving financial aid, orare incarcerated or become incarcerated while enrolled at DePaul and receiving financial aid, orare convicted of, or pled guilty/non-contest to, a crime involving fraud in obtaining federal student aid funds, orare subject to a lien for a debt owed to the United States. are convicted of a drug offense while enrolled at DePaul and receiving financial aid, or are incarcerated or become incarcerated while enrolled at DePaul and receiving financial aid, or are convicted of, or pled guilty/non-contest to, a crime involving fraud in obtaining federal student aid funds, or are subject to a lien for a debt owed to the United States."
}