{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/wig-makeup-design-technology.aspx",
  "title": "\r\n\tWig and Makeup Design & Technology | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Wig and Makeup Design & Technology Wig and Makeup Design & Technology Design wigs and makeup for the stage In the Wig and Makeup Design & Technology major, you’ll explore and expand your artistic and visual expression while gaining practical experience in this growing field. You’ll receive training in wig construction and styling, makeup design and application, styling of actors’ hair, and creation of makeup prosthetics. You’ll collaborate with actors, directors, designers and technicians, as well as our professional makeup shop staff. By working closely with faculty members and production teams, you’ll create and design wigs and makeup for multiple public productions by The Theatre School. Learn from a distinguished award-winning faculty of professional designers and artists, both in the classroom and through individual guidance and advising during production work. Faculty will share formal and informal feedback during portfolio presentations and exhibits of your work each year. Classes Coursework Costume Crafts: Painting and Dyeing Drawing for Designers History of Costume, Hair and Makeup History of Dramatic Literature Media for Designers Portfolio Preparation Portraiture for the Wig and Makeup Artist Resources Major Requirements Schedule of Classes Department Website Combined bachelor's + master's degree offered Career Options Common Career Areas Hair stylist Makeup artist Makeup designer Makeup technician Special effects makeup designer Wig designer Wig master Wig technician​​ Get more information Complete the form below to receive more information about this degree program."
}