{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/theatre-technology.aspx",
  "title": "\r\n\tTheatre Technology | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Theatre Technology Theatre Technology Become an expert in theatre technology The Theatre School’s Bachelor of Fine Arts (BFA) theatre technology degree will train you in the execution and realization of a designer’s vision. As a Theatre Technology major, you’ll collaborate with designers and other technicians to create the set, props, light, and sound for theatre and entertainment productions. In the Theatre Technology program, you’ll be trained to execute the realization of a designer’s vision working as a technical director, rigger, draftsperson, props artisan, scenic carpenter, and theatrical craftsperson. The program simulates a theatrical technician’s professional experience and process. You’ll learn to translate creative designs into technical plans in order to create the actual physical structures for performances. As you prepare for your theatre technology degree, you’ll also collaborate and problem-solve with directors, designers, and other technicians to create the set, props, and physical environment for theatre and entertainment productions. Learn from a distinguished and award-winning faculty of professional technicians, artists, and designers both in the classroom and through individual guidance and advising. Classes Coursework Construction and Rigging History of Dramatic Literature Principles of Design Production Management Technical Drawing Theatre Crew Resources Major Requirements Schedule of Classes Department Website Combined bachelor's + master's degree offered Career Options Common Career Areas Automation technician Commercial scenic production Craftsperson Production manager Project manager Props artisan Props master Rigger Scenic carpenter & welder Technical director​​ Get more information Complete the form below to receive more information about this degree program."
}