{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/world-language-education.aspx",
  "title": "\r\n\tWorld Language Education | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>World Language Education World Language Education Bring the world to your classroom The World Language Education (WLE) program integrates education and language courses. Your foreign language education degree will prepare you to teach kindergarten through 12th grade in a variety of urban and suburban education settings, including public and private schools. As part of this program, you will take language courses from the College of Liberal Arts and Social Sciences and education courses from the College of Education. You will earn a BA from the College of Education, and concentrations are offered in Chinese, French, German, Italian, Japanese and Spanish. Classes Coursework Culture in the Classroom Grammar and Composition Human Development and Learning Integrating Content into World Language Instruction Literary Analysis Literature Phonology and Phonetics Second Language Acquisition Sociology of Education Teaching Modern Languages Resources Major Requirements Schedule of Classes Department Website Concentrations/Tracks Chinese French German Italian Japanese Spanish Combined bachelor's + master's degree offered Career Options Common Career Areas Teaching Interpreter Translation 100% of World Language Education graduates were employed, continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program."
}