{
  "url": "https://www.depaul.edu/distinctions/Pages/global-health.aspx",
  "title": "\r\n\tGlobal Health and Human Rights  |  Distinctions  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Global Health and Human Rights DePaul professors De Maio and Mazzeo are addressing the problem of global health inequity by giving graduate students a bigger perspective Fernando De Maio and John Mazzeo see the problem of global health inequity from different perspectives within social science. But when it comes to the big picture, De Maio and Mazzeo agree: Not enough people are trained to work successfully on global health in international settings. That’s the gap they’re addressing at DePaul. De Maio, an associate professor and director of the undergraduate program in sociology, looks at a population’s health as a dynamic process: As societies change and risk factors evolve, new health patterns emerge. In his research, he uses radical statistics. “We can measure health inequalities. Statistics are a way of documenting the social and political arrangements that harm populations. And in uncovering those, we start to challenge some of the fundamental divisions in our world.” Fernando De Maio, sociology professor, DePaul University CHANGE IS WHAT THE DATA ORDERED “When talking about global health inequities, we need two ways of knowing: theory and data. The sociologist C. Wright Mills warned us against ‘the blindness of empirical data without theory and the emptiness of theory without data.’ If we document poor health literacy in a population, but have no theory about the cause, we’d have a relatively empty understanding of the problem. Theory frames the right questions and then helps us interpret the data. If data proves a theory wrong, we can come up with a better one.” Mazzeo, an associate professor of anthropology and director of the Master of Public Health program, studies the myths and realities of global health, especially as they reflect underlying sociocultural structures. “The ‘what’ of treatment for many diseases is well known, but the ‘how’ varies by society,” he says. “That’s why we can’t treat an outbreak of a disease in a developing nation—say, cholera in Haiti—the same way we would in the United States, even though the treatment is simple. Here, hospitals and clinics are the mechanism for disseminating information and care; in Haiti, the reach of institutions like these is very limited. If health care isn’t informed by local realities, programs hit the wall. To effect a real change or have a real impact, a crisis response or a health care system needs to be built from the bottom up in ways that respond to cultural and social realities.” Tomorrow’s Leaders: Key TO the SOLUTIONS “Some of our graduates will work internationally; some will work in Chicago,\" says Mazzeo. \"But even those staying here need to know about global health inequities because diseases are not constrained by national borders, as we saw with the Ebola virus, and because Chicago has migrant and refugee populations. What is happening in the places they’ve come from? The answer affects how we identify disease, treat and prevent disease, and raise awareness.” “We’re educating professionals who can think about public health — not just as abstract policies, but as actual programs — at the community level” John Mazzeo, anthropology professor, DePaul University “That’s what we do so well in the liberal arts and social sciences—we widen perspectives,” adds De Maio. “We are all connected. At times that connection brings out uncomfortable truths: We benefit from the sufferings of others. For example, U.S. pharmaceutical companies conduct clinical trials—say for HIV drugs or cancer treatments—on populations of poor people who will never be able to afford the medicine once it comes to market. Working in global health means bringing connections like those into the open and trying to think of ways to make the world more just.” “Our students know that global health is a human rights issue,” says Mazzeo. “And our graduates know that today’s global economic and political systems exacerbate inequities. We’re training students to take the first steps toward finding solutions to that problem.” ■ Learn what makes DePaul Distinctive S.O.S. for At-Risk Teens Learn how our Success Over Stress program helps at-risk teens reduce stress, anxiety and aggression. Protein Puzzles See how studying a protein helps develop strategies for treating and preventing Alzheimer’s disease."
}