{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/business-analytics.aspx",
  "title": "\r\n\tBusiness Analytics  |  Majors  |  Undergraduate  |  Academics  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Business Analytics Business Analytics Develop data-driven business solutions In DePaul’s Business Analytics degree program, you’ll obtain the skills necessary to solve complex business challenges. And by learning how to use data and analytics—with a business focus—you’ll empower companies and organizations of all sizes to make data-driven decisions. As a Business Analytics major, you’ll: develop strong data analytical skills and learn how to apply them to decision-making analyze a variety of data environments in different business contexts gain insight into the functional areas of business and the interrelationships among these areas acquire script-writing skills for data cleansing and analysis learn to leverage data visualization and data storytelling to serve as a bridge between business leaders and data scientists Through our multidisciplinary Business Analytics program, you’ll take a wide range of electives, including textual analysis, causal inference, machine learning and artificial intelligence. You’ll also choose a concentration in a specific business discipline, such as accounting, marketing, management, economics or management information systems. Your classes will be taught by faculty members who are industry professionals, allowing you to learn firsthand from leaders in the business and technology industries. The Driehaus College of Business is located on the Loop Campus, in the heart of Chicago, providing you with countless opportunities to intern and work in business analytics jobs with leading firms. For international students: this program is a STEM-designated program, which can qualify you to extend your post-graduation stay in the United States. Classes Coursework Accounting Analytics Analytics for Economics Artificial Intelligence and Cognitive Technologies Data Analytics in Finance Data Visualization Descriptive and Diagnostic Business Analytics Predictive and Prescriptive Business Analytics Quasi-Experimental Design Strategic Tools for Marketing Resources Major Requirements Schedule of Classes Career Options Common Career Areas Business development manager Business intelligence analyst Business systems analyst Data architect Data scientist Financial analyst Market research analyst Operations manager Operations research analyst Quantitative analyst 93% of Driehaus College of Business graduates were employed, continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program."
}