{
  "url": "https://www.depaul.edu/about/campuses/Pages/loop.aspx",
  "title": "\r\n\tLoop Campus  |  Campuses  |  About  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "About Rankings CampusesLoop CampusLincoln Park Campus Loop Campus Lincoln Park Campus Chicago Events Mission President Administration Distinctions History & Timeline Accreditation & Licensure Apply Online Request Info Visit Campus DePaul University>About>Campuses>Loop Campus Loop Campus Experience the energy of downtown Chicago The minute you set foot on the Loop Campus, you’ll experience the energy of downtown Chicago. Where else can you be within blocks of Lake Michigan, Edward Hopper’s “Nighthawks” at the Art Institute, the Chicago Board of Trade and Al’s Italian Beef (with extra gravy)? You’re immersed in a feast of senses on your way to class Walk among towering skyscrapers. Catch the ‘L’ circling the Loop. Hit pause on your headphones to hear some street music. And graze on fresh-baked donuts and empanadas from food trucks. This is where you’ll study, workandplay The Loop is in the heart of the city, home of Chicago’s largest business district and five DePaul colleges and schools: Driehaus College of Business College of Law School of Continuing and Professional Studies College of Communication Jarvis College of Computing and Digital Media Directions to the Loop Campus DePaul Center1 E. Jackson Blvd.Chicago, IL 60604-2287 Driving DirectionsBy CarFrom the north and northwestFrom the Kennedy Expressway (I-90/I-94) exit at Jackson Boulevard and turn east. The Loop Campus is about one mile from the expressway on Jackson Boulevard at State Street. From the westFrom the Eisenhower Expressway (I-290), continue toward downtown. As you approach the downtown area, the expressway becomes Congress Parkway. Turn left (north) on Dearborn Street, go two blocks to Jackson Boulevard and turn right (east). The Loop Campus is one block east on Jackson Boulevard at State Street. From the southFrom the Dan Ryan Expressway (I-90/I-94) exit at Jackson Boulevard and turn east. The Loop Campus is about one mile from the expressway on Jackson Boulevard at State Street. From Lake Shore Drive (north or south)Exit Lake Shore Drive at Jackson Boulevard and turn west. Proceed to Michigan Avenue (100 east). Turn right on Michigan Avenue, go one block to Adams Street (200 south) and turn left. Go one block to Wabash Avenue (50 east) and turn left. Go one block to Jackson Boulevard. Visitor ParkingMonroe Street Garage (underground) 250 East Monroe StreetCrosstown Auto Park: 328 South WabashAuditorium Garage: 65 East CongressGeneral Parking Corporation: 55 East MonroeCNA Building: 311 South WabashUniversity Self Park: 54 South WabashMid City Parking: 219 South Wabash By Public TransportationCTA TrainsSeven rapid transit train lines service the downtown Chicago area and DePaul's Loop Campus. From the subway trains, exit at Jackson Boulevard. From the elevated trains, exit at Adams Street/Wabash Avenue. These are the train lines servicing the Loop Campus: Howard/95th-Dan Ryan (Red) Linden (Evanston)/Loop (Purple) Kimball/Loop (Brown) O'Hare/Forest Park (Blue) Harlem-Lake/Cottage Grove or Ashland/63rd (Green) Midway/Loop (Orange) 54th-Cermak/Loop (Pink) Buses Bus routes interconnect throughout the city. These buses stop very near the Loop Campus. All routes are subject to change by the CTA. You may contact the CTA at(312) 836-7000or(800) 972-7000or TDD (Hearing Impaired)(312) 836-4949. For more information, visittransitchicago.com. Metra Trains All Metra Train stations are located within a short walking distance (or cab ride) of the Loop Campus: Union Station, Canal Street and Adams Street: Walk east on Adams Street until State Street. Turn right (south) for one block to Jackson Boulevard. Chicago & Northwestern Station, Canal Street and Madison Avenue: Walk east on Adams Street until State Street. Turn right (south) for three blocks to Jackson Boulevard. LaSalle Street Station, LaSalle Street and Congress Parkway: Walk east down Congress Parkway until you reach State Street. Turn left (north) for two blocks to Jackson Boulevard. Illinois Central Station (includes service for South Shore Line), Michigan Avenue and Van Buren Street: Walk north on Michigan Avenue for one block to Jackson Boulevard. Turn left (west) on Jackson Boulevard to State Street. By BikeDivvy Divvyis Chicago's bike sharing system, with thousands of bikes and hundreds of stations throughout the city. There are several Divvy stations located near DePaul's Loop Campus. For more information and pricing, please visitdivvybikes.com. Places to Stay Near the Loop Campus Visit the Demon Discounts siteto find hotels near our Loop Campus. Restaurants Chicago is home to thousands of restaurants, varying in cuisine and atmosphere. Although we're most famous for our deep dish pizza, Chicago has much more to offer. Part of the fun you'll have while visiting or attending DePaul is trying different restaurants in various neighborhoods. Here are a few resources to help you find your next great meal: Chicago Magazine OpenTable Trip Advisor Yelp"
}