{
  "url": "https://www.depaul.edu/Pages/social-media-guidelines.aspx",
  "title": "\r\n\tDePaul University | DePaul University, Chicago\r\n",
  "content": "DePaul University Recent Apply Online Request Info Visit Campus DePaul University>Social Media Standards Social Media Standards DePaul is a university community that is committed to fostering open discourse. At the same time, we are committed to being a community of speakers and listeners marked by compassion and respect for the dignity of others. As noted in our Guiding Principles for Speech and Expression at DePaul University, we aspire to be a community in which we never lose sight of the potential effects, both beneficial and harmful, of our words. We are a community that at its core is a place of care, compassion, and concern for one another. We ask that you always keep this in mind when posting or commenting on DePaul social media networks.Our goal is to provide a community where friends of the university can share content, ideas and experiences and find helpful information. To keep the site fun and lively, we ask that you respect the terms of service of this social platform as well as our rules below. We reserve the right to remove posts that don’t comply.We want to be especially mindful of the following behaviors that violate university policy and may result in disciplinary action for DePaul community members: Behaviors that threaten harm or cause to place in harm’s way themselves or other persons. Behavior that is illegal, destructive, lewd, indecent, obscene or disorderly. Any form of discrimination, retaliation or harassment. Be respectful.DePaul is committed to Vincentian respect for the dignity of others and to the civil and thoughtful discussion of opposing ideas. It’s OK to voice a complaint or disagree with another post, but please do so in a constructive manner. Obscenities, personal attacks, and defamatory comments about any person, group, organization or belief may be removed without notice. We also ask that you pause before responding to a post, and focus primarily on a comment’s content/main point and not necessarily on correcting or debating the manner in which a poster states something (unless the manner in which it is stated violates these standards). Be accurate.Please know your facts before you post. We will correct or remove factual errors. Focus on DePaul.Please keep your posts and comments relevant to DePaul and its students, faculty, staff and alumni. If you are part of the DePaul community, it’s OK to post an occasional link to your DePaul-based group or event, but excessive posts may be removed Discounts offered to DePaul students, alumni or employees (unless your company is part of Demon Discounts) Promotions for non-DePaul events Rental housing ads Promotions by non-DePaul organizations, including political, religious and activist groups Posts about job openings or by recruiters in general are best for theAlumniorCareer Centercommunities Vendors who wish to join the Demon Discounts program should contactProcurement To promote a rental opening, sign up on DePaul’sOff-campus Housing website Protect your privacy.Your comments are visible to all. Never include your phone number, e-mail address or other personal information in a post. If you want an individual follow-up, send a message through the site to a page administrator. We’re responsible for what we post. You’re responsible for what you post.Posts by page administrators will appear next to the official page icon. Any other comments on the site do not necessarily reflect the opinions and positions of DePaul University. You are legally responsible for the comments you post. DePaul is not responsible for the content of any website outside the depaul.edu domain. The inclusion of any non-DePaul link, whether by a DePaul employee or anyone posting on the site, does not imply endorsement by DePaul of that website. Post material that infringes on the rights of any third party, including intellectual property, privacy or publicity rights. Post material that is unlawful, obscene, defamatory, threatening, harassing, abusive, slanderous, hateful, or embarrassing to any other person or entity as determined by DePaul in its sole discretion. Post ads or solicitations of business. Post the same note more than once (\"spam\"). Post chain letters or pyramid schemes. Impersonate another person. Allow any other person or entity to use your identification for posting or viewing comments. Disruptive Community Member or Commenter If a community member or commenter violates these standards, or if they post solicitations or promotions not related to DePaul, the individual will be sent a message via the social media channel informing them that they have violated the community standards, that their post or comment will be hidden/deleted, and that if they continue to post or comment in such a manner, they will be blocked or removed from the group. DePaul community members (faculty, staff or students) who appear to have violated university policy through a post or comment will be referred to the appropriate university office and may be subject to further disciplinary action for the violation. If you have any questions about the information here, please send a messa​ge to the site administrator/s."
}