{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/physical-education.aspx",
  "title": "\r\n\tPhysical Education | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Physical Education Physical Education Instill the importance of physical activity Our bachelor’s degree in Physical Education (BSPE) will prepare you to pursue a career in teaching physical education in schools from kindergarten through high school. The P.E. program prepares you to teach children in a variety of urban and suburban educational settings, including both public and private elementary and high schools. You’ll learn theoretical principles of education, teaching techniques and curriculum development. Through our physical education degree program, you’ll also participate in field experiences in local schools and student teach in order to gain hands-on experience. Classes Coursework Adolescent and Adult Development Athletic Injuries Fitness and Conditioning Kinesiology Managerial Concepts and Practices Personal and Community Health Physiology of Exercise Principles of Marketing Resources Major Requirements Schedule of Classes Department Website Minor offered Combined bachelor’s + master’s degree offered Career Options Common Career Areas Athletic coaching Education Fitness programming Marketing Outdoor education Personal training Recreation center management Sports events planning 91% of Physical Education graduates were employed, continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program."
}