{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/biological-sciences.aspx",
  "title": "\r\n\tBiological Sciences | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Biological Sciences Biological Sciences Bring life to scientific theories and discoveries As a Bachelor of Arts (BA) or a Bachelor Science (BS) in Biological Sciences major, you’ll gain the knowledge and skills you need to succeed in a wide range of careers in science, research, education, health and other fields. Inside and outside the classroom, you’ll learn to think independently and work collaboratively. Here, most faculty members direct their own research programs, giving you an opportunity to work on multiple research projects. Biological Sciences majors are encouraged to attend seminars and complete internships. If you’re interested in pursuing a career in education, the Department of Biological Sciences also partners with the College of Education to award teaching degrees. We also offer a combined bachelor’s and master’s degree program in Biological Sciences as well as a combined bachelor’s and master’s in Biological Sciences and Secondary Education Biological Sciences. Both of these combined degree programs allow you to complete a bachelor’s degree and a graduate degree in as few as five years. The B.A. in Biological Sciences major provides you with a strong foundation of biology, without requiring you to master related math and science fields. You'll explore courses and electives in humanities and social sciences that will prepare you for a wide range of interdisciplinary careers and professional programs in health. The B.S. in Biological Sciences major offers you a structured curriculum, with more of an emphasis on science- and math-focused courses. As you gain a strong foundation of knowledge in biological science theories and practices, you'll choose one of the following concentrations: cell and molecular biology ecology and evolution integrative biology medicine and health microbiology and biotechnology neuroscience physiology For international students: this program is a STEM-designated program, which can qualify you to extend your post-graduation stay in the United States. Classes Coursework Biostatistics Calculus Cell Biology Chemistry General Biology Genetics Resources Major Requirements Schedule of Classes Department Website Concentrations/Tracks Cell and Molecular Biology Ecology and Evolution Integrative Biology Medicine and Health Microbiology and Biotechnology Neuroscience Physiology Minor offered Combined bachelor's + master's degree offered Career Options Common Career Areas Biochemical engineering Botany Conservation biology Education Environmental science Forensics and criminal investigation Marine biology Medical school Nursing Occupational therapy Pharmaceutical research Public health and wellness 96% of Biological Sciences graduates were employed, continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program."
}