{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/computer-science-geography.aspx",
  "title": "\r\n\tComputer Science and Geography | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Computer Science + Geography Computer Science + Geography Mapping solutions in a tech-focused world In DePaul’s B.S. in Computer Science +​ Geography program, you'll learn to combine computational skills and geographical knowledge – as well as critical intellectual, technical and creative skills – to address key issues and develop solutions to problems facing our planet. Through our multidisciplinary approach, you'll learn how to develop software and leverage technology and computer science techniques. You’ll be equipped with tools that incorporate the wide use of Geographic Information Systems (GIS) technologies and the application of computational methods in geography and computer science, as well as other social sciences. Your computer science coursework will focus on technical skill development in these areas: applying formal logic and mathematics developing algorithms and data structures developing software systems at different levels of abstraction fundamental computational problem-solving skills thinking abstractly Your geography courses will train you in: GIS and digital mapping spatial analytics spatial reasoning to explore phenomena, relationships and processes that have spatial patterns and distributions The Jarvis College of Computing and Digital Media (CDM) is located on the Loop Campus, in the heart of Chicago’s technology and business districts, providing you with many opportunities to work professionally with leading software development and GIS technology companies. Many CDM faculty members are working professionals, allowing you to learn firsthand from leaders in the tech industry. Companies hiring our students with backgrounds in Geography and Computer Science include Google, Garmin, ESRI, and various federal government agencies. For international students: this program is a STEM-designated program, which can qualify you to extend your post-graduation stay in the United States. Classes Coursework Computer Systems Data Structures in Java Design and Analysis of Algorithms Earth's Changing Climate Environmental Geography Geographical Information Systems (GIS): Digital Mapping Spatial Analysis for Sustainability Web GIS and Spatial Data Visualization on the Web Resources Major Requirements Schedule of Classes Department Website Career Options Common Career Areas Environmental Planner Geospatial Engineer GIS Analyst GIS Application Developer GIS Data Scientist GIS Software Engineer GIS Technician Spatial Modeler 89% of Computer Science graduates were employed, continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program."
}