{
  "url": "https://www.depaul.edu/admission-and-aid/Pages/room-board.aspx",
  "title": "\r\n\tRoom and Board | DePaul University, Chicago\r\n",
  "content": "Admission & Aid Types of Admission Visit DePaul Tuition Room & Board Scholarships Financial Aid Veteran Student Test Credit & Placement Check Your Application Status Admitted Students Deadlines Immunization Apply Online Request Info Visit Campus DePaul University>Admission & Aid>Room & Board Room & Board Lincoln Park Residence Hall Room Rates View all Lincoln Park residence hall room rates on theHousing website. Loop Residence Hall Option The University Center (UC) offers the following apartment types that include a full kitchen: studio singles, four-bedroom/four-person with two bathrooms, and two-bedroom/four-person with two bathrooms. Residents in the apartment units are not required to purchase a meal plan. In addition, the UC has traditional-style student housing, with quad semi-suites in which students are two to a room and four to a bathroom, and semi-suite deluxes, in which two students share a room and a bathroom. Residents in these units, which have no kitchen, are assigned a UC meal plan. The required meal plan can only be used in the UC building, but students can also purchase additional DePaul meal plans for use in DePaul campus buildings. All residents are provided with a bed, desk and compartmentalized closet, with additional furniture where space permits. The UC features a laundry room, air-conditioning and a dining services area, as well as a fitness center and a covered rooftop terrace garden located on the third floor. UC residents have access to meeting rooms, music practice rooms and an art studio. For current rates, visit theHousing websiteor call(877) 482-2463. Dining Plan Guidelines and Rates Lincoln Park meal plans provide students a set number of meal allotments per quarter, which vary depending on the plan type and are for personal use only. All meal plans are granted three guest meals for the full academic year. Meal plans also provide students with Flex dollars. Flex dollars can be used for purchases outside the main dining areas (such as campus cafés) and can be used when classes are not in session (such as spring break). Flex dollars are made available on the first day of each quarter and do roll over from quarter to quarter, but not from year to year. Any Flex dollars remaining at the end of spring quarter will be forfeited. How does my meal plan work? Meal plan account information is encoded directly onto your DePaul ID Card. Simply present your DePaul ID to the cashier and enjoy all-you-care-to-eat dining. Learn more about our Dining Options and Rates. Other General Fees The U-Pass fee is calculated using the CTA's daily rate of $1.25 per day, plus a DePaul administrative fee of 5.3 percent. This may vary year to year, depending on the number of available CTA service days. For information on eligibility requirements and fare change information, please visit theU-PASS website. Please note:Rates are subject to change without prior notice. Visit theStudent Financial Accounts websitefor more information. ​​"
}