{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/actuarial-science-bs.aspx",
  "title": "\r\n\tActuarial Science (BS) | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Actuarial Science BS Actuarial Science BS Learn to solve problems involving risk Actuaries analyze the financial consequences of risk and uncertainty. As an actuarial science major at DePaul, you will learn to interpret statistics to determine probabilities of accidents, sickness, death and the loss of property from theft and natural disasters. Actuarial science students draw upon mathematics, statistics and financial theory to learn to do the following: Apply the laws of probability and statistics to problems Understand the theory of interest and its applications to the pricing of securities Calculate the financial costs and benefits of insurance for various individuals Design, implement and monitor life contingency models Describe risk management frameworks and identify how specific risks can be quantified Study uncertain future events, concerning risk management and insurance For international students: this program is a STEM-designated program, which can qualify you to extend your post-graduation stay in the United States. Classes Coursework Actuarial Science Applied Regression Analysis Mathematical Finance Multivariable Calculus Principles of Risk and Insurance Probability and Statistics Risk Management Resources Major Requirements Schedule of Classes Department Website Combined bachelor's + master's degree offered Career Options Common Career Areas Actuary Assessor Education Cost estimator Credit analyst Insurance underwriter 88% of Actuarial Science graduates were employed, continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program."
}