{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/information-systems.aspx",
  "title": "\r\n\tInformation Systems | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Information Systems Information Systems Bridge gaps between technology and business An Information Systems degree from DePaul prepares you to use technology to address the operational, tactical and strategic challenges facing businesses, government agencies and non-profit organizations. As an Information Systems major, you will learn the fundamentals of business processes and procedures, hardware, information assurance, software and usability. The Jarvis College of Computing and Digital Media (CDM) is located on the Loop Campus, in the heart of Chicago’s technology and business districts, providing you many opportunities to work professionally with leading companies and organizations. As you earn your Information Systems degree, you’ll be taught by faculty members who are working professionals and active consultants, allowing you to learn firsthand from the industry’s innovators. For international students: this program is a STEM-designated program, which can qualify you to extend your post-graduation stay in the United States. Classes Coursework Advanced Application Development Enterprise Architecture Interactive Design and Prototyping Software Product Management Systems for Cloud Computing and Big Data User-centered Web Design Resources Major Requirements Schedule of Classes Department Website Combined bachelor's + master's degree offered Career Options Common Career Areas Applications programmer Business analyst Information technology consulting Information technology project managing/directing Systems analyst 88% o​f Computing and Digital Media graduates were employed, continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program."
}