{
  "url": "https://www.depaul.edu/about/administration/Pages/ghanem.aspx",
  "title": "\r\n\tSalma Ghanem, PhD | DePaul University, Chicago\r\n",
  "content": "About Rankings Campuses Chicago Events Mission President Administration Distinctions History & Timeline Accreditation & Licensure Apply Online Request Info Visit Campus DePaul University>About>Administration>Salma Ghanem, PhD Salma Ghanem, PhDProvostWebsite​ Salma Ghanem, PhD Provost Salma Ghanem, PhD, was appointed provost on May 7, 2021, after serving as interim provost since July 2019 and acting provost since October 2018. Ghanem joined DePaul in August 2014 as dean of the College of Communication. Prior to joining DePaul, she served as dean of the College of Communication and Fine Arts at Central Michigan University. She also held the position of chair of the Department of Communication at the University of Texas Pan American. In addition to her academic background, she served as a press and information officer for the Press Office of the Egyptian Mission to the United Nations in New York and as a communication specialist with the clinical teaching campus of Texas A&M Health Science Center College of Medicine. Ghanem embraces diversity both personally and professionally. Her intercultural experiences have helped her transcend cultural and racial boundaries. Born and raised in Egypt, she attended the Sacré Coeur Catholic School in Cairo. She is fluent in Arabic and French and has considerable skill in Spanish. Her passion for cultural awareness and interdisciplinary research stems from the fact she herself is an immigrant and was raised by parents who are Egyptian and Dutch. She taught for 15 years at the University of Texas-Pan American, a Hispanic Serving Institution. She also taught in several study-abroad programs in Spain, Egypt, Turkey, Austria and Germany. Ghanem received multiple awards for research and teaching and has published and presented nationally and internationally. Her publication record includes political communication with particular emphasis on the first and second level of agenda setting and framing. She also published and presented research on international media coverage, intercultural communication and advertising in the Middle East. She is the founding editor of theAgenda Setting Journaland a board member of the International Association for Intercultural Communication Studies. She earned a PhD in Journalism from the University of Texas at Austin in 1996."
}