{
  "url": "https://www.depaul.edu/admission-and-aid/types-of-admission/transfer-student/university-center-partnerships/harper-college-university-center/Pages/uc-harper-degree-programs.aspx",
  "title": "\r\n\tDePaul Programs Offered at Harper College University Center  |  University Center at Harper College  |  University Center Partnerships  |  Transfer Student  |  Types of Admission  |  Admission & Aid  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Transfer Student Prepare to Transfer Transferring Your Courses Meet Your Transfer Counselor DePaul Admission Partnership Program University Center PartnershipsUniversity Center at Harper CollegeUniversity Center of Lake County University Center at Harper College University Center of Lake County For Advisors Apply Online Request Info Visit Campus DePaul University>Admission & Aid>Types of Admission>Transfer Student>University Center Partnerships>University Center at Harper College>DePaul Programs Offered at Harper College University Center DePaul Programs Offered at Harper College University Center DePaul has developed customized degree programs tailored to your prior learning, training experiences, interests and intended career path—making sure you can get to where you want to go. We recognize how busy you are. And we’re here to help. Our counselors and advisors will give you the road map and resources you’ll need to successfully complete your DePaul degree. Choose from one of the following DePaul degree programs at Harper College University Center: Undergraduate Bachelor of Arts in Communication and Media College of CommunicationNow enrolling students for Fall The Communication and Media program is designed for students interested in multiple fields of communication, and will prepare you for a wide range of career opportunities in the communication industry. View course preparation information Bachelor of Arts in Professional Studies with a major in Business Administration Professional Studies BA with theSchool of Continuing and Professional StudiesNow enrolling students for Winter and Fall The Business Administration program will help you develop the leadership and managerial skills you need to advance your career. You’ll learn about different functional areas within business, such as technology, project management, marketing and operations. View course preparation information Learn more"
}