{
  "url": "https://www.depaul.edu/admission-and-aid/financial-aid/basics/Pages/external-resources.aspx",
  "title": "\r\n\tExternal Resources  |  Financial Aid Basics  |  Financial Aid  |  Admission & Aid  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Financial Aid Financial Aid BasicsQualify for AidApply for AidCost of AttendanceImportant DatesNotificationsPrivacy & FERPAExternal Resources Qualify for Aid Apply for Aid Cost of Attendance Important Dates Notifications Privacy & FERPA External Resources Types of Aid Receive Aid Maintain Eligibility Manage Costs Repay Loans Resources for... Forms Contact Us Apply Online Request Info Visit Campus DePaul University>Admission & Aid>Financial Aid>Financial Aid Basics>External Resources External Resources Federal Resources Federal Student Aid, an office of the U.S. Department of Education, offers numerous resources to help you and your family learn about the importance of a college education and the many opportunities available to finance your higher education experience. What type of information are you looking for? Types of Aid/Getting Aid My Federal Student Aid Fill out the FAFSA Basic FAFSA info: what it is; how you fill it out Dependency status for FAFSA purposes Determining which parent's info to report How aid is calculated Types of financial aid Who is eligible for federal student aid Pell Lifetime Eligibility Used (LEU) Finding and applying for scholarships Loan interest rates and fees Avoiding financial aid scams Repaying Loans Federal Aid Summary(log into the site and select My Aid to review your Student Aid Dashboard) Loan Repayment Loan Simulator(compares repayment plans) Income-driven repayment plans(e.g., Pay As You Earn, Income-Based) Public Service Loan Forgiveness Loan forgiveness for teachers Total and Permanent Disability Discharge College Prep College preparation checklist: academic and financial prep for K-12 and adult students Special Audiences Resources for parents(tax benefits, support your child, college costs) Aid for military families Graduate school checklist Adult student checklist Going to college in another country State Resources TheIllinois Student Assistance Commission(ISAC)is dedicated to helping Illinois students navigate the process of applying to and entering college. Its website contains important information regarding state grant/scholarship administration, prepaid tuition programs and in-person mentoring. Other Online Resources TheNational Association of Student Financial Aid Administrators (NASFAA)provides student and parents with information and advice about finding and applying for financial aid. The association'sGlossary of Terms for Award Notificationsoffers definitions for terms typically found on award notifications given to current and prospective students. TheNASFAA Legislative Trackeroffers a comprehensive look at legislation introduced in Congress."
}