{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/peace-justice-conflict-studies.aspx",
  "title": "\r\n\tPeace, Justice and Conflict Studies | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Peace, Justice and Conflict Studies Peace, Justice and Conflict Studies Master peace building and conflict resolution In the Peace, Justice and Conflict Studies major, you will critically examine the origins and root causes of violence and conflict, and learn strategies for resolving interpersonal, communal and international conflicts peacefully. You will master the theoretical and intellectual frameworks related to peace building, human rights advocacy and justice development by learning to interpret real life situations and applying strategies for advocacy, consensus-building, partnership development and other intervention tools. You will complete an internship with an organization related to peace, social justice or conflict resolution. Take advantage of DePaul’s Study Abroad programs in order to gain an international perspective on the causes of violence and conflict, as well as strategies for negotiation and resolution. In addition to various combined degree programs, we offer the 3+3 BA/JD, which allows high-achieving first-year undergraduate students to be admitted simultaneously to the College of Liberal Arts and Social Sciences (LAS) and the College of Law (LAW). You’ll complete your first three years in LAS and your final three years in LAW. Classes Coursework International Conflict and Peace-building Social Justice and Social Change Conflict: Intervention, Negotiation and Advocacy Human Rights: Promise and Problematics Social Engagement for Peace and Justice The Theory and Practice of Nonviolent Action Resources Major Requirements Schedule of Classes College Website Minor offered Combined bachelor’s + master’s degree offered Career Options Common Career Areas Ethics Law Social service International relations Humanitarian efforts Political work Education Journalism Public policy 93% of Peace, Justice and Conflict Studies graduates were employed, continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program."
}