{
  "url": "https://www.depaul.edu/academics/Pages/career-success.aspx",
  "title": "\r\n\tCareer Success  |  Academics  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Career Success Career Success Knowledge Rate DePaul graduates are surveyed about their post-graduation destinations at graduation and six months after degree completion. Data are also gathered from public record via LinkedIn. Results presented on this site represent a three-year average of data for graduates whose status was confirmed as of six months after graduation. In some cases, such as with newer programs, fewer than three years of data is presented. Program List Business (Master's) Accountancy (MS) Taxation (MS) Computational Finance (MS) Finance (MS) Entrepreneurship (MS) Human Resources (MS) Management (MS) Supply Chain Management (MS) Sustainable Management (MS) Marketing (MS) Marketing Analysis (MS) Accountancy Applied Economics Business Strategy and Decision Making Custom Entrepreneurship Finance Hospitality Leadership International Business Management Management Information Systems Marketing Marketing Strategy and Planning Real Estate Finance and Investment Strategy, Execution and Valuation Communication Studies (Bachelor's) Communication and Technology Communication Studies Intercultural Communication Computer Science (Bachelor's) Computer Science Mathematics & Computer Science Counseling (Master's) Clinical Mental Health Counseling College Student Development School Counseling Film & Television (Master's) Creative Producing Film and Television Film and Television Directing Interdisciplinary Programs African and Black Diaspora Studies American Studies Catholic Studies Islamic World Studies Latin American and Latino Studies Peace, Justice and Conflict Studies Philosophy Religious Studies Women's and Gender Studies Critical Ethnic Studies Interdisciplinary Studies Liberal Studies Philosophy Public Policy Refugee and Forced Migration Studies Sustainable Urban Development Women's and Gender Studies Modern Languages Arabic Studies Chinese Studies French German Italian Japanese Studies Spanish Arabic Chinese French German Japanese Studies Spanish Psychology (Master's) Psychology Psychology - Clinical (MA/PhD) Psychology - Community (MA/PhD) Psychology - Psychological Science (MA/PhD) Psychology - Industrial/Organizational (MA/PhD) School of Public Service (Master's) International Public Service Nonprofit Management Public Administration Public Service Management Writing and Publishing (Master's) Creative Writing and Publishing Writing and Publishing Insufficient Data There was an insufficient number of responses for this program/major. Please choose another program/major. DePaul Grads are Ready to Succeed DePaul offers you countless opportunities to do extraordinary things that make you stand out from the rest. Whether it's landing your ideal job or getting into your top grad school choice, we'll help make it happen. The information is based on data gathered fromXout ofYgraduates.Learn More › Due to an insufficient number of responses for this program/major, career success results represent the combined results of allinterdisciplinary programs.Learn More » Career Success Rate Bachelor'sDegree Recipients Employed, continuing education or pursuing other goals within six months of graduation. Learn by Doing of graduates did an internship during their time at DePaul Internship Opportunities 17,000+ internships posted in Handshake annually What DePaul Grads Earn Salary data is self-reported by a subset of graduates who have chosen to share this information with us. Interquartile Range: Median Salary Putting Degrees to Work DePaul graduates leave the university prepared to succeed and achieve in a variety of fields. We are proud of the success achieved by DePaul graduates. Where DePaul Grads Work Here's a sample list of employers who have hired DePaul graduates. What DePaul Grads Do Here's a sample list of position titles for new DePaul graduates. Top Employers Recruit DePaul Grads Employers know that hiring DePaul means hiring graduates with hands-on experience who are ready to work and prepared for success 98% of the largestpubliclyheld companies. 75% ofprivatelyheld companies. 90% of the'Best Places to Work'.(2018) 44,000+ Full-time jobs were posted in the Handshake career services platform last year Take the Next Step Join our mailing list to learn more about DePaul and what you're interested in here. Request InfoVisitApply"
}