{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/american-studies.aspx",
  "title": "\r\n\tAmerican Studies | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>American Studies American Studies Immerse yourself in American culture and history American Studies majors will examine the breadth and diversity of the American experience. American Studies is an interdisciplinary program that integrates the study of literature, history, geography, media, politics, popular culture, art and religion in order to critically analyze American society, culture, institutions and intellectual traditions. As an American Studies major, you’ll be encouraged to question what constitutes American culture, and how cultural expressions reflect and reveal American values, beliefs, prejudices, pleasures and perceptions. American Studies majors will gain competency in American cultural studies by mastering the theoretical and intellectual frameworks of their concentrations and by learning to interpret and analyze primary documents. Students in other interdisciplinary programs find American Studies a common double major or minor when combined with majors such as history, communication, anthropology, English, political science or sociology. Classes Coursework The American Experience Urban Politics Race and Ethnic Relations The Material Culture of Modern America Archeology of Cities American Economic History Urban Planning American Popular Culture Journalism Law and Ethics Resources Major Requirements Schedule of Classes College Website Concentrations/Tracks Comparative Race and Ethnic Studies Material Culture and the Built Environment Politics, Institutions and Values Popular Culture and Media Studies Social and Literary Movements Minor offered Combined bachelor’s + master’s degree offered Career Options Common Career Areas Public policy Social service Political work Education Historic preservation Art conservation Governmental work Urban planning/development Community leadership 93% of American Studies graduates were employed, continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program."
}