{
  "url": "https://www.depaul.edu/admission-and-aid/financial-aid/basics/Pages/default.aspx",
  "title": "\r\n\tFinancial Aid Basics  |  Financial Aid  |  Admission & Aid  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Financial Aid Financial Aid BasicsQualify for AidApply for AidCost of AttendanceImportant DatesNotificationsPrivacy & FERPAExternal Resources Qualify for Aid Apply for Aid Cost of Attendance Important Dates Notifications Privacy & FERPA External Resources Types of Aid Receive Aid Maintain Eligibility Manage Costs Repay Loans Resources for... Forms Contact Us Apply Online Request Info Visit Campus DePaul University>Admission & Aid>Financial Aid>Financial Aid Basics Financial Aid Basics “Financial aid” is a broad term that encompasses a variety of options, from gift aid that you don’t have to repay and loans that you do need to repay, to employment programs like work-study or assistantships. Review thetypes of aid and their requirements. The types and amounts of aid you can receive are based on many factors, including your citizenship status, year in school, cost of attendance, and financial need. You mustfile a FAFSA application yearlyto be considered for aid on an annual basis. Financial need calculation is Financial Need equals Cost of Attendance (COA) minus Student Aid Index (SAI) minus other financial assistance (OFA). Financial Need = COA - SAI - OFA Applying for and accepting financial assistance is a partnership between you, Federal Student Aid and DePaul. In order to continue to receive aid, you mustMaintain EligibilityandComply with Terms and Conditionsof receiving financial aid. Get started You’ll automatically be considered for most types of aid when you complete the Free Application for Federal Student Aid (FAFSA).Apply for Aidlists all the steps to complete the application. Pay close attention toImportant Dates— many aid programs operate on a first-come, first-served basis. We may need to ask you for more information once you have completed your application. We will contact you if this is the case, but you can also see any required to-do items on Campus Connect at any time. Receive my financial aid offer Once we have your application and any required documentation, our team begins the award process. We will notify you when we’ve determined your award offer. You canmonitor your awardsand your account through the student portal,Campus Connect. In most cases, your aid will be credited to your account — a process called disbursement — at the start of each term. Learn more about how you’llreceive financial aid funds. College Cost Transparency Initiative We are committed to ensuring transparency and clarity around financial aid offers. This means that our financial aid offers contain: Sticker price Aid types and sources What you pay How to renew your aid Keep my information safe TheFamily Educational Rights and Privacy Act of 1974 (FERPA)covers the privacy of student records maintained by institutions such as DePaul. FERPA ensures that you can inspect your own records, correct any incorrect information, and determine what information, if any, that DePaul may release about you.Learn more:Watch Financial Aid TV videos"
}