{
  "url": "https://www.depaul.edu/admission-and-aid/types-of-admission/transfer-student/Pages/course-review-documentation.aspx",
  "title": "\r\n\tCourse Review Supporting Documentation  |  Transfer Student  |  Types of Admission  |  Admission & Aid  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Transfer Student Prepare to Transfer Transferring Your Courses Meet Your Transfer Counselor DePaul Admission Partnership Program University Center Partnerships For Advisors Apply Online Request Info Visit Campus DePaul University>Admission & Aid>Types of Admission>Transfer Student>Course Review Supporting Documentation Course Review Supporting Documentation ​If your course has no direct articulation, but is marked as “4RVW,” this indicates that the course is transferable for DePaul credit, but is awaiting a decision on an exact match to a DePaul course. In this case, credit is posted to your record, but no direct equivalence has been made. For this reason, we ask that you provide supporting documentation to assist with this process. Once the equivalent course is determined, your record will be modified to include the updated information. The supporting documentation to be provided is as follows: Course Description Course Itinerary Course Syllabus Verification of Degree Applicability Documentation Defined Course Description Description of your course as described by the institution's website or course catalog with any course co-requisites and prerequisites clearly defined. Course Itinerary Schedule of the daily in-class and out-of-class activities, lectures, labs, papers, examinations, projects, book chapters, and all written assignments completed throughout the course of the term. Course Syllabus Course material required (textbooks, software, handouts, specialized equipment) Course description (catalog description preferred) List of co-requisites and prerequisites Credit hours Total earned Number of lecture hours/week Number of lab hours/week Number of lab weeks Outline of course objectives/outcomes Instructional methodologies (lecture, laboratory, observation, field trips, group discussion) Method of grading (pass/fail, letter grade) Outcome evaluation techniques and percentage (writing assignments, projects, class participation, tests, attendance, presentations) Verification of Degree Applicability Page(s) within the course catalog/bulletin showing your course is directly applicable towards a transferable degree (A.A., A.S., or any Bachelor's degree) and is not only applicable as an open elective towards such degree during the time in which the course was completed. Page(s) within the course catalog/bulletin showing your course is applicable towards general education during the time in which the course was completed. A formal letter from the registrar explicitly delineating the applicability of your course to either a transferable degree or the institution's general education requirements during the time in which the course was completed. This letter must be signed by the registrar or a comparable university official.(Only one of these three options is required)."
}