{
  "url": "https://www.depaul.edu/admission-and-aid/test-credit-and-placement/online-placement-process/Pages/exemption-grid.aspx",
  "title": "\r\n\tExemption Grid  |  Online Placement Process  |  Test Credit & Placement  |  Admission & Aid  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Admission & Aid Types of Admission Visit DePaul Tuition Room & Board Scholarships Financial Aid Veteran Student Test Credit & PlacementCredit Given by ExamOnline Placement Process Credit Given by Exam Online Placement Process Check Your Application Status Admitted Students Deadlines Immunization Apply Online Request Info Visit Campus DePaul University>Admission & Aid>Test Credit & Placement>Online Placement Process>Exemption Grid Exemption Grid ​​​​​​​​​​​​​​​​​Exemptions for the Placement Process All Students (Freshman, Transfer, Adult and Current Students) If you are submitting advanced placement or other sources of college credit, these credits will be evaluated and, if appropriate, applied toward your degree. While it may be possible that you would not need to take the course into which you placed, the placement results will aid your advisor in better understanding your mastery of concepts included in prerequisite math courses. This information will also be beneficial to you in your approach to your first term at DePaul as you can review math concepts that may present a greater challenge or those you have not studied for a while. (1) SCPS does not exempt any students from taking the writing exam and does not require students to take a foreign language placement. School of Continuing and Professional Studies (SCPS) students who want to demonstrate proficiency in a foreign language should read our form to learn more . In addition, SCPS BAIFA students are not required to take the math placement exam. SCPS BAGB, BAC and BADA students are required to take it. Students with Transfer Credit Students transferring in math credit will be exempt from the Math Placement Process as outlined in the above grid. Transfer students who intend to inter-college transfer, to double major in another program, or to earn a dual degree in a different program with higher math requirements than the one outlined by their current primary major are urged to take the math placement test in order to measure readiness for the more rigorous math in store for them. Your transfer credit must be noted on your DePaul record for you to be exempt. All external credit should be sent to the Office of Admission. *CSH majors requiring Calculus are: Actuarial Science, Biology, Chemistry, Environmental Science, Mathematics, Math/Computer Science and Physics."
}