{
  "url": "https://www.depaul.edu/distinctions/Pages/fishing.aspx",
  "title": "\r\n\tGone Fishing  |  Distinctions  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Gone Fishing In 2008, Windsor Aguirre and a team of biology students snagged a large piece of the evolutionary puzzle. Today, Professor Aguirre’s specimens shed new light on the evolutionary history of freshwater fishes. His research gives students a greater perspective on biology and the world around them. In April 2012, a new species of suckermouth armored catfish was announced in National Geographic—a discovery made by Windsor Aguirre, assistant professor, Department of Biological Sciences. As a field researcher, Aguirre explores how fish species work in nature, how they differ based on ecological preferences, and how they’ve evolved. “I’m asking pretty fundamental questions,” he says. “What factors facilitate or constrain the origin of a species? How do species actually form?” In Alaska, he’s studying the evolutionary diversification of three-spined stickleback fish. In South America, he’s tracing the evolutionary history of the common tetras by using molecular markers to create a phylogeny (a diagram based on patterns of differences in DNA sequences). Discovering new species On a trip to Ecuador in 2008, while collecting specimen in the Santa Rosa River, Aguirre pulled in a few fish he couldn’t readily identify. “I sent photos to Jon Armbruster, a taxonomist at Auburn University, who eventually determined that we were dealing with a new species, which he namedCordylancistrus santarosensis. Finding a new species was certainly exciting, but in some ways not that surprising: this region of the world is so little explored that scientists don’t know how many species of fresh water fish exist or how they’re distributed. We don’t even know which species of fish occur in which rivers.” This particular discovery turned out to be important for a few reasons. First, the species might be a “missing link,” as the 2.8-inch-long fish lacks armored plates on the sides of its head, which suggests it might connect the species Cordylancistrus (plated) and the genus Chaetostoma (not plated). “I’m not a catfish specialist,” Aguirre explains, “but the new species is important biogeographically. It’s in a genus that wasn’t known to be in this region and it’s an intermediate between two genera; in theory, this specimen provides a little more information about the evolution of suckermouth catfish. Now, specialists have a new piece of a puzzle, and that’s always interesting.” The new species is yet more evidence of just how much in nature is still unknown. “We’ve never had as much information as we do now, but we’re losing habitats and species at unprecedented rates.” Windsor Aguirre, assistant professor at DePaul University “For some species, a huge amount of research has been done, so it’s tempting when one sees a model species—say, for example, zebra fish—to think ‘we must know this much about every species.’ But that’s not true,” Aguirre says. “New species are discovered every year. A sample is collected, someone describes it, it’s put in a museum, and that’s all we know. For most species, we know nothing more than their names. We don’t know what they eat, or how much variability is in their population, or where they fit in the evolutionary tree of life. Getting this information is really, really hard work.” In developing countries, there’s an urgency to find and describe species before they disappear. “The areas with the greatest biodiversity often also have great poverty,” says Aguirre. “As countries exploit their natural resources, the loss of environment leads to the extinction of animal populations. We’re losing species before we even know they exist.” “That’s why I say it’s the best and worst time to be a biologist: we’ve never had as much information and scientific tools as we do now, but we’re losing habitats and species at unprecedented rates. The challenge is to conserve as much of the Earth’s biodiversity as possible, while still allowing governments in developing countries to do what’s necessary to combat poverty.” Why Study Fish? “If you’re interested in questions related to evolution, fish are a great group to study,” Aguirre recently told DePaul Newsline. “There are more types of fish than there are types of mammals, amphibians, reptiles, and birds combined.” “It’s also a question of ease. The species I tend to work with are small, so it’s easier logistically than if you’re studying elephants.” ■ Visit Professor Aguirre’s website » ReadNational Geographic’s announcement about his findings » Learn what makes DePaul Distinctive Global Health and Human Rights Find out why researchers are working to eliminate health disparities around the world. Protein Puzzles Discover how studying a protein may lead to curing and preventing Alzheimer’s disease."
}