{
  "url": "https://www.depaul.edu/distinctions/Pages/protein-puzzles.aspx",
  "title": "\r\n\tProtein Puzzles  |  Distinctions  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Protein Puzzles In his research, Eric Norstrom searches for proteins complicit in the development of Alzheimer’s disease What causes Alzheimer’s disease? And can that process be stopped in its tracks? Those questions drive Eric Norstrom in his work at DePaul. A neurobiologist and assistant professor in the College of Science and Health, Norstrom studies the molecular function of amyloid precursor protein (APP). While APP plays an important role in normal brain functioning, its interaction with certain other proteins can form beta amyloid peptide, the main component of the brain deposits that characterize Alzheimer’s disease. Norstrom is looking for these “other proteins” that cause APP to take a wrong turn. “The more we know about that process, the better the odds of manipulating it. By the time Alzheimer’s presents, there’s already been a lot of damage. But if we could detect the process early enough, maybe we could intervene before it’s too late.” Eric Norstrom, biology professor, DePaul University “A lot of scientists do Alzheimer’s research, so I’ve had to puzzle myself into the right niche,“ Norstrom says. “Small labs can focus on novel proteins that a large lab wouldn’t attack. Of course, I’d love to discover a protein interaction that could bias metabolic pathways and, thereby, slow or cure Alzheimer’s. But to be a scientist, you have to enjoy the race, not just the finish line.” A Passion For TEACHING AND RESEARCH Norstrom joined DePaul after finishing his PhD and post-doctoral research at the University of Chicago, where he worked on Alzheimer’s and prion diseases, such as mad cow disease, in which a protein aggregates into large, sometimes toxic and infectious structures. “There aren’t many places like DePaul because we take the balance of both research and teaching seriously, and I have a passion for both. People think scientists use arcane knowledge to come up with great ideas. But, at its core, science is a process, and a fairly simple one: Anyone can understand it, and anyone can do it. You ask a question then develop a way to test that question while trying to control for random events. The answer fits into a bigger whole. Put all the answers together in the right way, and you can go to the moon, you can cure cancer or Alzheimer’s.” Norstrom is also working with Alzheimer’s researchers at Rosalind Franklin University of Medicine and Science. Through theAlliance for Health Sciences, the universities have an agreement to share knowledge and resources, and Norstrom has received a collaborative grant. “Our expertise is complementary,” Norstrom says. “I know how proteins work, and they understand animal models and other technical areas of this type of research. Everything is dynamic right now—this is an exciting time to be in the sciences at DePaul.” ■ Learn what makes DePaul Distinctive S.O.S. for At-Risk Teens Learn how our Success Over Stress program helps at-risk teens reduce stress, anxiety and aggression. Global Health and Human Rights Find out why researchers are working to eliminate health disparities around the world."
}