{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/english.aspx",
  "title": "\r\n\tEnglish | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>English English Deepen your analytical reading, writing and critical thinking skills In the English program, you’ll study the major authors, works, genres and literary movements in the British and American traditions, approaching these texts both analytically and historically. As an English major, you’ll develop your skills in analysis, interpretation and writing by studying British and American literatures, as well as important works in English from around the world. Our program provides English majors with a well-rounded education where you’ll develop critical and creative thinking skills by examining texts analytically, historically and from multiple points of view. You’ll also develop a unique voice, express yourself clearly in speaking and writing, and become an articulate interpreter and contributor to your culture. If you are interested in becoming a teacher, the English department partners with the College of Education to award teaching degrees. In addition to a variety of combined degree programs for English majors, we offer a combined bachelor’s + master’s degree in English as well as a combined bachelor’s + master’s degree in English and Secondary Education English degree. Both programs allow you to complete a bachelor’s degree and a graduate degree in as few as five years. We also offer the 3+3 BA/JD Program, which allows high-achieving first-year undergraduate students to be admitted simultaneously to the College of Liberal Arts and Social Sciences (LAS) and the College of Law (LAW). You’ll complete your first three years in LAS and your final three years in LAW. Classes Coursework Reading and Writing Poetry The American Novel Studies in Shakespeare Writing in the city Latino/a Literature Major Authors: Jane Austen Popular Literature: Harry Potter Science and Nature Writing Resources Major Requirements Schedule of Classes College Website Concentrations/Tracks Creative Writing Literary Studies Creative Writing minor offered Literature minor offered Combined bachelor’s + master’s degree offered Career Options Common Career Areas Advertising Business Creative writing Editing Education Law Publishing Research 93% of English graduates were employed, continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program."
}