{
  "url": "https://www.depaul.edu/admission-and-aid/types-of-admission/transfer-student/depaul-admission-partnership-program/Pages/default.aspx",
  "title": "\r\n\tDePaul Admission Partnership Program  |  Transfer Student  |  Types of Admission  |  Admission & Aid  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Transfer Student Prepare to Transfer Transferring Your Courses Meet Your Transfer Counselor DePaul Admission Partnership ProgramRecent Recent University Center Partnerships For Advisors Apply Online Request Info Visit Campus DePaul University>Admission & Aid>Types of Admission>Transfer Student>DePaul Admission Partnership Program DePaul Admission Partnership Program ​​Prove yourself in community college. Get guaranteed admission here. DePaul’s Admission Partnership Program (DAPP) guarantees admission to highly qualified students earning an associate degree from a community college and looking to complete a bachelor’s degree at DePaul. With the assistance of a dedicated transfer admission counselor, students are guided toward which courses to take prior to transfer—saving both time and money in the transfer process. Students are eligible to participate in DAPP by meeting the following requirements: DAPP is only for community college transfers. Students who join must do so before completing 24 semester (36 quarter) hours of college level course work and plan to be enrolled at the community college for at least two full semesters before transferring to DePaul. Attend (or plan to attend) a community college within the contiguous United States Achieve good academic standing in all college course work (minimum cumulative 2.0/4.0 GPA) Maintain continuous enrollment of at least two (2) courses per semester (not including summer) at the community college for no more than a period of three (3) years Plan to be enrolled at a community college for at least two full semesters from the date of joining DAPP Commit to meeting with a Transfer Admission Counselor each semester prior to transferring to DePaul Join Early to Enjoy the Benefits To enjoy all of the benefits of DAPP, we encourage you to join before you start classes at your community college or during your first semester (but definitely before your third semester). Simply schedule an appointment with a Transfer Admission Counselor and indicate in the appointment form that you are interested in DAPP. During your appointment, the counselor will explain the program and review your eligibility. Upon approval, the counselor will send you a DAPP Participation Form. Complete, sign, submit, and you’re done. FAQ What community college do I have to attend to join DAPP? Any, really. DAPP is now available to ALL community college transfer students within the United States (and US territories). Do I have to complete my associate degree? No, however to optimize the benefits of the DAPP program, completion of an associate degree is highly recommended. I am not currently at a community college—can I still join DAPP? DAPP is only for community college transfers. Students who join must do so before completing 24 semester (36 quarter) hours of college level course work and plan to be enrolled at the community college for at least two full semesters before transferring to DePaul. Are all programs/majors at DePaul available for DAPP? Students interested in majors within the School of Continuing and Professional Studies, Theatre School, or the School of Music are not eligible to participate in DAPP due to their unique admission requirements. Do I need to be full-time at my community college to be in DAPP? No. You can be a DAPP participant for up to three (3) years (or six semesters). You can take classes at your community college at your own pace so long as you remain continuously enrolled (excluding summers) and are make good satisfactory progress. Can I change my major while in DAPP? When you join DAPP, you will be asked to choose a major so that a transfer plan can be outlined for you. If you change that major, the plan will have to change—sometimes significantly. You can discuss with your Transfer Counselor how your desire to change majors might affect your DAPP eligibility. What scholarships or financial aid are available to DAPP students? All students who meet the eligibility requirements at the time of transfer are eligible for up to a $20,000/year DAPP scholarship. The DAPP scholarship can be combined with the Phi Theta Kappa (PTK) and Chicago Star Scholarship, if eligible. Visit theScholarships pagefor more information on available transfer scholarships, orOneDePaulfor financial aid guidance. Contact DAPP Staff Contact us with questions at(312)362-8300andtransferadmissions@depaul.edu."
}