{
  "url": "https://www.depaul.edu/admission-and-aid/financial-aid/basics/Pages/understand-cost-of-attendance.aspx",
  "title": "\r\n\tCost of Attendance  |  Financial Aid Basics  |  Financial Aid  |  Admission & Aid  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Financial Aid Financial Aid BasicsQualify for AidApply for AidCost of AttendanceImportant DatesNotificationsPrivacy & FERPAExternal Resources Qualify for Aid Apply for Aid Cost of Attendance Important Dates Notifications Privacy & FERPA External Resources Types of Aid Receive Aid Maintain Eligibility Manage Costs Repay Loans Resources for... Forms Contact Us Apply Online Request Info Visit Campus DePaul University>Admission & Aid>Financial Aid>Financial Aid Basics>Cost of Attendance Cost of Attendance The Office of Financial Aid establishes a standard cost of attendance budget to calculate your estimated educational costs. This represents typical costs for students during the nine-month academic year based on anticipated enrollment, dependency status, and living arrangements (on-campus, off-campus or with parents). What’s Included Direct costs (items charged by DePaul): tuition, fees, and estimated living expenses (on-campus housing and food) Indirect costs (items not paid to DePaul), based on estimates for the Chicago area:books, supplies, course materials, and equipmentestimated living expenses (off-campus housing and food),transportation, andmisc. personal expenses. books, supplies, course materials, and equipment estimated living expenses (off-campus housing and food), transportation, and misc. personal expenses. Food estimates are based on 21 meals per week. On-campusfood plans vary. Estimated Expenses for Undergraduate Students These budgets represent estimated average costs for undergraduate students attending full time during the academic year. Your actual costs may vary depending on your academic program, course load, housing arrangements, food plan choice, and individual circumstances. Students that apply for financial aid can view their own Cost of Attendance in Campus Connect. 2024-2025 Estimated Cost of Attendance (COA) These expenses are based on 2024-2025 estimated cost of attendance. To calculate your estimated cost of attendance, look up yourtuition,mandatory fees, and add them together with each of the categories above. Please visit theHealth Insurance pagefor important information about the plan. Health insurance cost is part of Miscellaneous Personal Expenses. Estimated Expenses for Graduate & Professional Students These budgets represent estimated average costs for graduate or professional students attending full time during the academic year. Your actual costs may vary from the standard cost of attendance reflected below, depending on your academic program, course load, housing arrangements and individual circumstances. Students that apply for financial aid can view their own Cost of Attendance in Campus Connect. 2024-2025 Estimated Cost of Attendance (COA) These expenses are based on 2025-2026 estimated cost of attendance. To calculate your estimated cost of attendance, look up yourtuition,mandatory fees, and add them together with each of the categories above. Please visit theHealth Insurance pagefor important information about the plan. Health insurance cost is part of Miscellaneous Personal Expenses."
}