{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/communication-technology.aspx",
  "title": "\r\n\tCommunication and Technology | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Communication and Technology Communication and Technology Practice and refine digital communication skills As a Communication and Technology major, you’ll learn to live and work in the modern digital environment. You’ll be given a foundation of theoretical knowledge, critical analysis and ethical awareness of how processes of communication affect and are affected by technology. Communication and Technology majors will take courses that provide you with interdisciplinary knowledge, experiences, and practical skills that link technology and communication. You will have access to DePaul’s green screen studio, control room, editing suites, data analytics technology and digital equipment facility. We also offer the 3+3 BA/JD Program, which allows high-achieving first-year undergraduate students to be admitted simultaneously to the College of Communication (CMN) and the College of Law (LAW). You’ll complete your first three years in CMN and your final three years in LAW. Classes Coursework Communication, Technology and Society Communication Law & Ethics in a Digital Age Introduction to Digital Media Skills Digital Writing Resources Major Requirements Schedule of Classes Department Website Combined bachelor's + master's degree offered Career Options Common Career Areas Account management Copywriting Event planning Media planning/buying Media relations Risk and crisis management Sales management Social media 94% of Communication and Technology graduates were employed, continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program."
}