{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/mathematics-computer-science.aspx",
  "title": "\r\n\tMathematics and Computer Science | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Mathematics and Computer Science Mathematics and Computer Science Develop math reasoning and computing solutions As a Mathematics and Computer Science major, you will take coursework in both the Jarvis College of Computing and Digital Media and the College of Science and Health. Courses will prepare you for a profession in a variety of areas in computer science, graphics, data analysis, computer programming, and applied or discrete mathematics. The Mathematics and Computer Science undergraduate major is designed to prepare you for graduate study in various areas of computer science, including theoretical computer science, graphics, data analysis, artificial intelligence, and computational methods in applied mathematics. It is also designed to prepare you to compete for theoretical, complex jobs in computer software development. For international students: this program is a STEM-designated program, which can qualify you to extend your post-graduation stay in the United States. Classes Coursework Artificial Intelligence Computational Mathematics Computer Vision Data Analysis Graphics Linear Algebra Programming Theory of Computation Resources Major Requirements Schedule of Classes Department Website Minor offered Combined bachelor's + master's degree offered Career Options Common Career Areas Consulting Data analysis Education Information analysis Programming Software development Systems administration 89% of Mat​hematics and Computer Science graduates were employed, continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program."
}