{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/applied-diplomacy.aspx",
  "title": "\r\n\tApplied Diplomacy | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Applied Diplomacy Applied Diplomacy Create bold diplomacy solutions, today and beyond DePaul’s bachelor degree in Applied Diplomacy program will provide you with a deep understanding and appreciation for traditional and non-traditional approaches to the field. As part of the recently launched Grace School of Applied Diplomacy, the program will teach you how the work of 21st century diplomacy is informed by the contributions of multiple voices and perspectives through the eyes of both scholars and practitioners. As you work toward your degree in diplomacy, you’ll gain a foundational understanding of the theory and practice of diplomacy in order to engage real-world challenges posed by social and political factionalization, conflict and competing interpretations of individual responsibility, civic duty and national identity. We offer 10 concentrations for you to choose from to prepare you for a variety of jobs and careers. Each concentration will provide you with a degree in diplomacy that has a foundation upon which to build your area of specialization. Citizens from virtually every nation call the city of Chicago home. DePaul’s urban location in this global city will give you the chance to explore, learn and experience the interconnectivity of the world. Classes Coursework Citizen Diplomacy in the 21st Century Comparative Urbanism Diplomacy: Its Past and Present Diplomacy: Its Present and Future Introduction to International Relations Introduction to Political Economy Leadership and Diplomacy Transprofessional Mediation and Negotiation Resources Major Requirements Schedule of Classes College Website Concentrations/Tracks Diplomacy and Critical Theory Diplomacy and International Law Diplomacy and International Political Economy Diplomacy and International Relations Diplomacy and Religion Diplomacy and the Arts Diplomacy, Culture and Identity Diplomacy, NGOs and Peacebuilding Environmental Diplomacy History of Diplomacy Language and Diplomacy Urban Diplomacy Career Options Common Career Areas Community organizing Diplomatic translator Domestic or international activism Education/advanced studies Foreign service International business or consulting International or domestic NGO work Municipal government ​Preparation for law school Get more information Complete the form below to receive more information about this degree program."
}