{
  "url": "https://www.depaul.edu/admission-and-aid/financial-aid/types-of-aid/Pages/grants.aspx",
  "title": "\r\n\tGrants  |  Types of Aid  |  Financial Aid  |  Admission & Aid  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Financial Aid Financial Aid Basics Types of AidScholarshipsFederal LoansPrivate LoansGrantsMilitary & Veteran BenefitsAssistantshipsStudy AbroadWork-Study Scholarships Federal Loans Private Loans Grants Military & Veteran Benefits Assistantships Study Abroad Work-Study Receive Aid Maintain Eligibility Manage Costs Repay Loans Resources for... Forms Contact Us Apply Online Request Info Visit Campus DePaul University>Admission & Aid>Financial Aid>Types of Aid>Grants Grants ​​​​​​​​​​​​​​​​​​​​​​​​​​​Grants are: gift aid that does not need to be repaid awarded based on financial need as determined by theFree Application for Federal Student Aid (FAFSA) measured by lifetime limits Grants disburse to your DePaul student account and will first be applied towards amounts owed to the University. Federal Pell Grant TheFederal Pell Grantis awarded to eligible undergraduate students working on their first bachelor’s degree program who demonstrate financial need. You are automatically considered for it when you complete the FAFSA. The maximum award amount varies – based on eligibility amounts calculated by Federal Student Aid. If you enroll full time during the Autumn, Winter, Spring and Summer quarters, you will receive one-third of your Pell Grant each quarter. If you enroll part time or for only part of the academic year, your award will be prorated according to federal regulations. Starting in 2024-2025 the federal Pell calculation will be based on enrollment intensity. Awards will vary based on estimated college costs and the number of credit hours you are enrolled in. Federal Pell Grantlifetime eligibilityis limited to 12 semesters or the equivalent. State of Illinois Monetary Award Program (MAP) TheMAP grantis awarded to undergraduate Illinois residents attending an in-state college or university. MAP grants are based on need and are funded by the Illinois State Assistance Commission (ISAC), an agency of the State of Illinois. You are automatically considered for it when you complete the FAFSA before the ISAC cut-off date. We recommend that you file your FAFSA as soon as possible after October 1st to be considered for the MAP Grant. If you file your FAFSA after the cut-off date, which ISAC announces each year, you may not receive MAP funding even if you are eligible based on your application. MAP regulations require you to enroll for 15 credit hours per quarter to receive the full award. If you enroll during the Autumn, Winter and Spring quarters, you will receive one-third of the award during each quarter. If you enroll part time or for only part of the academic year, your award will beproratedaccording to ISAC rules. MAP awards are only granted for up to 135 credit hours, after which a student is no longer eligible. The award is restricted to tuition and mandatory fees. Retention of Illinois Students & Equity (RISE) Act and Alternative Application for Illinois Financial Aid TheRetention of Illinois Students & Equity (RISE) Actallows eligible undocumented students who are ineligible from federal financial aid to apply for all forms of state financial aid. TheAlternative Application for Illinois Financial Aidprovides a pathway for these students to apply for Monetary Award Program (MAP) grants, the state's largest need-based grant program for low-income college students. DePaul Grant The DePaul grant is awarded to eligible undergraduate students who demonstrate financial need. You are automatically considered for it when you complete the FAFSA. Awards are based on the time of application and the availability of funds. The maximum award amount varies according to need. Federal Supplemental Grant (SEOG) Federal Supplemental Opportunity Grant (FSEOG)is a program for undergraduate students working on their first bachelor’s degree, are eligible for a Federal Pell Grant, and who demonstrate exceptional need. DePaul University defines students with exceptional need as students with a zero Expected Family Contribution (EFC)/Student Aid Index (SAI). The EFC/SAI is calculated from the information provided on the FAFSA. Funds are limited and are awarded to students on an annual basis which are not guaranteed from year to year. The maximum award amount varies. Federal TEACH Grant The Teacher Education Assistance for College and Higher Education (TEACH Grant)is a federal grant program for undergraduate and graduate students who plan to teach, providing up to $4,000 per year. Students who accept the TEACH Grant agree to serve as a full-time teacher in a high-need field in a public or private elementary or secondary school that serves low-income students. As a recipient of a TEACH Grant, you must teach for at least four academic years within eight calendar years of completing your program of study for which you received a TEACH Grant. Before completing the TEACH Grant Consideration Request, you should fully understand the eligibility and service requirements of this grant. Read the information below closely. The Federal TEACH grant will convert into a Federal Unsubsidized Loan if you do not fulfill the teaching service requirement. You are committing to teaching in a high-need subject area in a school serving low-income students. If you are unsure about this commitment, you should contact the Office of Financial Aid to discuss other aid resources. If you do not fulfill the terms of the Agreement to Serve or Repay (Agreement), you will incur federal unsubsidized loan debt. This is in addition to other federal student loans you may have borrowed. Interest on TEACH Grants converted into loans will be incurred from the date the grant(s) was disbursed, NOT from the date it converts to a loan. The interest rate will be the fixed rate in effect at the time the TEACH Grant was disbursed. Eligibility Requirements for Undergraduate and Graduate Students Have a cumulative GPA of 3.250 or higher. All eligible registered courses for the Federal TEACH program must be taken for a letter grade; “Pass/Fail” grades cannot be calculated into a qualifying cumulative GPA. Be accepted into and maintain enrollment in one of the approvedTEACH Grant-eligible programs. Undergraduate students must have successfully completed 44 quarter hours or 30 semester hours for transfer students. If you wish to apply for consideration for this grant, you will need to: Review theFederal TEACH Grant websitefor additional important information. Complete aFree Application for Federal Student Aid (FAFSA)and monitor your To-Do list in Campus Connect. You may be required to submit additional documentation. Complete, sign, and submit theTEACH Grant Request Formto the DePaul Office of Financial Aid. Complete the onlineAgreement to Serve and Repay (Agreement). Complete theFederal TEACH Grant Entrance Counselingrequirement. Review the TEACH FATV playlists. Teaching Obligations Potential Repayment Obligation Iraq and Afghanistan Service Grant Iraq and Afghanistan Service Grantis a program awarded to eligible undergraduate students working on their first bachelor’s degree program whose parent or guardian was a member of the U.S. armed forces and died as a result of performing military service in Iraq or Afghanistan after the events of 9/11. Students must be eligible for a Federal Pell Grant and must have been younger than 24 years old or enrolled at least part-time at a college or career school at the time of the parent’s or guardian’s death. Awards vary.Lifetime eligibilityis limited to 12 semesters or the equivalent. Other State Grants and Scholarship Programs Most states have a variety of state grants and scholarship programs. We recommend you research these opportunities in the state government where you reside (permanent residence) for eligibility criteria and application procedures."
}