{
  "url": "https://www.depaul.edu/admission-and-aid/financial-aid/forms/Pages/appeal.aspx",
  "title": "\r\n\tAppeal Forms  |  Forms  |  Financial Aid  |  Admission & Aid  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Financial Aid Financial Aid Basics Types of Aid Receive Aid Maintain Eligibility Manage Costs Repay Loans Resources for... FormsLoan FormsAppeal FormsTEACH Grant Forms Loan Forms Appeal Forms TEACH Grant Forms Contact Us Apply Online Request Info Visit Campus DePaul University>Admission & Aid>Financial Aid>Forms>Appeal Forms Appeal Forms ​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​Special Circumstance Appeal Form Appeal your financial aid due to a substantial change in income, expenses or circumstances by selecting the appropriate appeal type in our online special circumstance form. You must submit all required documentation before we are able to review your appeal. 2025-26 Special Circumstance Appeal for Fall 2025, Winter 2026, Spring 2026 and Summer 2026 The 25-26 Special Circumstance Appeal form will be available in March 2025. 2024-25 Special Circumstance Appeal for Fall 2024, Winter 2025, Spring 2025 and Summer 2025 Only use this form to submit an appeal for Fall 2024, Winter 2025, Spring 2025 or Summer 2025. Clickhereto access the online form using your BlueKey login. Satisfactory Academic Progress (SAP) Appeals If you have extenuating circumstances that prevented you from meeting the minimum SAP requirements, you may appeal for the reinstatement of your financial aid eligibility. Current Students By the deadline established in thisSAP FAQ, complete a SAP appeal inCampus Connect. Returning and Readmitted Students Only readmitted students, who were not meeting SAP prior to their absence, can appeal by submitting an online Satisfactory Academic Progress Appeal for Returning Students Form. Clickhereto access the online form using your BlueKey login. Cost of Attendance Appeal Request an adjustment of your cost of attendance by submitting the appeal form and all requested documentation to support your request. 2025-26 Cost of Attendance Appeal for Fall 2025, Winter 2026, Spring 2026 and Summer 2026 The 25-26 Cost of Attendance Appeal will be available in July 2025. 2024-25 Cost of Attendance Appeal for Fall 2024, Winter 2025, Spring 2025 and Summer 2025 Only submit this form if you are appealing for Fall 2024, Winter 2025, Spring 2025 and Summer 2025. If you would like to submit a special circumstance appeal, see the section above for those appeals. Clickhereto access the online form using your BlueKey login. Financial Aid Reinstatement Forms Request the reinstatement of your financial aid if you declined or accepted a reduced amount of an offer, are returning after a Leave of Absence and your aid offers were canceled or did not meet the reinstatement requirements of your admission-based scholarship. 2025-26 Financial Aid Reinstatement Form for Fall 2025, Winter 2026, Spring 2026 and Summer 2026 The 25-26 Financial Aid Reinstatement Form will be available in July 2025. 2024-25 Financial Aid Reinstatement Form for Fall 2024, Winter 2025, Spring 2025 and Summer 2025 Clickhereto request the reinstatement of cancelled 2024-2025 financial aid or declined Federal Direct Student Loans. Use your BlueKey to login. This form cannot be used to apply for summer 2025 financial aid or for Satisfactory Academic Progress (SAP) appeals. 2025-26 Academic Scholarship Reinstatement Appeal for Fall 2025, Winter 2026 and Spring 2026 The 25-26 Academic Scholarship Reinstatement Appeal will be available in July 2025. 2024-25 Academic Scholarship Reinstatement Appeal for Fall 2024, Winter 2025 and Spring 2025 Log intoDePaul Scholarship Connectusing your DePaul BlueKey credentials to request a reinstatement of your undergraduate academic scholarship for the 2025 aid year. If you are already logged in, you can also search for the appeal form by going to Opportunities>Ours and typing DePaul Academic Scholarship Reinstatement Appeal into the search field. You will be required to submit a General Application and sign a Consent Statement before completing the appeal, if you have not done so for the academic year already."
}