{
  "url": "https://www.depaul.edu/admission-and-aid/types-of-admission/Pages/graduate-student.aspx",
  "title": "\r\n\tGraduate Student Admission Process  |  Types of Admission  |  Admission & Aid  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Types of Admission Freshman Student Transfer Student Adult Undergraduate Student Graduate Student International Student Returning Student Visiting Undergraduate Student Non-Degree Student Apply Online Request Info Visit Campus DePaul University>Admission & Aid>Types of Admission>Graduate Student Graduate Student Admission Process Advance your career and make a difference Eachgraduate programhas different admission requirements and instructions, which you will access by clicking below on the school you wish to apply to. If you're a visiting or non-degree graduate student, you should apply to the college(s) offering the courses you're interested in. Graduate Admission Instructions Kellstadt Graduate School of BusinessAdmission instructions for Kellstadt Graduate School of Business students Graduate College of CommunicationAdmission instructions for College of Communication graduate students Jarvis Graduate College of Computing and Digital MediaAdmission instructions for Jarvis College of Computing and Digital Media graduate students College of LawAdmission instructions for College of Law students Graduate College of Liberal Arts and Social SciencesAdmission instructions for College of Liberal Arts and Social Sciences graduate students Graduate School of Public ServiceAdmission instructions for School of Public Service graduate students Graduate College of EducationAdmission instructions for College of Education graduate students Graduate College of Science and HealthAdmission instructions for College of Science and Health graduate students Graduate PsychologyAdmission instructions for Psychology graduate students Graduate School of Continuing and Professional StudiesAdmission instructions for School of Continuing and Professional Studies graduate students Graduate School of MusicAdmission instructions for School of Music graduate students Graduate Theatre SchoolAdmission instructions for The Theatre School graduate students Apply Now DePaul University’s Safety & Security Information Report and Fire Safety Report is available upon request and atgo.depaul.edu/CleryASR. The report includes statistics about crimes that occurred on campus and public property immediately adjacent to campus, institutional policies concerning campus security, sexual assault and other matters. It also includes fire statistics, fire safety practices and standards of the institution. For a paper copy of the report, contact DePaul’s Clery Compliance Coordinator at (773) 32​5-8483."
}