{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/latin-american-latino-studies.aspx",
  "title": "\r\n\tLatin American and Latino Studies | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Latin American and Latino Studies Latin American and Latino Studies Discover Latin American culture and perspectives As a Latin American and Latino Studies major, you’ll explore the cultural contributions of Latin Americans to the global community and the perspectives and traditions that have developed in the region. Examine the multicultural relationship between peoples and cultures of Latin America, including indigenous, European, Semitic, Arab, Asian and African societies, and explore the profound linkage that has emerged between Latin America and the United States, particularly through the construction of Latino communities in the U.S. Participate in one of DePaul’s Study Abroad programs in Nogales, Mexico; Mérida, Mexico; El Salvador; Chile or Argentina. We offer the 3+3 BA/JD Program, which allows high-achieving first-year undergraduate students to be admitted simultaneously to the College of Liberal Arts and Social Sciences (LAS) and the College of Law (LAW). You’ll complete your first three years in LAS and your final three years in LAW. Classes Coursework Founding Myths and Cultural Conquests in Latin America Struggle and Resistance in Latin America Constructing Latino communities Media and Cultural studies Across the Americas Globalization in the Americas Art of the Ancient Americas Latino Religious Experience in the United States Latino Communities in Chicago Resources Major Requirements Schedule of Classes College Website Concentrations/Tracks Cultural Studies of the Americas Individualized Concentration Latina/o/x Studies Transformations Over Time in the Americas Minor offered Combined bachelor’s + master’s degree offered Career Options Common Career Areas Public policy International business Translation services Governmental work Education Immigration work Social services Law Human rights 93% of Latin American and Latino Studies graduates were employed, continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program."
}