{
  "url": "https://www.depaul.edu/admission-and-aid/financial-aid/maintain-eligibility/sap/Pages/suspension.aspx",
  "title": "\r\n\tAppeal Financial Aid Suspension  |  Satisfactory Academic Progress (SAP) Policy  |  Maintain Eligibility  |  Financial Aid  |  Admission & Aid  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Maintain Eligibility Satisfactory Academic Progress (SAP) PolicyAppeal SuspensionDefinitions and Terminology Appeal Suspension Definitions and Terminology Return Title IV Aid Withdrawal from Classes Financial Aid Terms & Conditions Limits & Maximums Apply Online Request Info Visit Campus DePaul University>Admission & Aid>Financial Aid>Maintain Eligibility>Satisfactory Academic Progress (SAP) Policy>Appeal Suspension Appeal Financial Aid Suspension ​​​If your SAP status is Not Meeting SAP and you have extenuating circumstances that prevented you from meeting theSatisfactory Academic Progress (SAP) requirements, you may appeal for reinstatement of your financial aid eligibility. Current Students By the term SAP appeal deadline, you may complete a SAP appeal inCampus Connect> Financial Aid tile. Appeal deadlines are for the term during which you want aid reinstated (for example, if you want your eligibility reinstated during Winter quarter, the deadline is February 15). SAP appeals for a term that has concluded will be reviewed for the upcoming term. A SAP appeal consists of a short statement answering the questions below. An appeal is not considered complete and will not be reviewed if the appeal does not directly respond to the following questions: If you are appealing after your warning term, explain the circumstance(s) that kept you from meeting the SAP requirements. If you are appealing because failed a probation or academic plan term, explain why you did not meet the requirements established as a condition of approving the prior term’s appeal. Explain how the situation has changed or issue(s) been addressed to allow you to be successful in the future. Include as many specifics as possible, including corrective action(s) you have identified and will follow. If the SAP committee requests additional information, your appeal is not considered complete until you have submitted that information. If you have documents you would like to submit in support of your appeal, do so using oursecure document upload website. Sensitive information is not uncommon in a SAP appeal. In general, the information included in your SAP appeal is shared only with the committee or your academic advisor. However, if you disclose that you have experienced sex or gender-based violence, misconduct, or harassment, the chair of the SAP committee is required, under University policy as well as state and federal law, to report this information to the Office of Gender Equity at DePaul, so their office may provide relevant resources and support options to you. This is an important part of DePaul’s ethos of care for all in our University community. There are additional appeal requirements for students who exceed the maximum timeframe. You must meet with your advisor to discuss your situation, and your advisor must submit an advisor form in Campus Connect with the following information: Your anticipated graduation term Remaining coursework An explanation (from your advisor) of how many transfer hours apply towards your DePaul degree, if applicable Returning Students Students readmitted to DePaul after an absence from the university who were not meeting SAP prior to their absence can appeal by submitting an onlineSatisfactory Academic Progress (SAP) Appeal for Returning Studentsform (use your BlueKey username and password to log in to this form). Continuing students cannot not use this form. SAP Appeal Results Complete appeals are reviewed within 10 business days. You will receive an email within 24 hours of submitting an appeal to confirm receipt. Once a decision has been made, you will be notified by email within 24 hours of the outcome of your appeal. You must visit Campus Connect > Financial Aid tile > View My FA Academic Progress to find the GPA and course completion requirement you are expected to attain for the term your appeal is approved. You must meet these term requirements to remain eligible for aid. Definitions of SAP statuses can be found onDefinitions and Terminology."
}