{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/environmental-studies.aspx",
  "title": "\r\n\tEnvironmental Studies | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Environmental Studies Environmental Studies Explore solutions to pressing environmental challenges As an Environmental Studies major, you will gain a comprehensive understanding of human interaction within the natural environment by taking courses in the social sciences, natural sciences and humanities. This interdisciplinary curriculum will allow you to evaluate current and emerging environmental problems and determine potential solutions. Majoring in environmental studies offers many opportunities for hands-on research experience as program faculty are active researchers in soil and wetland science, restoration ecology, geology, paleontology, and conservation. In addition, DePaul’s close proximity to Lake Michigan, Chicago’s urban ecosystem will allow you to interact and work with professionals in the field and learn about important environmental issues. The Environmental Studies program offers a Standard concentration, which studies the interdependency among physical, biological, economic and social systems and a Sustainability concentration. The Sustainability concentration also offers an Urban Sustainability focus. In addition we offer a combined bachelor’s/master’s degree program in Environmental Studies and Sustainable Management. This program allows you to complete a bachelor’s degree and a graduate degree in as few as five years. For international students: this program is a STEM-designated program, which can qualify you to extend your post-graduation stay in the United States. Classes Coursework Biology Earth System Science Ecology Environmental Conservation Environmental Data Analysis History of Chicago Issues in Environmental Design Philosophy and the Environment Sustainable Development Resources Major Requirements Schedule of Classes Department Website Concentrations/Tracks Standard Sustainability Minor offered Combined bachelor's + master's degree offered Career Options Common Career Areas Aquatic ecology Compliance Ecotourism Education Environmental consulting Groundwater protection International forestry planning Natural resource management Park operations and maintenance Recreation planning Wetlands protection Wildlife data management 88% of Environmental Studies graduates were employed, continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program."
}