{
  "url": "https://www.depaul.edu/admission-and-aid/financial-aid/resources/Pages/new-students.aspx",
  "title": "\r\n\tResources for New/Incoming Students  |  Resources for...  |  Financial Aid  |  Admission & Aid  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Financial Aid Financial Aid Basics Types of Aid Receive Aid Maintain Eligibility Manage Costs Repay Loans Resources for...ParentsNew/Incoming StudentsCurrent StudentsDeparting Students Parents New/Incoming Students Current Students Departing Students Forms Contact Us Apply Online Request Info Visit Campus DePaul University>Admission & Aid>Financial Aid>Resources for...>New/Incoming Students Resources for New/Incoming Students You have so much to look forward to in college — don't let paying for it stress you out. With this list of resources, you'll get all the information you need to feel at ease about financing your DePaul education. We expect you to have questions, and we're here to answer them.Contact us. Financial Aid Basics— It's time to do your research. Get started with an understanding of the basics of financial aid. Apply for Aid— Have you completed all the required steps to be considered for financial aid? Types of Aid— Assistantships, federal loans, private loans, grants… There are a lot of options for financing your education. Explore them all here. Financial Aid TV— Watch short videos covering financial aid eligibility, FAFSA requirements, grant programs and everything in between. Receive Aid— Learn how — and when — your aid is disbursed to your student account. Using Campus Connect— Use DePaul's online portal to check for notifications regarding your financial aid award status and tuition due date. Maintain Eligibility— Staying on track is just as important as securing aid in the first place. Learn how to remain eligible for the aid you receive once you've started classes at DePaul. Contact Us— We're always here to help. Give us a call, send us an email or stop by the office. Are you the parent or guardian of an incoming student? ExploreResources for Parents."
}