{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/computing.aspx",
  "title": "\r\n\tComputing (BAPS) For Adult Students | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Computing (BAPS) For Adult Students Computing (BAPS) For Adult Students Develop evolving technology and specialized computing skills The Bachelor of Arts in Professional Studies with a major in Computing (BAPS) program is designed for adult students who seek to advance their careers in a range of fields involving computer and networking technologies. As you work toward your bachelor of arts in computer science degree, you’ll see an emphasis on the integration of specialized knowledge with workplace-ready skills such as professional communications, data-driven decision-making, professional ethics and innovation. Based on transferable credit or credit earned through an assessment of your prior learning from personal and professional experience, you may be able to earn your bachelor of arts in computer science degree in two years. You’ll learn from professors who are leaders in their fields and are committed to teaching and mentoring adult students. With help from our dedicated adult student advisors, you’ll have the road map and resources you’ll need to succeed — during your studies and after graduation. Online Degree Options DePaul’s Bachelor of Arts in Professional Studies (BAPS) degree in computing offers a choice of two concentrations—computer science or information technology—that can be completed entirely online for busy adults. This joint degree between the School of Continuing and Professional Studies (SCPS) and the Jarvis ​College of Computing and Digital Media (CDM) will provide you with practical, immediately applicable knowledge across a range of organizational settings. Here, you’ll experience online learning without compromise; working closely with your CDM faculty mentor, you’ll enjoy real flexibility that fits both your life and your interests. And DePaul’s generous credit transfer policy, including the option to earn academic credit for life and career experience, means you could earn this degree in just two years. Classes Coursework Applied Networks & Security Data Analysis Human Computer Interaction Innovation in the Professions Professional Communication in the Workplace Research Methods Software Project Management Resources Major Requirements Schedule of Classes College Website Concentrations/Tracks Computer Science Information Systems Information Technology Network Technology Security Combined bachelor's + master's degree offered Career Options Common Career Areas Consulting Business Analyst Systems Analyst Project Management Database Administration Network Security Web Development Programming Get more information Complete the form below to receive more information about this degree program."
}