{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/special-education.aspx",
  "title": "\r\n\tSpecial Education | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Special Education Special Education Inspire and motivate exceptional students DePaul’s Special Education degree program will prepare you to teach students with exceptionalities from kindergarten to age 21 in a variety of urban and suburban educational settings, including public and private schools. By completing the bachelor’s in Special Education degree program, you’ll be eligible for the Illinois Learning and Behavior Specialist I (LBS1) license, provided you complete additional state requirements. You’ll complete two lab-based courses in the Education and Counseling Center in the College of Education, one focused on reading, and one on math. In each course, you’ll work with a struggling learner from the community. You’ll also complete two field-based practicum courses (totaling 70 hours of field experience) with related seminars: one focused on learners with high incidence disabilities in an inclusive setting, and one focused on students with low incidence disabilities in a self-contained setting. As a Special Education degree major, you’ll learn to: Apply specific strategies needed to teach exceptional learners Consult and co-teach in general education inclusion classrooms Modify content for exceptional learners in reading, math, natural and social sciences Teach small groups of exceptional students in a resource room Teach students with more significant disabilities in a self-contained classroom Classes Coursework Formal Assessment in Special Education Classroom and Behavior Management Collaboration in Schools Exceptionality and Learning Instruction and Differentiation Teaching Students with Significant Disabilities Teaching Literacy to Exceptional Students Resources Major Requirements Schedule of Classes Department Website Career Options Common Career Areas Teaching Education policy Private practice 88% of College of Education graduates were employed, continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program."
}