{
  "url": "https://www.depaul.edu/about/administration/Pages/manuel.aspx",
  "title": "\r\n\tRobert L. Manuel, PhD | DePaul University, Chicago\r\n",
  "content": "About Rankings Campuses Chicago Events Mission President Administration Distinctions History & Timeline Accreditation & Licensure Apply Online Request Info Visit Campus DePaul University>About>Administration>Robert L. Manuel, PhD ​​ ​​ Robert L. Manuel, PhDPresidentWebsite Robert L. Manuel, PhD President ​​ Robert L. Manuel began his term asDePaul University’s 13th presidenton Aug. 1, 2022. Following an extensive national search and unanimous election, DePaul’s Board of Trusteesannounced his appointmenton May 10, 2022. ​Rob brings more than 30 years of academic excellence in higher education to DePaul. He most recently served as president at the University of Indianapolis, a faith-based institution affiliated with the United Methodist Church. At UIndy, where he served as president since 2012, he ushered in an era of strong academic, financial and physical growth. He guided the construction of three new residence halls attracting more than 900 new students to live on campus, developed the 150,000 square foot University Health Pavilion, and redeveloped a local industrial building into the new home of the R.B. Annis School of Engineering. Throughout his career, Rob has consistently prioritized expanding access and supporting the success of underrepresented populations and first-generation students. At UIndy, where first-generation students represent 43% of the first-year class, he engaged the entire university community in the development and implementation of a five-year strategic plan. The outcome resulted in a significant boost in enrollment, particularly among students of color, increases in engagement of alumni and fundraising, investments in faculty and academic support, as well as an increase in graduation and retention rates. Rob also appointed UIndy’s first diversity, equity and inclusion officer, a position that directly reports to him as president. As a higher education administrator, first at New York University and then at Georgetown, Rob has been recognized for his development and implementation of innovative academic programming—including graduate, undergraduate, online and customized educational programs. In his six years at Georgetown, from 2006 to 2012, he served as dean of the School of Continuing Studies and then associate provost. As dean, in addition to reorganizing the school, he helped create a Diversity Council that engaged corporate partners in research projects related to equity and inclusion. He established the Georgetown Global Education Institute, which trained global leaders in the areas of entrepreneurship, urban planning and financial policy. As associate provost, he provided leadership for the Center for Social Justice, Research and Training; the Diversity Action Council and a Veteran Affairs initiative. At New York University, from 2000 to 2006, Rob served in the Office of the Vice President for Enrollment Services. He also held the positions of chief information officer, assistant dean and clinical associate professor at NYU’s School of Continuing and Professional Studies. Earlier in his career, he served at Le Moyne College and Southern Vermont College. Raised in the Episcopal Church, he credits his most formative religious development to his time at Le Moyne College and Georgetown University, both Catholic institutions. For the last six years, he has served as a board member at Brebeuf Jesuit Preparatory High School. He also has participated in a number of immersive religious experiences, including a service trip with the Jesuits to Kenya. Rob current serves on the board of directors for the National Association of Independent Colleges and Universities. He also has served on the national advisory board of the University Professional & Continuing Education Association and the editorial advisory board for the Continuing Higher Education Review. Rob has a bachelor’s degree in history and political science from Allegheny College, a master’s degree in higher education administration from Syracuse University and a PhD in higher education administration from New York University. He and his wife, Wilmara, are the parents of three daughters."
}