{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/intelligent-systems-engineering.aspx",
  "title": "\r\n\tIntelligent Systems Engineering | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Intelligent Systems Engineering Intelligent Systems Engineering Learn to engineer intelligent systems solutions In DePaul’s Intelligent Systems Engineering program, you’ll learn about engineering systems that integrate physical processes, computation and control. You’ll gain an understanding of how cyber-physical systems are used to manage electric grids and other infrastructures, home utilities and appliances, robots, autonomous vehicles, environmental sensor networks, traffic control, smart toys and Internet of Things (IoT) systems. As you work toward your systems engineering degree, you’ll learn how to: Analyze a simple physical process and develop a mathematical model that describes it Develop a feedback control system that controls a simple physical process Solve a computational problem by selecting appropriate data structures and algorithms Select the hardware (sensors, actuators, controllers, etc.) for an Intelligent System Develop the embedded system software that manages Intelligent System hardware Assess and improve the reliability and security of a simple Intelligent System Integrate feedback control, algorithms, and hardware to implement a Intelligent System The Intelligent Systems Engineering program takes on a multi-disciplinary approach – you’ll gain a broad and deep foundation in computer science and software development. The Jarvis College of Computing and Digital Media (CDM) is located in downtown Chicago, in the heart of the city’s technology and business districts. With your DePaul cyber engineering degree, you’ll have many opportunities to work professionally with leading companies in information systems. Many CDM faculty members are working professionals, allowing you to learn first-hand from leaders in the industry. For international students: this program is a STEM-designated program, which can qualify you to extend your post-graduation stay in the United States. Classes Coursework Data Structures Discrete Mathematics Embedded Systems Networking for Cyber-Physical Systems Physics Technical Writing Resources Major Requirements Schedule of Classes Department Website Combined bachelor's + master's degree offered Career Options Common Career Areas Automotive embedded software engineer Computer hardware engineer Cyber security analyst Cyber security engineer Information systems security manager IT security engineer Researcher Get more information Complete the form below to receive more information about this degree program."
}