{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/music-education.aspx",
  "title": "\r\n\tMusic Education | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Music Education Music Education Instill a love for music in your classroom DePaul’s Bachelor of Music in Music Education degree prepares you to teach instrumental and vocal music in kindergarten through 12th grade in urban and suburban education settings, including public and private schools. As part of the Music Education degree program, you’ll: Learn educational theories from distinguished music educators with strong practical experience; Master the ability to use rehearsal techniques, principles and strategies for teaching voice, instruments and ensembles; and Gain familiarity with appropriate literature for various levels of orchestra, band, chorus and music classes. Music Education students refine their skills and knowledge during their junior year through a partnership with Chicago Public Schools. And during senior year, students work with master teachers throughout the Chicago metro area while student teaching. Prior to graduation, the School of Music's Office of Career Planning and Placement will work closely with you to prepare a portfolio that will be used in your job application process. Upon graduation, you’ll receive Illinois K-12 Music Teacher Certification. Classes Coursework Accompanying Clinical Experiences with Children and Youth Conducting Human Growth and Development Instrumental Methods and Lab Instrumental Techniques Music Methods and Lab Vocal Methods and Lab Resources Major Requirements Schedule of Classes Department Website Combined bachelor’s + master’s degree offered Career Options Common Career Areas Choir director College/conservatory/university music educator Elementary/primary school music teacher Music education supervisor Private instructor Secondary school music teacher ​ Get more information Complete the form below to receive more information about this degree program."
}