{
  "url": "https://www.depaul.edu/admission-and-aid/Pages/test-optional-faqs.aspx",
  "title": "\r\n\tTest-Optional FAQs  |  Admission & Aid  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Admission & Aid Types of Admission Visit DePaul Tuition Room & Board Scholarships Financial Aid Veteran Student Test Credit & Placement Check Your Application Status Admitted Students Deadlines Immunization Apply Online Request Info Visit Campus DePaul University>Admission & Aid>Test-Optional FAQs Test-Optional FAQs Based on research and DePaul’s student-centered approach to education, DePaul has adopted a test-optional alternative for freshman admission. Students applying for freshman admission can choose whether to submit ACT or SAT scores as part of the application. You’re more than a test score And there’s more to learn about DePaul. We’ll send you information about the program you’re interested in. Take your next step Submit your application to DePaul today, with or without test scores; you can also learn more about the process below. 1. Why does DePaul make submitting standardized test scores optional? DePaul engages in a holistic review of applicants and the test-optional alternative allows us to consider your strengths that may be demonstrated in areas other than your ACT or SAT score. Both our internal and external research show that your high school record, in particular your grades in challenging core subjects, is the most important academic component in the review for admission. By allowing you to determine how to best showcase your academic performance, DePaul is emphasizing that four years of perseverance, motivation and effort during high school bear a direct relationship to successful college-level work. 2. How do I know if I should apply test optional? If you are satisfied with your test scores and believe they are indicative of your academic achievement, then we are happy to consider them as part of your application. If you have a strong academic record demonstrated by above average grades in challenging courses, but do not feel your test results are a good reflection of your academic performance, you can choose not to submit them. Please also reference the information provided in question #6 to help you make this decision. We strongly recommend that you carefully consider your decision to apply with or without test scores. You will be asked to indicate whether you are applying test optional on the Common Application, within the DePaul Questions. 3. What if my scores are sent from a testing agency or included on my transcripts? If your scores are sent to us from the testing agency or are included on your high school transcript, you can still apply test optional as long as you indicate that option on your application. If you apply test optional, your test scores will not be taken into consideration as part of the application review. 4. How will DePaul Admission evaluate students who do not submit test scores? Because DePaul has always considered applicants from a holistic point of view, the review process for students who submit ACT or SAT scores and students who do not submit scores will be very similar. When considering an applicant for admission, we will closely evaluate your overall academic record, including grades earned in academic coursework, performance in honors, International Baccalaureate and Advanced Placement courses, and grades trends throughout your high school career. In addition, other factors will include letters of recommendation, co-curricular activities, community involvement, writing ability and other achievements. Generally, students who are most competitive in DePaul’s admission process have taken four years in each of the core areas (English, math, natural science and social science/history). If your high school offers advanced placement (AP) or honors courses or the International Baccalaureate (IB) Diploma, your involvement in this type of rigorous high school curriculum will reflect positively on your application. We will carefully review the strength of your high school classes and your performance in them. Although not required in order to review your application, we encourage test-optional applicants to submit the optional personal essay through the Common App. Applicants applying test optional will be reviewed separately from applicants applying with SAT or ACT scores. Because we conduct a thorough review of your high school curriculum and grades (paying particular attention to any honors and advanced level courses you have taken) your application may take additional time to review. 5. How do I know if my academic record is strong enough to apply test optional? Because we evaluate each application holistically and individually, there is no formula we can provide to help you decide. However, a profile of the students currently enrolled at DePaul might give you some guidance. Here is a summary of the high school records and test scores of the last four admitted and enrolling freshman classes: Standardized Test Scores High School GPA of Admitted and Enrolled Students Of course, every applicant presents a different combination of test scores, curriculum choices, grade point average, recommendations, out-of-class experiences and personal traits. In general, weakness in one area can be compensated for by strength in another. 6. Will I still be eligible for the University Honors Program and scholarships if I apply test optional? Yes, you will still be eligible. Scholarships are awarded to students who have outstanding academic ability or talent, or who have demonstrated leadership in serving others. If you apply test optional, you will still be given full consideration for scholarships based on your academic achievements in a strong curriculum, leadership in service or talent in the performing arts. The University Honors Program at DePaul is a great opportunity for highly motivated students. Most students who enter the University Honors Program are in the top 10 percent of their high school class and have a cumulative GPA higher than 3.5. After a student is admitted to DePaul, a separate application process is required for the University Honors program, which includes additional essay questions. Applicant responses to these questions are carefully considered. Find out more about theUniversity Honors Program. Test optional applicants of outstanding ability who are admitted into the College of Business will also be considered for participation in theStrobel Honors Accountancy Program; students who are interested in health careers will be considered for thePathways Honors Program. No separate application process is required for these two programs but highly qualified students who have been selected to participate are notified at the time of acceptance to DePaul."
}