{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/spanish.aspx",
  "title": "\r\n\tSpanish | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Spanish Spanish Study the Spanish-speaking world In the Spanish program, you will study the language, literature and cultures of the Spanish-speaking world. Over 400 million people speak Spanish as their native language and it is the official language of 21 countries; it’s also one of the official languages of the United Nations and the European Union. More than 40 million native Spanish speakers live in the United States, and a bachelor’s degree in Spanish will develop your fluency and communication skills in our interconnected world. Chicago is a diverse city with numerous Latin American communities. Practice your Spanish while exploring festivals, neighborhoods, restaurants, museums, and other cultural institutions that will allow you to experience firsthand the richness of the Spanish-speaking world. Take advantage of our Study Abroad programs in Argentina, Chile, Mexico, Peru, Puerto Rico or Spain to grow linguistically and expand your cultural understanding of Spanish-speaking societies. If you’re interested in pursuing a career in education, the Spanish department partners with the College of Education to award teaching degrees at the middle school and high school levels. We also offer the 3+3 BA/JD program, which allows high-achieving first-year undergraduate students to be admitted simultaneously to the College of Liberal Arts and Social Sciences (LAS) and the College of Law (LAW). You’ll complete your first three years in LAS and your final three years in LAW. Classes Coursework Grammar and Communication Composition Conversational Spanish Phonology and Phonetics Literary Analysis in Spanish The Spanish Novel Latin American Literature Resources Major Requirements Schedule of Classes College Website Modern Languages minor offered Combined bachelor’s + master’s degree offered Career Options Common Career Areas Public policy International business Education Immigration work Social services Journalism Tourism Law 84% of Spanish graduates were employed, continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program."
}