{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/exercise-science.aspx",
  "title": "\r\n\tExercise Science | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Exercise Science Exercise Science Study the science of movement In the Exercise Science (EXS) degree program you will learn the scientific principles that relate to human movement. Upon completion of your Exercise Science degree you will be qualified to pursue careers in a variety of areas in the health sciences, as well as apply for graduate programs related to the fitness and exercise sciences. You will develop specific skills in: Exercise assessment Nutritional principles related to exercise and sports Patient and client interpersonal relationship management Performance enhancement Prevention and treatment of sports injuries Professional ethics and behavior The American College of Sports Medicine (ACSM) is the professional organization that establishes guidelines and competencies for the field of exercise science and serves as the guide for the EXS degree program’s academic quality. Classes Coursework Physiology of Exercise Human Anatomy Kinesiology Health and Nutrition Athletic Injuries Human Growth and Development Resources Major Requirements Schedule of Classes Department Website Concentrations/Tracks General Pre-Physical Therapy Combined bachelor's + master's degree offered Career Options Common Career Areas Cardiopulmonary rehabilitation Community health and welln​ess Corporate fitness program management Personal training Post-graduate study Sports medicine 89% of Exercise Science graduates were employed, continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program."
}