{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/robotics.aspx",
  "title": "\r\n\tRobotics  |  Majors  |  Undergraduate  |  Academics  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Robotics Robotics The Thrill of Seeing Your Coding Physically Come to Life Pursuing a robotics degree at DePaul University enables you to see your programming and mathematical skills translate into physical systems in the real world. And the thrill of watching a robot move based on your commands can be incredibly empowering and exciting! As the first bachelor’s in robotics in Chicago and one of the first in the U.S., our faculty are carving new paths for students interested in this fascinating, fast-growing field. You’ll have the opportunity to engage in groundbreaking research areas such as healthcare and biomedical engineering, human-assistive devices, and soft robotics. These projects are not just theoretical–they have real-world applications that can make a significant impact. The robotics community is new at DePaul but growing fast. Connect with like-minded students through the DePaul Robotics Club, Air DePaul (which promotes drone flying and aerial photography) and our robotics labs. For international students, this is a STEM-designated program, which can qualify you to extend your stay in the US post-graduation. Classes Coursework Electrical Engineering Computer Engineering Computer Science Programming Data Structures Algorithms Calculus Linear Algebra Resources Major Requirements Schedule of Classes Department Website Career Options Common Career Areas Robotics engineer Embedded systems engineer Firmware engineer Robotics Software Engineer Motion Planning Engineer SLAM Engineer Robotics Labs DePaul boasts several cutting-edge robotics labs where students can immerse themselves in hands-on, real-world experience, bringing innovative ideas to life. Robotics and Medical Engineering Lab (RoME Lab) Robotics and Assisted Locomotion Lab Next Generation Lab (NexGen Lab) Get more information Complete the form below to receive more information about this degree program."
}