{
  "url": "https://www.depaul.edu/admission-and-aid/types-of-admission/transfer-student/transferring-your-courses/Pages/transfer-guides.aspx",
  "title": "\r\n\tTransfer Guides | DePaul University, Chicago\r\n",
  "content": "Transfer Student Prepare to Transfer Transferring Your CoursesTransfer GuidesCourse ListsTransferologyRecommended CoursesRecent Transfer Guides Course Lists Transferology Recommended Courses Recent Meet Your Transfer Counselor DePaul Admission Partnership Program University Center Partnerships For Advisors Apply Online Request Info Visit Campus DePaul University>Admission & Aid>Types of Admission>Transfer Student>Transferring Your Courses>Transfer Guides Transfer Guides This tool is for students attending Illinois Community Colleges who want to transfer into the College of Business, Communication, Computing and Digital Media, Education, Science and Health, or Liberal Arts and Social Sciences. How does the tool work? Use Transfer Guides as a planning tool. It will help you determine how specific courses at your college may be applied to bachelor's degrees at DePaul. To generate a guide for specific majors (outside the School of Continuing and Professional Studies): Select your community college. Select the DePaul college/school you are interested in. Select your DePaul major. Click \"Submit.\" The Transfer Guide will take several minutes to load. Please do not refresh/resubmit. How to Read Your Transfer Guide After the report is generated, you will see two columns labeled \"DePaul Course Requirement\" and \"Community College: Courses Equivalent to DePaul Courses.\" Column 1:Lists the course requirements for your intended degree at DePaul. Column 2:Lists which community college course(s) you can take that are equivalent to DePaul credit. Note: In some cases, there will be multiple courses listed in a shaded box.Courses within the same shaded box have been determined to transfer in as the same DePaul course. You should only take one course from each individual shaded box to avoid losing credit for repeated coursework. In order to view the Transfer Guides content, we recommend that you disable your browser's pop-up blocker (if your pop-up blocker is on)."
}