{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/theatre-management.aspx",
  "title": "\r\n\tTheatre Management | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Theatre Management Theatre Management Build essential managerial skills for theatres In the Theatre Management degree program, you’ll be exposed to both the art and business aspects of theatre, preparing you for a career in arts administration and management. The program combines theatre courses with management and marketing courses. Participate in The Theatre School’s​ public productions, taking on various management positions, and complete multiple professional internships to gain real-world experience in the theatre management industry. You’ll also have the option to participate in New York City Intensive — a one-week independent study in New York City, where you will meet with producers, company managers, active DePaul alumni in the industry and tour theatres and museums. Classes Coursework Advancement/Community Engagement Business/Company Management Culture of Theatre Production Dramatic Criticism Financial Management Managerial Concepts and Practices Marketing Script Analysis Resources Major Requirements Schedule of Classes Department Website Concentrations/Tracks Standard Directing Theatre for Young Audiences Combined bachelor's + master's degree offered Career Options Common Career Areas Advancement Business development Dramatic criticism Educational outreach Human resources Marketing Theatre/arts management Get more information Complete the form below to receive more information about this degree program."
}