{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/composition.aspx",
  "title": "\r\n\tComposition | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Composition Composition Learn the language of music As a music composition major you will learn how to write your own music. DePaul’s Composition program combines traditional music studies with instruction in analysis, orchestration, compositional procedures and contemporary musical styles. Music professors are active composers who will give you private composition instruction. Music composition majors also take part in seminars with guest composers, write and produce original works and have your compositions performed during the DePaul Composers Forum. You may submit your pieces to be read and performed by the DePaul Student New Music Ensemble, DePaul Wind Ensemble, DePaul choral groups, DePaul Chamber Orchestra and DePaul Symphony Orchestra. Living in Chicago, you’ll be able to hear live, professional contemporary music performances, such as the Chicago Symphony Orchestra and the Lyric Opera of Chicago. You’ll also be able to attend concerts of every genre, including major music festivals like Lollapalooza and Pitchfork. Classes Coursework Analytical Studies Composition Electro-acoustic Music Large Ensemble Orchestration Resources Major Requirements Schedule of Classes Department Website Combined bachelor's + master's degree offered Career Options Common Career Areas Arranging Composing Music education Music editing Music production Performance Recording Get more information Complete the form below to receive more information about this degree program."
}