{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/performing-arts-management.aspx",
  "title": "\r\n\tPerforming Arts Management | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Performing Arts Management Performing Arts Management A fine-tuned approach to the music industry The Performing Arts Management degree program will prepare you for a career in the multi-faceted and extensive performing arts industry. As you work towards your Performing Arts Management degree, you’ll focus on not-for-profit arts administration (orchestra, symphony, opera, dance, theatre) and commercial music management (recording industry, artist representation, music publishing and distribution, product merchandising, concert promotion). You’ll choose to earn one of the following degrees: a Bachelor of Music (BM) in Performing Arts Management, with a minor in Business Administration a Bachelor of Science (BS) in Performing Arts Management, with a minor in Business Administration You’ll also have the opportunity to complete internships with nationally recognized arts and music organizations such as Lyric Opera, Chicago Symphony Orchestra, Steppenwolf Theatre, Grant Park Music Festival, Aware Records, Recording Academy/Grammy Awards, and House of Blues. Classes Coursework Accounting Business Law Economics Introduction to Music Business Legal Issues in the Music Industry Marketing Music Publishing Statistics Resources BM Major Requirements BS Major Requirements Schedule of Classes Department Website Combined bachelor's + master's degree offered Career Options Common Career Areas Artist representation Concert promotion Music publishing and distribution Opera administration Orchestra administration Product merchandising Recording management Symphony administration Theatre administration Get more information Complete the form below to receive more information about this degree program."
}