{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/scene-design.aspx",
  "title": "\r\n\tScene Design | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Scene Design Scene Design Set your major to scene design In the Scene Design program, you’ll learn to visualize, design and create the sets used in on-stage performances. You’ll collaborate with directors, dramaturges, technicians and the Scene Shop staff to build your set designs. You’ll learn from distinguished and award-winning faculty, many of whom majored in ​set design and have extensive experience in the industry. You’ll also have the opportunity to work as assistant and lead set designer for one of the more than 40 public productions presented by The Theatre School each season. In your fourth year, you’ll complete a set design internship in order to gain real-world experience. You’ll have the chance to take part in the annual Graduate Showcase, where you’ll present your set designs to artistic directors and other members of the theatre, film and television industries. Classes Coursework Drawing for Designers Lighting Design Design Production Model Building Scene Painting Technical Drawing Theatre Crew Resources Major Requirements Schedule of Classes Department Website Concentrations/Tracks Production Design Combined bachelor's + master's degree offered Career Options Common Career Areas Commercial set design Exhibit design Movie set design Television set design Theatre design Get more information Complete the form below to receive more information about this degree program."
}