{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/chemistry.aspx",
  "title": "\r\n\tChemistry | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Chemistry Chemistry Study theories and methods in chemical science The Bachelor of Arts (BA) and Bachelor of Science (BS) in Chemistry program will provide you with the fundamentals of chemical theory and practice through scientific investigation, laboratory experience and research opportunities. As a chemistry major will have multiple opportunities to gain hands-on research experience working with chemistry faculty members conducting research projects funded through government, foundation and industry grants. Being in Chicago also allows those pursuing a BA or BS in Chemistry to attend many scientific conferences hosted in the city throughout the year. In addition to a variety of combined degree programs, we offer a combined bachelor’s + master’s degree in Chemistry and Secondary Education Chemistry, allowing you to complete a bachelor’s and a graduate degree in as few as five years. The Accelerated Program is only for qualified Chemistry (BA) majors who have been accepted into the 3+4 College of Science and Health pre-professional program in pharmacy in conjunction with Rosalind Franklin University of Medicine and Science (RFUMS). For international students: this program is a STEM-designated program, which can qualify you to extend your post-graduation stay in the United States. Classes Coursework Applied Probability and Statistics Biochemistry Calculus General Chemistry Inorganic Chemistry Organic Chemistry Physical Chemistry Physics Quantum Chemistry Resources BA Major Requirements BS Major Requirements Schedule of Classes Department Website Concentrations/Tracks Standard Accelerated Program Minor offered Combined bachelor's + master's degree offered Career Options Common Career Areas Biochemical analysis and testing Education Environmental remediation Forensics Industrial health and safety administration Medical school Patent law Pharmaceutical sales Research 94% of Chemistry graduates were employed, continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program."
}