{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/industrial-design.aspx",
  "title": "\r\n\tIndustrial Design | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Industrial Design Industrial Design Develop designs that shape our world The industrial design degree program will teach you how to hone your aesthetic design skills in order to develop prototypes for consumer and industrial products. You’ll take technical and mathematics courses from which you will learn analytical competence needed to successfully develop your prototyping ability. As an Industrial Design major, you will become a member of DePaul’s makerspace community and work alongside award-winning faculty in the Idea Realization Lab (IRL) or IRL2 — DePaul’s interdisciplinary 4,500-square-foot campus makerspaces (located on the Loop and Lincoln Park campuses, respectively). In this community, you will learn to design within the constraints of what is practical and possible through the use of several rapid prototyping technologies. The Industrial Design program culminates in a portfolio of work that will reflect your abilities as a designer, speaking to your potential as a future entrepreneur or real-world product designer. Classes Coursework Metaphysics of Objects 3D Design and Modeling Haptics History of Industrial Design Designing for the Internet of Things Resources Major Requirements Schedule of Classes Department Website Minor offered Combined bachelor's + master's degree offered Career Options Common Career Areas Museum exhibit design Business owner Advertising art director Theatre set production Interior and space designer Get more information Complete the form below to receive more information about this degree program."
}