{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/applied-behavioral-sciences.aspx",
  "title": "\r\n\tApplied Behavioral Sciences (BA) For Adult Students | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Applied Behavioral Sciences (BA) For Adult Students Applied Behavioral Sciences (BA) For Adult Students Develop perspectives on human behavior DePaul’s Applied Behavioral Sciences (ABS) degree program is a two-year program for adult students who have an associate’s degree and would like to pursue a career in human services, social work, nonprofit management and other related fields. Our applied behavioral science degree curriculum combines courses from the Department of Psychology, the College of Communication and the School of Continuing and Professional Studies. Courses will provide you with perspectives on human behavior, interaction and communication. Because students in the Applied Behavioral Sciences BA program have completed an associate's degree, they have satisfied their general education requirements. The major itself is made up ofseven content areas. Online Degree Options Are you an adult looking to complete your bachelor’s degree? We offer an excellent path. The Bachelor of Arts degree in applied behavioral sciences from DePaul’s School of Continuing and Professional Studies (SCPS) is designed to provide a broad, multidisciplinary curriculum. This is an online program that provides the flexibility to attend class in real time or on your time. A generous credit transfer policy and the option to earn academic credit for life and career experience make it possible to earn your degree in just two years. Classes Coursework Communication Effective Leadership Entrepreneurship Ethics Persuasion Professional Writing Project Management Psychology Resources Major Requirements Schedule of Classes College Website Combined bachelor's + master's degree offered Career Options Common Career Areas Communication services Consulting Human services Non-profit management Project management Get more information Complete the form below to receive more information about this degree program."
}