{
  "url": "https://www.depaul.edu/academics/online-degrees/Pages/default.aspx",
  "title": "\r\n\tOnline Degrees  |  Academics  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Academics Undergraduate Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Online Degrees Online Degrees ​​ It’s time to move forward. Earn your degree online at DePaul. Whether you have some college credit, want a bachelor’s degree or looking for a master's program, earning a degree online at DePaul University is a great way to advance your career. There’s no more time to waste. A brighter future starts right here, right now, at DePaul. Wherever you are, you’re here: online without compromise. This is everything you expect from a DePaul education, delivered online. From one-on-one attention from distinguished professors to the university’s close connections to the business and professional communities, you’ll develop the real-world skills and relationships you need to put your future in fast forward. Invest in your future. Invest in yourself. Select a program to find out more, orcontact us today! Online Degrees and Certificates Available at DePaul Select your degree type and explore DePaul’s online degree options Select degree typeAllUndergraduate DegreesGraduate DegreesCertificatesOther Offerings *Undergraduate degree cannot be completed by first-time freshman students. Online Offerings Accountancy (MS) American Payroll Associations PayTrain College and University Program Analytics Applied Behavioral Sciences (BA)* Applied Professional Studies (MA) Artificial Intelligence (MS) Business Administration (BA in Professional Studies)* Business Analyst Business Information Technology (MS) Communication and Media (BA) Computer Science (BS) Computer Science (MS) Computing (BA in Professional Studies)* Curriculum Studies (MA/MEd) Customer Relationship Management Cybersecurity (MS) Data Science (MS) Decision Analytics (BA)* Early Childhood Education (MA/MEd) Educating Adults (MA) Education, Culture, and Society (MA/MEd) Educational Leadership — Higher Education Concentration (MA) Educational Leadership — Higher Education Concentration (MEd) Financial Planning Game Programming (MS) Governance, Risk Management and Compliance (Post Master's) Grant Writing Health Informatics (MS) Healthcare Administration (BA)* Human-Computer Interaction (MS) Information Systems (MS) Information Technology (BS) Leadership Studies (BA)* Legal Studies (MLS) Managing Innovation and Change Network Engineering and Security (MS) Nonprofit Management (BA)* Nonprofit Management (MNM) Nursing – Adult-Gerontology Nurse Practitioner (Post Master’s) Nursing – Family Nurse Practitioner (Post Master’s) Nursing (MS) — RN to MS in Nursing Practical Internet Marketing Professional Communication (MA) Professional in Human Resources Project Management Project Management (Post-Master's) Psychology (BA) Public Administration (MPA) Public Policy (MPP) Public Service Management (MS) Recreation and Sport Management (BA)* School Nurse – Endorsement Six Sigma Black Belt Social Media Marketing Software Engineering (MS) Special Education – Learning and Behavior Specialist (LBS1 Endorsement) Sport, Fitness and Recreation Leadership (MS) Taxation (MS) Value-Creating Education for Global Citizenship (MEd) Writing and Rhetoric (BA) Earn your degree from anywhere in the U.S. DePaul’s online programs are formallyauthorized or exempt from authorizationin every state (and Washington, D.C.). Online courses Each term DePaul offers hundreds of courses online. Log in toCampus Connectto search for current and upcoming courses. Online student complaints Online students located outside of Illinois may issue a complaint using any of the university’s standard complaint processes, or using the complaint process made available to students through DePaul’s participation in theState Authorization Reciprocity Agreement (SARA)."
}