{
  "url": "https://www.depaul.edu/student-life/Pages/student-organizations.aspx",
  "title": "\r\n\tStudent Organizations at DePaul | DePaul University, Chicago\r\n",
  "content": "Student Life Life at DePaul Student Organizations Housing Virtual Campus Tour Student Orientation DeBlogs Career Center Athletics Art Museum Student Affairs Bookstore Apply Online Request Info Visit Campus DePaul University>Student Life>Student Organizations Student Organizations Enhance your DePaul experience Looking to meet new people, network or give back? DePaul has more than 350 student organizations dedicated to community service, student government, professional development, recreational sports and more. Enjoy playing Esports? GiveDePaul Esports & Gaminga try. Interested in art and architecture? JoinHistory of Art and Architecture. Have a green thumb? Volunteer at theDePaul Urban Gardenerscommunity garden. Find the student organization that matches your interest. Get involved The easiest way to learn about all of DePaul's student organizations is to attend the semi-annualStudent Involvement Fair. It's held at the beginning of the Fall and Winter quarters at both the Loop and Lincoln Park campuses. Members from each of the student groups will be there to answer your questions, promote upcoming events and help you get involved. Browse student organizationevents. Become a leader Can't find a group that meets your needs or interests? Start your own student organization. Email the Student Involvement Ambassadors atstudentorgs@depaul.eduto get started. They'll help register your new organization and offer coaching on marketing your group, setting up a leadership structure and recruiting members. Popular Student Organizations DePaul Activities Board DePaul Activities Board(DAB) is DePaul's premier event-organizing body. Throughout the school year, members of DAB provide DePaul students with a wide variety of events, ranging from annual traditions, such as Homecoming and FEST (an outdoor concert and festival), to speakers, music, movies, comedy shows, hypnotists and more. Student Government Association As the official representative body for students attending DePaul, theStudent Government Association(SGA) is committed to promoting and advocating the student voice and opinion. Its mission might be best summed up in the phrase \"We are interested students working for student interests!\" Interfraternity Council, Multicultural Greek Council, National Pan-Hellenic Council, and Panhellenic Council TheInterfraternity Council(IFC) is the local governing body that serves the 7 affiliated fraternities within the council. They strive to promote excellence in all aspects of fraternity life and academic excellence. TheMulticultural Greek Council(MGC) serves as the governing body for 8 culturally based fraternities and sororities. They develop programming, to unify organizations in MGC, to promote higher education, to provide community service, and to enhance leadership skills. TheNational Pan-Hellenic Council(NPHC) is collaborative organization of historically African American, international Greek lettered fraternities and sororities. NPHC honors the historical spirit of community service, cooperation, cultural consciousness, scholarship, servant leadership and unity. Our NPHC consists of 1 fraternity and 3 sororities. ThePanhellenic Council(PHC) serves as the governing body for 8 National Panhellenic Conference chapters on campus, creating a sisterhood of more than 600 members. The council's vision is to promote in women leadership, diversity, scholastic achievement, and service through relationships within and beyond the Panhellenic community. Questions about DePaul's student organizations? Contact theOffice of Student Involvement."
}