{
  "url": "https://www.depaul.edu/admission-and-aid/types-of-admission/Pages/returning-student.aspx",
  "title": "\r\n\tReturning Student | DePaul University, Chicago\r\n",
  "content": "Types of Admission Freshman Student Transfer Student Adult Undergraduate Student Graduate Student International Student Returning Student Visiting Undergraduate Student Non-Degree Student Apply Online Request Info Visit Campus DePaul University>Admission & Aid>Types of Admission>Returning Student Returning Student Finish what you started We're glad to have you back! If you are a former DePaul undergraduate student who has not registered for classes for at least three consecutive quarters (not including summer sessions), you will need to complete the returning student application process. Completing this process will reactivate your access to your DePaul student account and get you back on track to earning your degree. Former DePaul graduate students seeking returning student admission should contact the appropriategraduate admission office. Returning Student Application Steps Apply Complete the freereturning student application. Submit official transcript(s) If you have attended another college or university since leaving DePaul, you must have official transcripts sent directly from each institution as part of the application process. Official transcripts can be sent electronically toelectronictranscripts@depaul.eduor mailed to the address below: DePaul University1 E. Jackson Blvd.Chicago, IL 60604 Frequently Asked Questions What are the application deadlines for undergraduate returning students? Returning student applications are accepted for every quarter on a rolling basis until the start of the term. We do encourage submitting an application as soon as possible in order to have sufficient time to meet with academic advising and consider financial aid before the start of the quarter. Is there an application fee? No, there is no application fee for returning students. Will I keep my previous financial aid award? A financial aid award is only applicable for the academic year it is intended for, so you will need to submit a new FAFSA application to receive an updated financial aid award. Counselors inOneDePaulcan assist you with this process. I left DePaul with a financial hold. Can I still be readmitted? Yes, you can still be readmitted to DePaul, but you will need to address your financial hold before registering for classes. It's recommended that you be in contact withOneDePaulto discuss any financial holds while applying for readmission. I was academically dismissed from DePaul. How can I be readmitted? A dismissed student can be considered for returning admission after a period or two quarters, excluding summer sessions. Please note that a dismissed student may be required by their college to take courses at another accredited college or university before returning student admission is approved. Students are notified of this at the time of dismissal. You will also be asked to write a statement as part of your readmission application. If you have questions regarding your academic dismissal, please contact your college's academic advising office. Contact Us Contact a DePaul Admission representative if you have questions, or to receive more information: Online: Complete therequest information form. Call:(312) 362-8300or toll-free(800) 4DEPAUL(outside Illinois) Fax: (312) 362-5749 Email:admission@depaul.edu DePaul Office of Admission Location: Loop CampusDePaul Center9th Floor, Room 9100​1 E. Jackson Blvd.Chicago, IL 60604"
}