{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/hospitality-leadership.aspx",
  "title": "\r\n\tHospitality Leadership | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Hospitality Leadership Hospitality Leadership Study hospitality in an industry hub Our Hospitality Leadership program will prepare you for a management career in a variety of hospitality industry segments, including hotels, restaurants, private clubs, meetings and events. Hospitality majors here benefit from a program that balances hospitality leadership courses with core business curriculum. As a hospitality major, you’ll have access to the school’s J. Willard and Alice S. Marriott Center for Student Development and Engagement. This center connects you with industry leaders, school alumni and students, and offers you highly-specialized career preparation and leadership development. The center is also available as a resource to help you successfully complete two internships, which are a requirement of the Hospitality Leadership program. Located on DePaul’s Loop Campus in downtown Chicago, the School of Hospitality and Sports Business​was recently named the most recognized hospitality program in Illinois in a recent Journal of Hospitality and Tourism Education study. Classes Coursework Event Sales and Service Food Servi​ce Management Global Distribution System Hospitality Service and Experience Management Hospitality Strategy Lodging Property Management Resources Major Requirements Schedule of Classes Department Website Minor offered Career Options Common Career Areas Food and Beverage Management Hotel Operations Meeting, Convention, and Event Planning and Delivery Private Club Operations and Administration 96% of Hospitality Leadership graduates were employed, continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program."
}