{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/business-administration-baps.aspx",
  "title": "\r\n\tBusiness Administration (BAPS) For Adult Students | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Business Administration (BAPS) For Adult Students Business Administration (BAPS) For Adult Students Lead by connecting business ideas with action The Bachelor of Arts in Professional Studies with a major in Business Administration (BAPS) program is designed for adult students who aim to advance to leadership or managerial positions in the workforce. Our business administration degree for adults offers a practical business curriculum that provides you with exposure to a variety of functional areas such as technology, project management, marketing and operations. Based on transferable credit or credit earned through an assessment of your prior learning from personal and professional experience, you may be able to earn your BAPS degree in two years. Our professors are leaders in their fields and are committed to teaching and mentoring adult students. With our dedicated adult student advisors, you’ll have the road map and resources you’ll need to succeed — during your studies and after graduation. Online Degree Options If you’re an adult looking to earn your bachelor’s degree to advance to managerial positions in business, our online Bachelor of Arts degree in Professional Studies (BAPS) with a major in Business Administration is an excellent pathway. The adult focus of DePaul’s School of Continuing and Professional Studies (SCPS) and our online learning leadership combine to create flexibility that fits your life. And with a generous credit transfer policy and the option to earn academic credit for life and career experience, you could earn this degree in as few as two years fully online. Classes Coursework Project Management Communication Accounting and Finance Financial Planning Data Science Entrepreneurship Ethics Resources Major Requirements Schedule of Classes College Website Combined bachelor's + master's degree offered Career Options Common Career Areas Advertising Banking Brand/product management Business development and management Insurance Marketing Real Estate Sales Get more information Complete the form below to receive more information about this degree program."
}