{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/music-performance.aspx",
  "title": "\r\n\tMusic Performance | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Music Performance Music Performance Perfect your musical performance proficiencies The Music Performance program combines coursework and musical instruction with performance experience in both large and small ensembles. Performance programs include bass, bassoon,cello, clarinet, flute, guitar, horn, oboe, percussion, piano, saxophone, trombone, trumpet, tuba, viola, violin and voice. As a Music Performance major, you will have opportunities to perform in many of Chicago's most famous music venues, including the Symphony Center, the Merle Reskin Theatre and the Jay Pritzker Pavilion in Millennium Park. The School of Music produces more than 300 public performances each year, giving you performance experience that will prepare you for your career. Living in Chicago, you’ll be able to hear live, professional contemporary music performances, such as the Chicago Symphony Orchestra and the Lyric Opera of Chicago. You’ll also be able to attend concerts of every genre, including popular music festivals like Lollapalooza and Pitchfork. Classes Coursework Brass Concepts Chamber Music Large Ensemble Orchestral Repertoire Piano Literature String Pedagogy Vocal Coaching Resources Major Requirements Schedule of Classes Department Website Concentrations/Tracks Brass Guitar Percussion Piano String Bass Violin, Viola, Cello Voice Woodwinds Combined bachelor's + master's degree offered Career Options Common Career Areas Arranging Composing Music education Music editing Music production Performance Recording Get more information Complete the form below to receive more information about this degree program."
}