{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/finance.aspx",
  "title": "\r\n\tFinance | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Finance Finance Learn to forecast futures in finance DePaul’s undergraduate Finance degree will provide you with a solid foundation in financial management and an understanding of public and private financial processes, financial markets, analysis and investments. Core curriculum focuses on banking and financial services, investment analysis/management, corporate finance management, risk management and qualitative reasoning. Our faculty of scholars and experienced professionals emphasize real-world learning. You’ll also benefit from facilities, such as the Finance Lab virtual trading room, as well as centers in behavioral finance, risk management and financial services, which connect you and our faculty to the finance industry. If you’re interested in the Finance Honors Program, you may apply during your junior year and, if admitted, will begin honors courses in spring quarter of your junior year. DePaul’s Driehaus College of Business is located in downtown Chicago, in the heart of the city’s financial district, providing you with countless opportunities to intern and work professionally with leading firms in the finance industry. You are encouraged to complete an internship with a Chicago-area business during the summer preceding either your junior or senior year. Classes Coursework Banking and Financial Services Corporate Financial Management Financial Statements Analysis Investment Analysis/Management Investment Theory and Practice Money and Banking Quantitative Reasoning Risk Management Resources Major Requirements Schedule of Classes Department Website Concentrations/Tracks Banking Corporate Finance Investment/Financial Analysis Risk Management Minor offered Combined bachelor's + master's degree offered Career Options Common Career Areas Banking Budget analysis Consulting Financial advising Financial analysis International business Investment operations Investor relations Market research Portfolio management 94% of Finance graduates were employed, continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program."
}