{
  "url": "https://www.depaul.edu/distinctions/Pages/business-of-sustainability.aspx",
  "title": "\r\n\t|  Distinctions  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "The Business of Sustainability: Making a Difference The profile of students in the MBA in Sustainable Management—inquisitive, imaginative, eco-ambitious—applies equally to undergraduates in the Environmental Science and Environmental Studies programs. Before beginning graduate school, Mike Cody knew two things: “I wanted to start a business that would leverage my skills and interests—I used to be a chef, and I’m a big dog lover—and I wanted to make a positive impact on the environment. That’s what I wanted, and that’s what I got with the Sustainable Management [MBA concentration].” As an MBA in Sustainable Management student, Cody learned about Asian carp, the invasive fish that’s decimating the food sources of native species in the Midwest. Because they have no natural predators in North America, the carp are virtually impossible to eradicate, according to the National Wildlife Federation, which warns that it’s crucial to prevent the carp from entering the Great Lakes. “When I heard about the carp something clicked,” Cody recalls. “Could there be a commercial market for the fish? The carp is actually a tasty, low-fat source of omega-3 proteins, so I tested recipes for an all-natural dog treat using the fish as the main ingredient. My dogs loved it!” Now, as the CEO of BareItAll PetFoods, Cody expects to use thousands of pounds of carp each month as the business takes off. “Because I was in the program, a lot of ideas fell into place,” he says. “I was drawn to DePaul because its entrepreneurial approach is ranked among the top in the world. Plus, the sustainability focus was a natural fit for me. The program prepared me to be innovative, to open a business, and to run a business—all in pursuit of work I valued and could believe in.” Teaching Students How to Bring About Change “Our students are passionate,” says Jim Montgomery, an associate professor in environmental science and co-chair of the DePaul Sustainability Network. “For that reason, we don’t take a ‘sage on the stage’ approach to teaching; we’re more like sherpas, providing guidance and support to people who are already on a values-driven quest.” And that’s the point, says Ron Nahser, Senior Wicklander Fellow, Institute for Business and Professional Ethics, Driehaus College of Business: “We’re not teaching our students how to do a job; we’re teaching them how to bring about change. We’ve succeeded if our graduates say ‘my education gave me a new way to think and to engage with others.’ In the program, our approach is ‘pragmatic inquiry,’ which is a method of reflection to drive performance in oneself, in an organization, and in civil society.” The profile of students in the MBA in Sustainable Management—inquisitive, imaginative, eco-ambitious—applies equally to undergraduates in the Environmental Science and Environmental Studies programs. Andy Chae (BA, ’13) was in the right place, at the right time, when DePaul launched the urban agriculture program. “I was interested in urban farming, but knew it would be a hard way to make a living,” he says. “At DePaul I found a real business model for urban farming, one built on the three pillars of sustainability: the environment, the community, and the economy. I was able to experiment without risk, and my teachers gave me confidence that I could actually succeed.” As an undergrad, Chae helped start the DePaul Urban Farming Organization, which he says encouraged his environmental activism and entrepreneurialism. He also worked at the Gary Comer Youth Center, where he learned the “ins and outs” of managing an urban farm. “Through these experiences, I learned to take a professional approach to urban farming,” he says. “And I began to see that urban farming is a way to revitalize a city.” “DePaul students focused on sustainability are succeeding in the real world because they take the long view: They know that change is a slow, but rewarding, process.” Barb Willard, Department of Environmental Science and Studies Within one year of graduation, Chae opened Fisheye Farms in Detroit, a for-profit urban farm with two parts: growing organic fruits and vegetables that are sold in the community, at farmers’ markets, and to restaurants; and hosting events, from weddings and conferences to job fairs and community meetings. “We’re participating in the resurgence of Detroit, and that’s exciting,” Chae says. “Urban farming is a sustainable lifestyle, and I’m trying to get the message out to like-minded people.” When Rob Buelow (BA ’11) was an undergraduate, he spent time working as a manager at Middlebury Farms, a 20-acre, community-supported organic farm in Barrington, IL. “This experience, coupled with my classwork, really sparked my interest in urban farming,” he says. Now, Buelow works for Gordon Food Service, a broad line food distributor which is trying to bring the principles of sustainability to its part of the industry. “I’m looking five years down the road, while gaining skills in as many food-related areas as possible: I want to know all about the business of food production and distribution, because this is one way to follow my passion for urban agriculture,” he says. “Our students have many opportunities to go out in the field, to do the work, to get their hands dirty,” adds Barb Willard, an associate professor and Communication Studies Chair and affiliate faculty appointment with the Department of Environmental Science and Studies. “By the time they graduate, whether with an MS or a BA, they have the skills, intellectual and physical, to create to healthy environments. DePaul students focused on sustainability are succeeding in the real world because they take the long view: They know that change is a slow, but rewarding, process.” ■ Learn what makes DePaul Distinctive Global Health and Human Rights Find out why researchers are working to eliminate health disparities around the world. Protein Puzzles Discover how studying a protein may lead to curing and preventing Alzheimer's disease."
}