{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/sound-design.aspx",
  "title": "\r\n\tSound Design | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Sound Design Sound Design Sound design—a degree that resonates The Sound Design degree program prepares you to be a sound designer and sound engineer in the theatre and entertainment industries. You’ll learn how to edit, record and compose sound and music with hardware and software that is used by professionals. You’ll collaborate with directors, designers and production staff to gain experience translating sound design concepts into reality. In the program, you’ll learn from distinguished and award-winning faculty, many of whom are professional designers, artists and technicians. This degree also provides you with the opportunity to work as a sound designer and technician on public productions. The Theatre School presents each season. In your fourth year of the degree program, you will have the opportunity to do an internship in the sound design industry that is tailored toward your interests, such as musical theatre, outdoor sound design, or recording. You will also have the chance to take part in the annual Graduate Showcase, where you will present your portfolio to artistic and technical directors, and other members of the theatre, film, television and music industries. Classes Coursework Design Production History of Dramatic Literature Sound Technology Technical Collaboration Technical Drawing Theatre Crew Resources Major Requirements Schedule of Classes Department Website Combined bachelor's + master's degree offered Career Options Common Career Areas Composition using hardware and software Film sound-effects editor Live sound mixer Sound editing Studio engineering Theatre sound engineering Get more information Complete the form below to receive more information about this degree program."
}