{
  "url": "https://www.depaul.edu/admission-and-aid/types-of-admission/transfer-student/for-advisors/Pages/illinois-articulation-initiative.aspx",
  "title": "\r\n\tIllinois Articulation Initiative  |  For Advisors  |  Transfer Student  |  Types of Admission  |  Admission & Aid  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Transfer Student Prepare to Transfer Transferring Your Courses Meet Your Transfer Counselor DePaul Admission Partnership Program University Center Partnerships For AdvisorsIllinois Articulation InitiativeTransfer Agreements Illinois Articulation Initiative Transfer Agreements Apply Online Request Info Visit Campus DePaul University>Admission & Aid>Types of Admission>Transfer Student>For Advisors>Illinois Articulation Initiative Illinois Articulation Initiative DePaul participates in a state-wide agreement with more than 100 colleges in Illinois that aims at making transferring a smooth process — called the Illinois Articulation Initiative (IAI). DePaul participates in Phase I of the General Education Core Curriculum of the Illinois Articulation Initiative (IAI-GECC), which enables students to apply Illinois community college core courses toward a DePaul bachelor's degree. Completion of the IAI-GECC at any participating college or university ensures that most of the lower-division General Education requirements at DePaul have been satisfied. Participation Requirements Students who complete the IAI-GECC also have to meet the following mission-specific requirements at DePaul to fulfill Liberal Studies Requirements: Experiential Learning course Senior Year Capstone course Two Philosophical Inquiry requirements Two Religious Dimension courses Students who do not successfully complete the IAI-GECC will have their transfer courses reviewed on a course-by-course basis. School of Continuing and Professional Studies The School of Continuing and Professional Studies (SCPS) is a unique college at DePaul with degree programs designed for adult students. There are policies in place that help adult transfer students from Illinois community colleges who have completed the IAI-GECC package make a smooth transition into any of the SCPS degree programs. General Education Core Curriculum FAQ How do students get detailed information about transferring the IAI-GECC to DePaul? 1. Read about the IAI/GECC categories.2. See the list of participating institutions in Illinois.3. Check your community college catalog for detailed IAI information.4. Get completion of the IAI-GECC confirmed by your community college.5. Transferology™ (formerly u.select) will give you quick answers on how your college credits will transfer to DePaul. Set up an account, add your coursework and get your results immediately. See which classes at Illinois colleges have been approved for the IAI-GECC. Courses approved for all schools (including DePaul) can be found here on the IAI-GECC Transfer Planning Worksheet. If a student transfers a completed IAI-GECC package, will they have junior status at DePaul? Class standing in the traditional programs at DePaul is determined by how many credits a student transfers in, while in the School of Continuing and Professional Studies it is determined by how many competencies have been fulfilled prior to transfer. Completion of the IAI-GECC means that 12-13 courses are completed, earning anywhere from 36-42 semester credits or 54-63 quarter credits. Junior standing at DePaul is granted when students have earned 88 quarter/59 semester credits. So if a student transfers after only completing the IAI-GECC, they will typically need to take 25-31 more credits before reaching junior standing. If I combine out-of-state courses with IAI courses at a community college, what will happen when I transfer to DePaul? This is not uncommon, since many students transfer to DePaul with credit from more than one institution. DePaul will apply your courses to the DePaul Liberal Studies Program requirements. For students transferring into SCPS, courses will be applied to competence requirements. How do students get confirmation that the IAI-GECC has been completed? Some colleges automatically confirm thatthe IAI-GECC has been completed with a letter or a stamp on the transcript. Other colleges require that students request the confirmation when they want to transfer or when they are applying for graduation with an associate of arts/science degree. Students may also be required to check the catalog and use web tools to confirm that the IAI-GECC is completed. Please contact your community college academic advisor for more information. Can students transfer to DePaul if they have NOT completed the IAI-GECC? Yes. Can a student transfer to DePaul if they have NOT completed the IAI-GECC? Yes. DePaul has courses approved for the IAI-GECC. Find them on this website:iTransfer Participating Institutions. Liberal Studies Program FAQ What is DePaul's Liberal Studies Program? Liberal Studies Requirements = General Education Requirements. DePaul divides its Liberal Studies into the First Year Requirements, Learning Domains, Seminar on Multiculturalism in the United States, Junior Experiential Learning and Senior Capstone. First Year Program Discover Chicago Focal Point Composition and Rhetoric I Composition and Rhetoric II Quantitative Reasoning & Technological Literacy I Quantitative Reasoning & Technological Literacy II Learning Domains– Categories within the Liberal Studies Program. Typically are many courses at the community college to choose from to fulfill these categories. The Learning Domains are: A&L:Arts and Literature PI:Philosophical Inquiry RD:Religious Dimensions (Ethical Questions and Religious Traditions) SI:Scientific Inquiry (Quantitative, Lab and Elective) HI:Historical Inquiry M&C:Match and Computing SCBI:Social, Cultural, and Behavioral Inquiry Note how many courses are required in a Learning Domain (category). This may vary depending on the major at DePaul. Pay attention as to whether there are special Learning Domain requirements. For example, many majors require a special ethics course in the Religious Dimensions Learning Domain, like \"The Computer and Social Responsibility.\"Learn more. How do students get confirmation that the IAI-GECC has been completed? Some colleges automatically confirm thatthe IAI-GECC has been completed with a letter or a stamp on the transcript. Other colleges require that students request the confirmation when they want to transfer or when they are applying for graduation with an associate of arts/science degree. Students may also be required to check the catalog and use web tools to confirm that the IAI-GECC is completed. Please contact your community college academic advisor for more information. Can students transfer to DePaul if they have NOT completed the IAI-GECC? Yes. Are the Liberal Studies and IAI-GECC requirements very different? Sometime yes, sometimes no. The DePaul Liberal Studies have differences depending on the major. If a student has completed the IAI-GECC, can they change their mind at the time of transfer and follow DePaul Liberal Studies requirements? Yes. A DePaul advisor will help make this happen if that is needed. After a student transfers to DePaul, why do they need to take more Liberal Studies courses? DePaul is a private Catholic university that requires all undergraduate students to take courses in religion and philosophy. The IAI-GECC doesn't require these types of courses, though there might be some available at community colleges. Also, DePaul is taught on a quarter system, which means that students complete more courses each academic year than in the semester model. The extra courses are needed in order for students to have enough credits to graduate from DePaul. Transferring Associate Degrees FAQ Does transferring in an associate of arts/science degree grant junior standing? Junior standing is based on the number of credits completed;these degrees will include enough credits for junior standing. Junior standing is granted to students who have earned 60 semester hours of transferrable credit. If a student completes an associate of applied science degree, have they completed the IAI-GECC? Probably not. These degrees usually include 3-6 general education courses, and therefore the IAI-GECC is not completed. If a student completes an associate of arts/science, have they completed the IAI-GECC? Probably. The IAI-GECC is built into all associate of arts/science degrees in Illinois. However, if your associate degree includes out-of-state courses, then the IAI-GECC may not have been completed. Your community college will have to confirm whether the GECC has been met with IAI approved coursework."
}