{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/economics-bsb.aspx",
  "title": "\r\n\tEconomics (BSB) | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Economics BSB Economics BSB Establish major economic knowledge As an Economics major, you’ll learn how to think about behaviors and problems that exist in an economy. You’ll also learn how to analyze economic data to identify and address these problems. Economics majors develop theoretical, quantitative and analytical skills that complement and enhance what you’ll learn in other business disciplines in the Driehaus College of Business. Our faculty members are productive scholars and respected instructors. They publish in prominent journals and devote considerable time to you, both inside and outside the classroom, to support your success. This allows them to reinforce your practical knowledge of economics, as well as provide valuable contacts for career opportunities. Choose from one of the following three specializations: International Focus Public Policy and Pre-Law Quantitative Economics The Economics Department also offers an Honors Track which allows you to focus more heavily on your quantitative and writing skills. Classes Coursework Econometrics Environmental Economics Game Theory Governmental Regulation of Business Health Economics International Economics Labor Markets Law and Economics Money and Banking Sports Economics Urban Economics Resources Major Requirements Schedule of Classes Department Website Concentrations/Tracks Regular Honors Minor offered Combined bachelor's + master's degree offered Career Options Common Career Areas Banking Consulting Financial advisor Financial risk analysis Government and nonprofit work Insurance Law Research analysis 94% of Economics graduates were employed, continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program."
}