{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/chinese-studies.aspx",
  "title": "\r\n\tChinese Studies | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Chinese Studies Chinese Studies Build fluency in Chinese language and culture The Chinese Studies program focuses on developing your ability to speak Mandarin Chinese and understand Chinese society and culture. Twenty percent of the global population speaks Chinese, making it the most-spoken language in the world. Having the ability to speak and understand Chinese will make you a marketable candidate in a variety of professional fields, such as business, consulting or politics. As a Chinese Studies major, you’ll have the opportunity to participate in one of DePaul’s Study Abroad programs in Beijing, Hong Kong or Shanghai, where you’ll experience and immerse yourself in Chinese language and culture. We also offer the 3+3 BA/JD program, which allows high-achieving first-year undergraduate students to be admitted simultaneously to the College of Liberal Arts and Social Sciences (LAS) and the College of Law (LAW). You’ll complete your first three years in LAS and your final three years in LAW. Classes Coursework Chinese Language Chinese Art Chinese Politics Chinese Calligraphy Literature and Religion in China The Rise of Modern China Understanding China’s Economy Resources Major Requirements Schedule of Classes College Website Minor offered Combined bachelor’s + master’s degree offered Career Options Common Career Areas Public policy International business Translation services Immigration work Social services Law Human rights 84% of Chinese Studies graduates were employed, continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program."
}