{
  "url": "https://offices.depaul.edu/global-engagement/student-resources/study-abroad/Pages/default.aspx",
  "title": "\r\n\tStudy Abroad  |  Student Resources  |  Global Engagement | DePaul University, Chicago\r\n",
  "content": "Study Abroad Log In Search for DePaul Programs For Students For Parents & Family Financial Aid & Scholarships Health, Safety, & Travel Student Stories Policies Staff Directory External Study Abroad Global Engagement>Student Resources>Study Abroad Study Abroad Provides DePaul students with a diverse set of education abroad offerings, ranging in duration, cost, program type, cross-cultural engagement and academic discipline. Applications are open Apply byMay 1forDecember 2025,Winter&Winter-Spring 2026programs! Quick Links Office Hours LPC:Monday - Friday: 9:00 AM - 5:00 PMVirtual Office:Monday - Friday: 9:00 AM - 5:00 PMLoop Office:Closed to walk-ins; Document drop-off in Suite 9300, 1 E. Jackson Blvd. Events Feb 28An Evening with Mary Robinson, former President of IrelandJoin us for a conversation with Mary Robinson, former President of Ireland and former UN High Commissioner for Human Rights, in connection with her donation of her collection...McGowan South5pmI'm Interested Mar 3 - May 26International Student Support Group (Loop)International Student Support Group: A space of support for international students to connect and share their experiences, receive and offer encouragement with others around...DePaul Center (DPC)3pmI'm Interested Apr 7Practicing Hospitality: Faith & Belonging in the Latino Midwest:: RSVP required via Eventbrite :: 6:00pm Dinner for in-person guests 6:30pm Livestreamed discussion begins; URL will be available closer to the event...Student Center (Lincoln Park)6pmI'm Interested Apr 11Global Learning Experience (GLE): Faculty Info SessionIf you are new to the idea of virtual exchange and want to know more about it, please consider attending this virtual information session, in which details about DePaul's...12pmI'm Interested Apr 17GFC/ GLE Informational SessionDo you have a love for global experiences? Are you curious about cultures outside your own and connecting with students across the world? If you are interested in learning...2pmI'm Interested View all events... Connect With Us on Facebookon Xon Instagramon YouTube Apply by February 8 | 2024 Summer Chile & Argentina: Entrepreneurship & Sustainability in the Southern Cone FY@broad Australia: Community-Engaged Service Learning(first-year students only) FY@broad England: Charles Darwin & the Revolution Over Evolution(first-year students only) Germany & Austria: History, Memory, & the Refugee Experience Iceland, Denmark, & Sweden: Sustainability in Action Northern Ireland: Peace and Conflict Resolution(graduate students only) Rwanda & Tanzania: Post-Conflict Justice Immersion Program(laws students only) Shanghai: Summer Intensive Chinese Language Program Spain: Research Experience - From Atoms to Ecosystems, Science is Global Apply by February 15 | 2024 Fall & Academic Year 24-25 Athens: The College Year in Athens (CYA) Experience Australia: Australian Catholic University Exchange Budapest: Studies in Commerce, Society and Culture in Eastern Europe Cork: Study at University College Cork France: Study at Sciences Po (Exchange) London: Study and Internships at University of Westminster Madrid: Spanish Language, Culture, and Internship Apply for a Virtual Internship Abroad Gain professional and international experience through a virtual internship abroad. Students will build skills for success in today’s global, digital workforce.Priority Deadline: May 4 & Final deadline: May 11."
}