{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/catholic-studies.aspx",
  "title": "\r\n\tCatholic Studies | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Catholic Studies Catholic Studies Discover the heritage of Catholic intellectual thought The Catholic Studies program will provide you with an informed understanding and appreciation of the depth and breadth of the Catholic tradition and its unique contribution to society—past and present. In our rigorous, interdisciplinary program, you’ll explore Roman Catholicism as a religious and cultural reality that expresses and motivates multiple forms of human expression. As a Catholic Studies major, you'll be taught by faculty members who are experts in the study of Catholicism as well as other disciplines, including: artists, economists, historians, literary critics, musicians, political scientists and sociologists, as well as philosophers and theologians. Chicago has one of the largest Catholic populations in the United States and a rich theological, pastoral, ethnic, architectural, artistic and musical heritage for you to experience firsthand. You'll have a wide array of resources at your fingertips. OurCenter for World Catholicism and Intercultural Theology, an internationally renowned research institute, focuses on Catholicism around the world. And ourVincentian Studies Instituteis the leading center in the world for the study of the Vincentian tradition. Catholic Studies majors also have the opportunity to choose one of two study-abroad programs in Italy and to take selected courses at the Catholic Theological Union in Chicago. Along with Catholic Campus Ministry, we support theCatholic Learning Community, which helps you explore the spiritual, academic and service aspects of your faith. Classes Coursework Catholicism and Literature Catholicism in Africa Catholics and Scripture Contemporary Moral Issues: Happiness Introduction to Catholicism The Life and Times of Vincent de Paul Love in the Christian Tradition Nature, Cosmos, and God: Catholicism and Science Resources Major Requirements Schedule of Classes College Website Minor offered Career Options Common Career Areas Social justice advocacy Journalism Ministry work and leadership Education Nonprofit work 93% of Catholic Studies graduates were employed, continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program."
}