{
  "url": "https://www.depaul.edu/admission-and-aid/financial-aid/maintain-eligibility/Pages/limits-maximums.aspx",
  "title": "\r\n\tLifetime Limits and Aggregate Maximums for Financial Aid  |  Maintain Eligibility  |  Financial Aid  |  Admission & Aid  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Financial Aid Financial Aid Basics Types of Aid Receive Aid Maintain EligibilitySatisfactory Academic Progress (SAP) PolicyReturn Title IV AidWithdrawal from ClassesFinancial Aid Terms & ConditionsLimits & Maximums Satisfactory Academic Progress (SAP) Policy Return Title IV Aid Withdrawal from Classes Financial Aid Terms & Conditions Limits & Maximums Manage Costs Repay Loans Resources for... Forms Contact Us Apply Online Request Info Visit Campus DePaul University>Admission & Aid>Financial Aid>Maintain Eligibility>Limits & Maximums Lifetime Limits and Aggregate Maximums for Financial Aid All financial aid recipients are required to comply with thesatisfactory academic progress policyand meet all federal eligibility requirements in order to establish and maintain eligibility for federal, state and need-based institutional financial aid. Scholarship recipients must also meet the specific eligibility requirements of the scholarships received. Most financial aid programs have annual and/or lifetime eligibility limits. Aggregate/lifetime limit: lifetime eligibility usage (Pell LEU) Equivalent of six years Visit \"Calculating Lifetime Pell Eligibility Used\" Aggregate/lifetime limit: lifetime eligibility usage (LEU) Equivalent of six years LEU is calculated by Federal Student Aid – similar to the Pell LEU calculation. Annual and aggregate/lifetime limits Visit \"Subsidized and Unsubsidized Loans\". If you are nearing or have reached your lifetime limits, you may wish to also review ourFederal Direct Loan Debt Review FAQ. Annual limit equal to your total cost of attendance (COA) minus any other financial aid received No aggregate (cumulative) lifetime loan limit** Annual and lifetime limits Visit \"TEACH grants\" Aggregate/lifetime limit (MAP Paid Credit Hours) Equivalent of four and a half years ** While there are no set aggregate limits on the Federal Direct Grad PLUS loan, the Office of Financial Aid reserves the right to limit or refuse certification of future federal student loans on a case-by-case basis to limit excessive borrowing. Students have the right to appeal a decision to limit or refuse certification of future borrowing. More information on the appeal process is available in theFederal Direct Loan Debt Review FAQ."
}