{
  "url": "https://www.depaul.edu/admission-and-aid/types-of-admission/freshman-student/Pages/for-school-counselors.aspx",
  "title": "\r\n\tFor School Counselors  |  Freshman Student  |  Types of Admission  |  Admission & Aid  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Types of Admission Freshman StudentDeBlogsFor School Counselors DeBlogs For School Counselors Transfer Student Adult Undergraduate Student Graduate Student International Student Returning Student Visiting Undergraduate Student Non-Degree Student Apply Online Request Info Visit Campus DePaul University>Admission & Aid>Types of Admission>Freshman Student>For School Counselors For School Counselors Information for your DePaul applicants We understand the important role you play in helping your students apply to college—and we know how busy you are. Here, you’ll find important information for students considering DePaul. Freshman Application Guidelines Admission decisions at DePaul are based on a strong academic record, as well as personal and occupational achievements, ambition, energy, resourcefulness and leadership. We recognize that each individual brings unique abilities to the DePaul community, so we perform a holistic review of a student’s application. We require the following: Common Application Transcript Counselor Recommendation Personal Essay (recommended) Audition/interview (for School of Music and The Theatre School) Creative Portfolio and Creative Statement (for Animation majors) Test Scores ACT vs. SAT We have no preference of one test over the other.Beginning with applications for the Winter 2018-19 quarter, we will accept self-reported test scores from freshman applicants. Freshman applicants can list test scores on their Common App, and these will fulfill the test requirement for those students submitting test scores. Students also will have the option to add self-reported test scores through Blue Demon Domain, the students’ application portal, throughout their application process. All freshmen that are admitted and ultimately choose to enroll at DePaul, including test-optional applicants,* will need to submit official test scores prior to the start of their entry term. These can be sent directly from the testing agency, on an official transcript, or sent from you, their school counselor. *Scores from test-optional students are used for research purposes only. Test optional: Who should consider this application process? Students who have a strong academic record demonstrated by above average grades in challenging courses such as AP, IB and Honors level, but don't feel their test results are a good reflection of their academic performance, can choosenot tosubmit them. Once a student submits their application, however, they will be unable to change to the other option. Learn more aboutapplying Test-Optional. Advantages of Applying Early Action receive an admission decision that is non-binding be notified of an admission decision by December 15 get the strongest consideration for academic scholarships be able to apply early for on-campus housing (allowing them to give their preference of residence hall and roommate if they wish) receive information about orientation, advising and registration before those who apply Regular Decision Important Dates Oct. 1 Free Application for Federal Student Aid (FAFSA) opens Nov. 15 Early Action Application deadline Dec. 1 Music School Application deadline Dec. 1 Theatre School Application deadline – Acting and Stage Management Majors Dec. 15 Early Action Application notification date Feb. 1 Regular Decision Application deadline Feb. 1 Theatre School Application deadline Mar. 15 Regular Decision notification date Apr. 1 Music and Theatre decision notifications Jun. 1* Tuition Deposit deadline Due to the 2024 FAFSA delays from the Department of Education, and to make sure everyone has enough time to consider their options, DePaul has pushed back this year’s decision deadline to June 1, 2024. Campus Visit and Tour Explore ways to connect with usin virtual and limited on-campus visits. Learn more about our campuses, student life and the admission process. Community College Advisors New Partnership. New Path Forward. DePaul, in a partnership with Harold Washington College (HWC), will offer the DePaul Harold Washington Academy—an exciting new path for Chicago Star Scholars to earn their undergraduate degree from DePaul. Students will take associate degree classes taught by HWC faculty at DePaul’s downtown campus, and earn an Associate of Arts degree from HWC. They’ll also have full access to a wide range of DePaul student perks, including the Student Center, libraries, career and advising services, and tutoring. Once students have earned their Associate of Arts degree from HWC, they’ll then get accepted to DePaul to complete their bachelor’s degree. Resources Find your student’s DePaul Admission Counselor Credit Given by Exam(AP/IB Credits) Scholarships(including new Catholic Heritage Scholarship and Chicago Promise Scholarship) Counselor Clips Intersect by PowerSchool Slate.org Update Info Form(for students who need to change important information on their application) Contact Information If you have questions, suggestions or feedback, please contact us: Office of Undergraduate AdmissionDePaul Center1 E. Jackson Blvd.Chicago, IL 60604 Phone(312) 362-8300or toll-free(800) 4DePAULoutside Illinois Emailadmission@depaul.edu The School of MusicOffice of Admission804 W. Belden Ave.Chicago, IL 60614 Phone(773) 325-7260 Emailmusicadmissions@depaul.edu The Theatre SchoolOffice of Admission2350 N. Racine Ave.Chicago, IL 60614 Phone(773) 325-7999 Emailtheatreadmissions@depaul.edu"
}