{
  "url": "https://www.depaul.edu/admission-and-aid/types-of-admission/freshman-student/Pages/cdm-animation.aspx",
  "title": "\r\n\tAdditional Admission Requirements for Animation and Film and Television Majors  |  Freshman Student  |  Types of Admission  |  Admission & Aid  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Types of Admission Freshman StudentDeBlogsFor School Counselors DeBlogs For School Counselors Transfer Student Adult Undergraduate Student Graduate Student International Student Returning Student Visiting Undergraduate Student Non-Degree Student Apply Online Request Info Visit Campus DePaul University>Admission & Aid>Types of Admission>Freshman Student>Additional Admission Requirements for Animation and Film and Television Majors Additional Admission Requirements for Animation and Film and Television Majors ​​Students applying to enter the Animation BA, Animation BFA, Film and Television BA, and Film and Television BFA have additional requirements beyond those required for all incoming DePaul undergraduates. Animation(BA and BFA) applicants are required to submit a Creative Statement and Creative Portfolio. Film and Television(BA and BFA) applicants are required to submit a Creative Statement only. The submission of a Creative Portfolio is strongly encouraged but not required. Current DePaul students in other majors may switch into the Animation or Film and Television program with permission from an SCA faculty advisor. Creative Statement Required for Animation and Film and Television applicants.One to one and a half pages. Address the following questions: What are your creative inspirations? Why do you want to study animation/film and​ television? Why are you applying to DePaul? Creative Portfolio Required for Animation applicants; strongly encouraged for Film and Television applicants. The Creative Portfolio is a collection of examples that demonstrate your creativity and interests. Your work will be evaluated on its ideas and potential, not budget or production values. No previous animation, film, or television experience is required for acceptance (we can teach you that!). Your Creative Portfolio should include at least one of the following: Still images: 5-10 examples. These may include: drawings, comics, sketches, doodles, digital art, designs, photography, storyboards, cartoons, paintings, illustrations, character designs, 3D renders, etc. You can also include photos of your ceramics, costumes, sculptures, dioramas, sets, puppets or any other art form. Video Sample: One video, no longer than 3 minutes. This can be a short film, an excerpt of a short film, clips from various projects. The video can be live action, animation, documentary, experimental or a sample of game design. For stills and video submissions, please include the following text information: Title of the work Year completed A brief description of the work or the excerpt your role/s in the creation of the work Writing Samples: Total submission limited to 3 pages. Short stories, poetry, journalism, or screenplays. Website Links: You may submit a web link if the website is an example of your creative output and design. Please describe what we should be looking at on the site. (For example: a page of web-specific art, an online game that you designed, etc). Do not simply send the link to your personal website, we will not comb through the entire site for material or watch all of the links. Please note: If generative AI tools such as Midjourney, Stable Diffusion, or DALL-E were used in the creation of work in your portfolio you must describe what programs were used, and describe your creative input, reasoning, and process. AI-assisted work will be accepted as part of your portfolio, but at least half of your artwork must be created without generative AI contributions. These items may be submitted throughBlue Demon Domain(your application and next steps portal)"
}