{
  "url": "https://www.depaul.edu/admission-and-aid/financial-aid/manage-costs/Pages/default.aspx",
  "title": "\r\n\tManage Costs  |  Financial Aid  |  Admission & Aid  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Financial Aid Financial Aid Basics Types of Aid Receive Aid Maintain Eligibility Manage CostsPayment PlansNet Price Calculator Payment Plans Net Price Calculator Repay Loans Resources for... Forms Contact Us Apply Online Request Info Visit Campus DePaul University>Admission & Aid>Financial Aid>Manage Costs Manage Costs You can control your educational costs and reduce student loan borrowing by avoiding costly withdrawals and using DePaul's tuition package plan. Here are some suggestions: Use the savings in your tuition plan. Most full-time undergraduate students in traditional colleges are charged the same price whether they enroll in 12, 16 or 18 credit hours (tuition package plan). Planning your schedule wisely can save money and accelerate your time to degree. For example, taking 12 credit hours per quarter for one academic year will extend the time it takes you to graduate by at least one quarter, even if you are an excellent student. Graduate and professional students are chargedtuition ratesaccording to their program and number of hours enrolled. Use your academic planning tools. Avoid enrolling in courses that don’t apply to your degree by meeting with your academic advisor early and often to make sure you understand your program requirements. Use yourdegree progress reportto make good enrollment decisions. Most financial aid eligibility is based on projected full-time enrollment. If you receive grants, you may receive areduced amountif you enroll for fewer than 12 hours (15 hours for MAP grant). Loan programs are not typically reduced in this way—if you participate in the loan programs, try not to borrow more than you need, even if it’s offered to you. You can always request to reduce your loan amount. Avoid costly withdrawals. Withdrawing from courses after the last date to dropclasses without penaltydramatically increases the cost becauseit prolongs your education anddelays graduation. This could also affect your financialSatisfactory Academic Progressand impact future financial aid eligibility. Don't withdraw or drop courses if you can avoid it. If you are struggling in a coursetalk to your Academic Advisor.DePaul offers many tutoring and academic support resources free of charge, including for specific subjects, majors, and student populations. Consider the lifetime financial aid maximums. All financial aid programs have lifetime maximums. You can learn more about the maximums byvisiting Lifetime Limits and Aggregate Maximums for Financial Aid Programs. Government Assistance Programs. Students maybe eligible for programs that help with food, health insurance and rental assistance. Visit the Health and Human Services Website for more information about these programs."
}