{
  "url": "https://www.depaul.edu/distinctions/Pages/big-deal-big-data.aspx",
  "title": "\r\n\tThe Big Deal about Big Data  |  Distinctions  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "The Big Deal about Big Data ​Marina Girju, an assistant professor of marketing in the Richard H. Driehaus College of Business, knows all about crunching numbers—and about crunching peanuts and potato chips, too. Before joining DePaul in 2012, Girju worked for TNS (a leader in consumer market research) as a data analyst. Her job for the company’s client, Frito-Lay, was to study the data generated by thousands of U.S. consumers who recorded the what, how, when, why, where, and with whom of each snack they ate over a two-week period. In total, more than 300 variables were tracked over several years. At the end of the study, Frito-Lay had one thing for sure: big data. “In empirical modeling, the larger the data sets, the better.” Marina Girju, marketing assistant professor, DePaul University Empirical modeling is the statistical interpretation of data to describe the behavior of organizations or individuals. The data used in modeling can come from just about any place: point-of-sale transactions, consumption or usage diaries, blogs and social media. Making sense of ever-mounting piles of data is a challenge for organizations in every industry. Girju explains that in the past only a few large companies could afford the technology and manpower to generate big data sets. But in the past 10 years, computing power got much, much cheaper, and consumers became happy—eager, even—to share information about themselves and their habits. Consumption Data Sets “So now, big data is everywhere, and the new question is ‘How can it be wrangled to gain insights?’ That’s what everyone wants to know,” she says. Manufacturers count on big data to drive innovation and strategy. For example, Frito-Lay used Girju’s research to ask a few important questions: How will changing demographics affect snack consumption five or 10 years from now? Which snacks will become more or less popular? Will entire snack categories grow or shrink? With the answers, the company could make rational, informed decisions about investments in specific products and snack categories. At the same time, retailers use big data to decide how much shelf space to allocate to each category. For example, Frito-Lay could use real evidence to show Wal-Mart that the “nuts and seeds” category was growing and should, therefore, have a larger, more prominent display in the store. “I’ve yet to find a single company, in any industry, that wouldn’t like to know what’s going to happen in the future,” says Girju. Predictive Analytics “Predictive analytics is one of the most valuable parts of empirical modeling research, and it’s the reason I came to DePaul. Our programs give students cutting-edge skills in forecasting. Also, of particular interest in my work, DePaul has an extraordinary category management* program through our Center for Sales Leadership—from what I know, the most appreciated and valued program of its kind in the United States. As many as 20 big companies provide data for our students to analyze.” In her own research and in the classroom, Girju continues to explore and examine the connection between big data and business strategy, especially for consumer products companies. She gets her students, both undergraduate and graduate, excited about research and analytics by engaging them in real-world projects. For example, some enhance her research on snack foods by adding new data (such as nutritional information on brands sold in the U.S.) to product and category profiles. Others work on new projects, gathering and analyzing big data to help actual companies (participating as “clients”) find answers to pressing questions. ■ “The need and desire to make sense of big data is only going to grow, and our graduates are prepared for that challenge.” Marina Girju, marketing assistant professor, DePaul University Learn what makes DePaul Distinctive Global Health and Human Rights Find out why researchers are working to eliminate health disparities around the world. Protein Puzzles Discover how studying a protein may lead to curing and preventing Alzheimer’s disease."
}