{
  "url": "https://www.depaul.edu/distinctions/Pages/digital-youth-network-1.aspx",
  "title": "\r\n\t|  Distinctions  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Digital Youth Network: CDM and 21st Century Literacy DePaul professor Nichole Pinkard brings digital literacy to Chicago students. In 2006, Nicole Pinkard, a former associate professor, Jarvis College of Computing and Digital Media, received a $1.6 million grant from the MacArthur Foundation to study how digital media affects literacy. And she’s received grants each year since to continue her timely and important work. “Technology always makes it possible to communicate in new and different ways,” says Pinkard. “That was true with the invention of the printing press, and it’s true today with the emergence of new media. To be conscious, critical consumers of media, people need to know how technology frames what they’re seeing and learning. But even that’s not enough.” “A new literacy is emerging: digital literacy. The digitally literate are media producers—they participate in today’s global conversation.” Nicole Pinkard, former associate professor of Jarvis College of Computing and Digital Media, DePaul University As Pinkard is quick to point out, digital literacy doesn’t replace the traditional values: “For example, just think of what it takes to create a video: skill in writing, story construction, and critical analysis. The digitally literate know how a narrative flows, how it has a beginning, a middle, and an end.” In her research on the connections between digital media and literacy, Pinkard recognized the beginning of a new and quickly widening gap between the haves and the have-nots. “Jobs in journalism, entertainment, science, education, medicine, and business—they’re all starting to depend on interactive media. How will children from poor communities be able to compete in the future? I decided to find a solution to that potentially huge problem — and started the Digital Youth Network.” Closing the Gap Working with University of Chicago charter schools, the Digital Youth Network brings digital literacy to middle-school and high-school students in two ways. An after-school program allows the students to pursue their interests in particular areas, such as game design, graphic design, music production, or video production. A media arts class, taught by artist practitioners, gives sixth graders basic skills in digital literacy. The students create a record label, including writing lyrics and music, recording songs, making music videos, writing artist profiles, making podcasts, and designing logos. “Traditional educators can’t teach digital literacy—they’re simply not prepared, and they can’t keep up with the technology. So, our goal all along was to enable teachers to integrate new media into assignments without requiring them to be ‘digitally literate’ themselves.” Nicole Pinkard “After a student takes the media arts class from a practitioner, the teacher can fold these skills into a traditional curriculum. The students can represent their understanding of books in multiple ways. And they have the repertoire of skills to decide which media is the right choice for a given situation,” says Pinkard. Before launching the Digital Youth Network, Pinkard had compared the University of Chicago charter school students with those growing up in Silicon Valley: only four percent of beginning sixth graders from the charter schools had equal or more experiences in creating media. After participating in the media arts class, 76 percent of the charter students had more experience than did the advantaged students. By the end of eighth grade, 82 percent had more. “We’re closing the gap,” says Pinkard. In a related project, Pinkard collaborated with the Chicago Library to create YOUmedia, a learning space in which high school students make and produce digital artifacts, such as music, games, video, and virtual worlds — all grounded in the content of books. The bottom line: book circulation is substantially up. No wonder Chicago Public Radio named Nichole Pinkard one of Chicago’s Global Visionaries. ■ Learn what makes DePaul Distinctive Global Health and Human Rights Find out why researchers are working to eliminate health disparities around the world. Protein Puzzles Discover how studying a protein may lead to curing and preventing Alzheimer’s disease."
}