{
  "url": "https://www.depaul.edu/admission-and-aid/financial-aid/Pages/default.aspx",
  "title": "\r\n\tFinancial Aid  |  Admission & Aid  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Admission & Aid Types of Admission Visit DePaul Tuition Room & Board Scholarships Financial AidFinancial Aid BasicsTypes of AidReceive AidMaintain EligibilityManage CostsRepay LoansResources for...FormsContact Us Financial Aid Basics Types of Aid Receive Aid Maintain Eligibility Manage Costs Repay Loans Resources for... Forms Contact Us Veteran Student Test Credit & Placement Check Your Application Status Admitted Students Deadlines Immunization Apply Online Request Info Visit Campus DePaul University>Admission & Aid>Financial Aid Financial Aid Invest in your future $58,000,000 DePaul awards $58+ million in scholarships annually to new incoming freshmen 98% of our new incoming freshmen students receive a scholarship Financing Your Education A college education is a sound financial decision — in fact, people who graduate from a four-year university earn almost $1.1 million more in their lifetimes than those with a high school degree. As you would for any major investment, you’ll need to do some research and planning. We’re here to make applying for college financial aid easier. We're part of the College Cost Transparency Initiative. This means our financial aid offers contain sticker price, aid types and sources, what you pay and how to renew your aid. Our commitment to employ theprinciples and standardsof CCT underscores our dedication to promoting fairness, accessibility, and clarity in the financial aid process, ultimately contributing to a more equitable higher education landscape. In addition to the items above, as a member of the National Association of Student Financial Aid Administrators (NASFAA), DePaul also follows the standards established in NASFAA’sStatement of Ethical PrinciplesandCode of Conductfor Institutional Financial Aid Professionals. What are my options? Financing your degree will rely on two main types of financial aid: Gift Aid is money that you don’t need to repay, such asscholarshipsand need-basedgrants. Gift Aid is money that you don’t need to repay, such asscholarshipsand need-basedgrants. Self-Help assistance means you either work for aid or it must be repaid, such aswork-study programsandfederal loans. Self-Help assistance means you either work for aid or it must be repaid, such aswork-study programsandfederal loans. What do I need to do to be considered? Apply to DePauland be admitted Apply to DePauland be admitted Submit acompleted FAFSA Submit acompleted FAFSA Important Dates for Financial Aid December File FAFSA online ASAP when the 2025-26 application is available January FAFSA priority date for all students February​ Financial aid offer notices sent to admitted freshmen Already received your financial aid offer? Contact Us Every year we offer financial aid to thousands of students. Need help?Contact us! Additional Financial Aid Resources Scholarship Connect:Search DePaul’s database of external scholarships. Scholarship Connect:Search DePaul’s database of external scholarships. Financial Aid TV:Watch videos covering all aspects of financing your education, from eligibility to loan repayment. Financial Aid TV:Watch videos covering all aspects of financing your education, from eligibility to loan repayment. Net Price Calculator:Estimate what it will cost you to attend DePaul — including aid — as an incoming freshman. Net Price Calculator:Estimate what it will cost you to attend DePaul — including aid — as an incoming freshman."
}