{
  "url": "https://www.depaul.edu/about/administration/Pages/dance-barnes.aspx",
  "title": "\r\n\tSteph​anie Dance-Barnes, PhD | DePaul University, Chicago\r\n",
  "content": "About Rankings Campuses Chicago Events Mission President Administration Distinctions History & Timeline Accreditation & Licensure Apply Online Request Info Visit Campus DePaul University>About>Administration>Stephanie Dance-Barnes, PhD Stephanie Dance-Barnes, PhDDean, College of Science and HealthWebsite​ Stephanie Dance-Barnes, PhD Dean, College of Science and Health ​Dr. Steph​anie Dance-Barnes became dean of theCollege of Science and Health​on July 1, 2020. An expert in cancer biology and a leader in higher education, Dance-Barnes brings a wealth of experience to DePaul as an administrator, researcher and a champion for the liberal education approach to learning. She earned her PhD in Cancer Biology from Wake Forest University School of Medicine and conducted her postdoctoral work at the University of North Carolina at Chapel Hill at the Lineberger Comprehensive Cancer Center. Her current research utilizes genomics, genetics, cell culture and animal models to decipher the underlying biology of the molecular subtypes of breast cancer, and then using this biological information to develop therapies that are specifically targeted against distinct subtypes of breast cancer. Her cancer research focuses primarily on triple negative breast cancer, a molecularly heterogeneous disease whose incidence is disproportionately higher in African American women. Before joining DePaul, she served as an associate provost and dean of the University College and Lifelong Learning at Winston Salem State University. In this role, she oversaw an academic unit that provided WSSU students with tools and support that promote academic success, including advising, TRiO student support services, STEM Learning Center, Testing and Assessment Center, as well as the first-year experience and writing program. As a member of the provost’s senior team, she also provided administrative leadership, direction and evaluation for all academic activities and faculty affairs at the university. She also served as an active member of WSSU’s strategic planning leadership team. Dance-Barnes previously served as an associate professor in the Department of Biological Sciences and also as a former co-chair. She led efforts associated with the overhaul of the DBS curriculum. This included the re-design of the general biology lab, which increased student engagement, learning, and scientific efficacy; along with promoting opportunities that integrated undergraduate research across the curriculum. She was recognized as a 2019 Board of Governors Excellence in Teaching award recipient, as well as receiving the Insight into Diversity Leaders in STEM and American Association of Cancer Research Minority Serving Institution Faculty awards. In collaboration with Wake Forest University, she has secured both Department of Defense and NIH funding that promotes undergraduate cancer research. She also serves as the PI of a NSF-ITEST grant. This work exposes underrepresented minority 3rd-5th graders to STEM careers and promotes positive STEM identities via culturally relevant interventions. Additionally, she is the founder and director of the WSSU Women in Science Program, which was named the 2018 Inspiring Program in STEM by Insight into Diversity Magazine."
}