{
  "url": "https://www.depaul.edu/student-life/Pages/default.aspx",
  "title": "\r\n\tStudent Life at DePaul | DePaul University, Chicago\r\n",
  "content": "Student Life Home Sweet DePaul Going to school at DePaul means living in Chicago (or very close if you're commuting). And Chicago has endless opportunities to play and learn. It's definitely big, but it's also known for Midwestern friendliness, a strong sense of community, and its ethnic diversity, food and culture. Discover DePaul your way Here at DePaul, it’s not just about what you study. It’s also about the personal connections you make and the experiences you have outside the classroom. Take the Virtual Tour ​Explore campus with a virtual tour of our Lincoln Park and Loop campuses. Learn more about the places where you'll take classes, meet friends, work out and more.​ Life at DePaul Find out about student life at DePaul, including campus housing, social events, athletics, internships, life in Chicago and more. Campus Housing Take a look at the residence halls, suites and apartments we have available on our Lincoln Park and Loop campuses. What’s it really like to be a student here? Go straight to the source. See DePaul through the eyes of our students at@iamdepaulon Instagram. Maya Something for everyone With all of the student groups, activities and opportunities offered at DePaul, there’s probably already a community waiting for you to join. And what doesn’t exist is easy to create. Student Organizations Make friends, expand your network and benefit your community in one of our student organizations. Learn more about our current groups and find out how to create your own. Campus Events If you’re looking for something to do, we’ve got plenty of ideas. Attend a career fair, learn new skills, play games and sports, or hear from experts at a panel that interests you. Maya Stephanie Hey! My name is Stephanie. Fall quarter marks the beginning of my Senior year. I'm majoring in Public Relations and Advertising and minoring in Marketing. Aside from being a student, I am an active member of Alpha Sigma Alpha and have interned for several companies in Chicago. I love learning more about the PR/Advertising industry and networking. I'll show you what my experience here has been all about!​ Alma"
}