{
  "url": "https://www.depaul.edu/admission-and-aid/types-of-admission/transfer-student/university-center-partnerships/harper-college-university-center/Pages/harper-baps-bus-admin.aspx",
  "title": "\r\n\tCoursework Preparation: Bachelor’s Degree Completion in Business Administration   |  University Center at Harper College  |  University Center Partnerships  |  Transfer Student  |  Types of Admission  |  Admission & Aid  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Transfer Student Prepare to Transfer Transferring Your Courses Meet Your Transfer Counselor DePaul Admission Partnership Program University Center PartnershipsUniversity Center at Harper CollegeUniversity Center of Lake County University Center at Harper College University Center of Lake County For Advisors Apply Online Request Info Visit Campus DePaul University>Admission & Aid>Types of Admission>Transfer Student>University Center Partnerships>University Center at Harper College>Coursework Preparation: Bachelor’s Degree Completion in Business Administration Coursework Preparation: Bachelor’s Degree Completion in Business Administration ​​DePaul University and Harper College have created a partnership to provide degree programs popular at both schools to students on Harper College’s campus through Harper’s University Center. As a Professional Studies/Business Administration major, you should complete the associate degree or the IAI - General Education Core Curriculum (GECC) and a few introductory courses in Business Administration at Harper College. After beginning DePaul’s cohort program, the majority of classes you'll take will be Professional Studies/Business Administration courses. Bachelor of Arts in Professional Studies (BAPS) Major in Business Administration The BAPS in Business Administration is a good fit for you if you've taken some business courses or have completed the fast track business program at Harper College. This programdoes notrequire that you have previous business coursework. You should plan to take up to 66 semester/99 quarter hours in general education and business courses at Harper College. After completing your studies at Harper, you'll complete approximately 24 courses at DePaul in: professional studies business administration requirements business administration electives general education and elective courses You will need to earn 192 quarter hours for a DePaul’s bachelor degree which you will have, or be very close to having, after completing these courses. DePaul’s classes in this program are scheduled to meet two evenings a week as apart-timeprogram, with some courses being offered online."
}