{
  "url": "https://www.depaul.edu/admission-and-aid/financial-aid/types-of-aid/federal-loans/Pages/default.aspx",
  "title": "\r\n\tFederal Loans  |  Types of Aid  |  Financial Aid  |  Admission & Aid  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Types of Aid Scholarships Federal LoansPLUS Loans PLUS Loans Private Loans Grants Military & Veteran Benefits Assistantships Study Abroad Work-Study Apply Online Request Info Visit Campus DePaul University>Admission & Aid>Financial Aid>Types of Aid>Federal Loans Federal Loans Overview of the Federal Direct Loan Program If you meet allfederal eligibility requirementsand complete a FAFSA, you, and possibly your parent, will be considered for the Federal Direct Loan Program. There are three types of Federal Direct Loans: Federal Direct Subsidized Loansare loans for undergraduate students. Eligibility is determined by your financial need from your FAFSA. Loan maximums vary according to your academic level and dependency status. The government pays the interest while you are enrolled at least half-time. Federal Direct Unsubsidized Loansare loans for undergraduate or graduate/law students. Eligibility is not based on financial need from your FAFSA. Loan maximums vary according to your academic level and dependency status. The interest on the Direct Unsubsidized Loan starts accumulating on the date of disbursement. Federal Direct PLUS Loansare credit-based loans for parents of dependent undergraduate students (Parent PLUS) or graduate/law students (Grad PLUS). Generally, borrowers are eligible if they: do not have an adverse credit history, are not in default on a federal student loan, and meet theother eligibility requirementsoutlined in the loan application. The interest starts accumulating on the date of disbursement. A borrower may request up to the amount of the cost of education minus other financial aid received, including any other educational loans. Visit theFederal Direct PLUS Loanspage for more information. Interest Rates & Origination Fee Interest rates are determined each spring for new loans being made for the upcoming award year (July 1-June 30). Interest rates are fixed for the life of the loan. There is a loan fee, known as the origination fee, deducted from your loan before you receive the funds. Find more information about federal student loan interest rates or current loan fees atFederal Student Aid. Loan Requirements If you are a first-time Federal Direct Loan borrower, you must complete aMaster Promissory Note (MPN)andonline Entrance Counselingbefore you can receive funds. Your individual loan requirements will appear as To-Do items in your Campus Connect Tasks tile. The MPN is a legal promise to repay the loan (including interest and fees). Entrance Counseling ensures you understand the terms and conditions of your loan and your rights and responsibilities. You’ll learn what a loan is, how interest accrues, your repayment options, and how to avoid delinquency and default. A PLUS Loan borrower who applies with an endorser or appeals a credit decision is required to completePLUS Credit Counseling. TheAnnual Student Loan Acknowledgementis recommended for all borrowers to understand how your loans affect your financial future. Finally, all student borrowers must completeExit Counselingto prepare for federal loan repayment. This requirement applies when you leave or fully withdraw from school. Annual Loan Maximums Undergraduate Students Your Federal Direct Loan offer is calculated based on your academic grade level at the time of awarding. If your grade level changes after you are awarded, and you wish to be considered for additional loan funding based on that change, please complete the Request to Adjust Federal Loans, available on theLoan Formswebpage. Here are the maximum loan amounts: Graduate/Law Students The above chart reflects graduate unsubsidized borrowing limits only. Refer to thePLUS Loanspage for more information on Graduate PLUS Loans. Lifetime Loan Limits There are maximum lifetime limits you can borrow in subsidized and unsubsidized loans called the aggregate loan limit. Once you reach these limits, you can no longer borrow Federal Direct Loans. While there are no set aggregate limits on the Federal Direct Grad PLUS loan, the Office of Financial Aid reserves the right to limit or refuse certification of future federal student loans on a case-by-case basis to limit excessive borrowing. Students have the right to appeal a decision to limit or refuse certification of future borrowing. More information on the appeal process is available in theFederal Direct Loan Debt Review FAQ. Receiving Federal Loan Funds Loan funds will be disbursed directly to your student account. In general, you will receive an equal amount for each term. You must be enrolled at least half time to receive a loan disbursement. Loan funds are first used to pay tuition and other university expenses. Any remaining credit, or excess amount, will be refunded based on your preference in Campus Connect. Note: If your parent has borrowed a Federal Direct Parent PLUS loan, and a credit balance occurs as a result of their loan disbursement to your student account, the credit balance will be refunded based on the preference established by your parent. Visit ourFederal Direct Parent PLUS Credit Balance FAQfor more information. Canceling Federal Loan Funds You have the right to cancel any student loan within 14 days of disbursement. If you would like to request the cancellation of a disbursed loan, contact the Office of Financial Aid at OneDePaul. Please remember that cancellation of your student loan disbursements willremovecredits already applied to your account and may result in a balance due.This balance will be your responsibility. Loan Reporting All federal student loans obtained by you or your parent are reported to and tracked in the My Aid section of yourFederal Student Aidaccount. Log in using your Federal Student Aid ID username and password. It can take up to six weeks for newly disbursed loans to reflect on your account. Your loan records are accessible to all authorized users, including schools, student loan guaranty agencies, lenders, federal agencies, and other authorized users. Only federal loan information is reported to Federal Student Aid (formerly National Student Loan Data System (NSLDS)). Private educational loan information is not reported to Federal Student Aid. You should reach out to your loan servicer for more details."
}