{
  "url": "https://www.depaul.edu/distinctions/Pages/mission-to-mars.aspx",
  "title": "\r\n\tMission to Mars  |  Distinctions  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Mission to Mars Suzanne Bell's research is contributing to long-distance space exploration. Suzanne Bell’s work is out of this world. With grants from the National Aeronautics and Space Administration (NASA), the associate professor of Industrial and Organizational Psychology is studying team composition for a mission to Mars. Getting to Mars If one is putting together a team to go to Mars, do some universal principles apply—the same as those for any team, in any context—or are the considerations unique? Bell says the answer is both. “A mission team—like any team, anywhere—needs competent people who work well together. In our models, we assume that astronauts are intelligent, that they’re experts in their technical areas, and that they have at least some teamwork skills. What’s tricky is how well individuals combine.” Bell explains that a team to Mars will need to cope with an extreme environment. They’ll be isolated and confined—in a space about the size of a studio apartment—for a long time, an estimated 2½ years. \"When four people live and work in a small space, day after day, certain combinations of personalities, okay in normal life, could become a problem,\" Bell says. \"For example, in a corporate team, a mix of extroverts and introverts can create a balanced give-and-take. But in a mission, a very sociable, talkative person could become irritating and could end up being ostracized.\" AdD​ressing the Challenges In 2013, NASA asked Bell for a literature review and operational assessment of team composition issues for long-distance space exploration. Bell was able to include students in this project, one part of which was interviewing astronauts, flight directors, and other stakeholders. “I learned a lot about how people work well together—or don’t—in small spaces and isolation, and that work set up future opportunities.” Suzanne Bell, Associate Professor of Industrial and Organizational Psychology, College of Science and Health In July of 2015, Bell started a three-year, $1 million project called CREWS: Crew Recommender for Effective Work in Space. She started the project with two researchers from Northwestern University to create an algorithm which helps NASA predict how well different combinations of people would do on a 30-month mission. Over the course of a year, they collected data in the Human Exploration Research Analog (HERA) at Johnson Space Center in Houston. As part of the research they put teams of four into isolation and confinement for 30 days, asking them to perform specific tasks under varying conditions and assessing to what extent variables—such as gender, demographics, personality types, temperament, habits, and underlying values—affect their interactions, their attitudes toward one another, and overall team performance. Bell explains that they are using what they've learned to inform the computer simulation, called an agent-based model, which allows them to play out a potential mission with thousands of virtual teams and manipulate “reality” to predict responses, like: How would particular combinations of team members react to different situations? Would those reactions change over time? The final outcome will be a Crew Recommender System. The system will also help NASA identify the problems that are most likely to occur with a chosen crew, and this information could be used to design interventions. In 2016, Bell was awarded a new grant to coordinate the work with that of Russian researchers who are addressing the same types of questions. \"This first-of-its-kind collaboration is important because long-duration space exploration will involve multiple agencies and an international crew; no one country can afford to go to Mars on its own,\" says Bell. \"Our work will focus on interpersonal relationship formation within crews. It’s really a cool project, because our Russian partners look at interpersonal compatibility a little differently. US researchers tend to use a normative approach, looking for attributes and attribute combinations that predict desired outcomes. The Russian researchers focus less on specific traits and, instead, use clever measures that assess interpersonal compatibility. The goal of the project is to integrate the two approaches, and we’ll use a novel approach to data analysis to do that.\" Involving Students Bell says she has involved at least eight graduate students and a handful of undergrads. “My students are real partners in the research: They do literature reviews, data collection, and data analysis. Some of them have been with me to Johnson Space Center to prepare the crews for isolation; some have interviewed NASA astronauts and flight planners; and recently I took one with me to Moscow for the kick-off meeting with our Russian partners.” Suzanne Bell, Associate Professor of Industrial and Organizational Psychology, College of Science and Health The knowledge and skills the students gain will be useful no matter what their interests are in the future, says Bell. Students are constantly engaged in critical and out-of-the-box thinking and continuously sharpening their research skills. “We’re developing novel data techniques and conceptual frameworks that have implications for work teams in general. It’s a pretty awesome experience.” Suzanne Bell, Associate Professor of Industrial and Organizational Psychology, College of Science and Health Learn what makes DePaul Distinctive Global Health and Human Rights Find out why researchers are working to eliminate health disparities around the world. Protein Puzzles Discover how studying a protein may lead to curing and preventing Alzheimer’s disease."
}