{
  "url": "https://www.depaul.edu/admission-and-aid/financial-aid/maintain-eligibility/sap/Pages/definitions-and-terminology.aspx",
  "title": "\r\n\tDefinitions and Terminology  |  Satisfactory Academic Progress (SAP) Policy  |  Maintain Eligibility  |  Financial Aid  |  Admission & Aid  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Maintain Eligibility Satisfactory Academic Progress (SAP) PolicyAppeal SuspensionDefinitions and Terminology Appeal Suspension Definitions and Terminology Return Title IV Aid Withdrawal from Classes Financial Aid Terms & Conditions Limits & Maximums Apply Online Request Info Visit Campus DePaul University>Admission & Aid>Financial Aid>Maintain Eligibility>Satisfactory Academic Progress (SAP) Policy>Definitions and Terminology Definitions and Terminology ​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​Terminology Related to Academic Credit Attempted Credit Hours All credit-bearing course hours, including: Transfer credit (including study abroad, joint programs, and regardless of whether they apply to your current DePaul degree requirements) Test credit Other types of academic credit (such as military, advanced placement, prior learning assessment, etc.) Repeated courses Required cumulative GPA You must maintain a minimum cumulative grade point average (GPA) to remain eligible for financial aid. Undergraduate Students: Must maintain a cumulative GPA of 2.000 or higher. Graduate/Professional Students: Must maintain a cumulative GPA equal to or higher than what is required to graduate from your program. Required minimum course completion rate You must successfully complete two-thirds (66.67%) of total your total attempted credit hours. This includes all courses you’re enrolled in after thelast day to drop courses. Every class that appears on your transcript—including W’s, F’s, andother grade notations—are included in this calculation. An incomplete grade may not count as successful completion until a grade is assigned, and will have a negative impact on your course completion rate while it is incomplete. Required term GPA If your SAP appeal is approved or you are completing a SAP academic plan, you are expected to earn a term GPA of at least 2.500 or higher. Your term requirements are located at Campus Connect > Financial Aid tile. Successfully Completed Credit Hours Any course with a passing grade (A, B, C, D or PA) is successfully completed.Any course with a non-passing grade (F, W, WA, FX, R, RG, IN, ING, AU, or M) isnotsuccessfully completed. Incomplete (IN,ING), Missing (M) and Research (R,RG) grades:These are not completed until the final grade is submitted, in accordance with university grading policy. Withdrawal grades (W, WA, and FX):These negatively impact completion rate and maximum timeframe. W and WA grades are not calculated in GPA, but an FX is calculated in the GPA as an F. Pass grade (PA):PA grades are not calculated into your GPA. If you are below the required GPA and you are on SAP warning, probation, or SAP academic plan, you must take letter-graded courses to improve your GPA. Aid may be suspended the following term if your GPA does not meet minimum SAP requirements. Students on probation or an academic plan should refer to their GPA requirement at Campus Connect > Financial Aid tile > View My FA Academic Progress. Repeated Courses Repeated and original course credits are both counted towards cumulative attempted credit hours. The repeat grade is treated in the cumulative GPA according to university policy. Refer to yourAcademic Catalogfor more information on how repeated grades are calculated in your cumulative GPA. Treatment of Repeated Coursework for Financial Aid Disbursement. Courses Taken for Audit Audited courses do not earn academic credit and are not eligible for federal, state, and institutional financial aid. They are not evaluated in the review of your SAP. Non-Credit Developmental Courses Non-credit development courses do not earn academic credit and are not eligible for federal, state, and institutional financial aid. They are not evaluated in the review of your SAP. Terminology Related to Satisfactory Academic Progress Statuses Financial Aid Warning You are eligible to receive aid in this status. Financial aid Warning is assigned when you have fallen below the minimum thresholds of SAP: cumulative GPA is below 2.000 (or higher if required by your graduate degree), or cumulative completion rate is below 66.67% (you have successfully completed fewer than 66.67% of attempted hours). If you do not meet SAP requirements at the end of your Warning term, your financial aid will be suspended. Financial Aid Suspension You are not eligible to receive federal, state, and most institutional aid in this status. Not Meeting SAP status is assigned if: you fail to meet your progress requirements after a warning, probation or academic plan status, you are a returning student or first-time aid applicant whose prior coursework does not meet SAP requirements, or you exceed or cannot complete your degree within the maximum timeframe If your SAP status is Not Meeting SAP, you can appeal by theSAP Appeal deadline. Submitting an appeal does not guarantee the reinstatement of your financial aid eligibility. Satisfactory Academic Progress (SAP) Appeal A SAP appeal is a written request from a student seeking to have their aid eligibility reinstated after aid is suspended. Please review theAppeal Financial Aid Suspensionsection for more information. Financial Aid Probation/Reinstatement Probation status is granted after a SAP appeal is approved. Probation lasts one term and your term requirements will be determined by the SAP committee. You can review your specific GPA and completion ratio requirements in Campus Connect > Financial Aid tile. SAP requirements are stricter than the requirement of your College. You may need more than one consecutive term to meet SAP requirements. If you meet your probationary requirements, but you don’t meet overall SAP requirements, you may continue onto Academic Plans 1 and 2. By the end of Academic Plan 2, you must meet SAP requirements, or you will be suspended."
}