{
  "url": "https://www.depaul.edu/admission-and-aid/admitted/Pages/checklist-transfer-adult-spring-summer.aspx",
  "title": "\r\n\tNext Steps Checklist: Transfer/Adult – Spring and Summer  |  Admitted Students  |  Admission & Aid  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Admission & Aid Types of Admission Visit DePaul Tuition Room & Board Scholarships Financial Aid Veteran Student Test Credit & Placement Check Your Application Status Admitted Students Deadlines Immunization Apply Online Request Info Visit Campus DePaul University>Admission & Aid>Admitted Students>Next Steps Checklist: Transfer/Adult – Spring and Summer Next Steps Checklist: Transfer/Adult – Spring and Summer Get Started As a newly-admitted DePaul student, you’ll useCampus Connectto help you complete the final steps to enroll at DePaul. In Campus Connect, you’ll find your personal checklist of everything that needs to be completed. Log in toCampus Connectusing your BlueKey information. Use the menu sequence: Self Service > Admission > Next Steps > Admitted Student Response. If you’ve forgotten your Campus Connect password, use the “Recover Password” link on the login page. If you’ve not received your Campus Connect user ID, contact the Information Services Help Desk at (312) 362-8765 and inform them that you are a newly-admitted student. Reserve Your Spot Declare your intent to enroll throughCampus Connect. Log in toCampus Connectusing your BlueKey information. Use the menu sequence: Self Service > Admission > Next Steps > Admitted Student Response. Submit your $100 non-refundable tuition deposit by June 15, 2015. After this date has passed, deposits will be accepted on a space-available basis. Note: Your deposit will be credited to your student account and will be deducted from your bill after you register for classes and will only apply to the term for which you’ve been admitted. If you’ve been admitted after the deposit deadline or for a term other than the fall, submit your deposit within two weeks of receiving your acceptance packet. Make checks out to “DePaul University,” include your name and student ID in the memo space and mail to:DePaul UniversityOffice of Undergraduate Admission1 E. Jackson Blvd.Chicago, IL 60604 Submit Campus Housing Agreement Rooms are assigned on a first-come, first-served basis according to the date your Housing Agreement, prepayment, and parent/guardian voucher (if necessary) are received by DePaul Housing. To apply for housing, submit your on-campus Housing Agreement throughCampus Connect. Log in toCampus Connectusing your BlueKey information. Use the menu sequence: Self Service > Admission > Next Steps > Campus Housing. Submit your on-campus Housing Agreement. Submit the $200 prepayment. VisitDePaul Housingfor more information. Complete Placement Process and Submit Scores Prior to registering for orientation, you will need to complete DePaul’s requiredplacement testsfor writing, mathematics and modern languages (optional) online. Log in toCampus Connectusing your BlueKey information. Use the menu sequence: Self Service > Admission > Next Steps > Placement Process. If you’ve completed exams through Advanced Placement courses, College Level Examination Program (CLEP) and/or the International Baccalaureate program, you may receive course credit from DePaul based on your scores/transcripts. You may have your scores/transcripts sent electronically by the testing agency, or you may mail them to:DePaul UniversityOffice of Undergraduate Admission1 E. Jackson Blvd.Chicago, IL 60604 Learn moreabout DePaul’s Test Credit and Placement process. Please emaildpcl@depaul.eduor call(312) 362-8610with questions. Attend Orientation and Register for Classes DePaul’s orientation program will provide you with all the information you need before arriving on campus for your first day of classes. During orientation, you will meet your classmates, get acquainted with the campus and surrounding neighborhoods, meet with an academic advisor and register for classes. Sign up for New Student Orientation throughCampus Connectbeginning April 1 for students admitted to summer and fall quarters. Log in toCampus Connectusing your BlueKey information. Use the menu sequence: Self Service > Admission > Next Steps > New Student Orientation to register for orientation. Learn moreabout orientation through the Office of New Student & Family Engagement. Apply for Financial Aid You must file theFree Application for Federal Student Aid (FAFSA)in order to be considered for need-based financial aid.Submit the FAFSAas soon as possible after January 1 and no later than February 1 for maximum aid consideration for the fall quarter. Go to theFAFSAwebsite to file your FAFSA application. Use the School Code Search and select DePaul (#001671) as the school to which you would like your FAFSA information sent. Note: If you are entering DePaul in the Winter, Spring or Summer quarters, file the FAFSA as soon as possible. Visit Campus The best way for you to get a feel for what life at DePaul is like is tovisit. We offer many options for campus visits to admitted students.Learn moreand register online. Submit Final Transcript Enrollment is contingent upon satisfactory academic performance through all of your educational terms. Send us your official, final transcript from the institution you most recently attended as soon as it becomes available. Failure to submit your final transcript will prevent you from registering for classes. Submit your transcript to:DePaul UniversityOffice of Undergraduate Admission1 E. Jackson Blvd.Chicago, IL 60604 If you should fall below the academic standards on which your admission was based or exhibit a significant change in character, DePaul has the right to revoke your offer of admission, withdraw you from any courses for which you have registered and institute additional requirements for reapplication. Provide Proof of Immunization DePaul University complies with Illinois state law, which requires students to provide proof of immunization for Tetanus/Diphtheria, Measles, Mumps and Rubella.Learn moreabout the process, requirements and exemptions."
}