{
  "url": "https://www.depaul.edu/distinctions/Pages/crossing-the-line.aspx",
  "title": "\r\n\tEthics Exam: When Ordinary People Commit Extraordinary Crimes  |  Distinctions  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Ethics Exam: When Ordinary People Commit Extraordinary Crimes ​​Kelly Pope and Rick Salisbury’s award-winning 2011 educational documentary provides a framework for examining ethical dilemmas. “People ask me, ‘Can ethics be taught?’” says Kelly Pope, associate professor in the School of Accountancy. “I think the answer is ‘No, but consequences can be shown.’ And that’s what we’re doing with ‘Crossing The Line’—showing how the guy next door can get into serious ethical trouble on the job.” “The people we’ve interviewed and filmed are just like your peers, your neighbors, the people you went to college with, the parents of your kids’ friends,” Pope explains. “Really ordinary people, who have committed extraordinary crimes and ended up in prison. That’s why this film is such a great teaching tool. It’s not only about theory; rather, it shows how easy it is to slip, and then slide, into murky behavior. That creates great classroom conversations.” “Viewers have to decide whether each felon is credible or sympathetic.” Rick Salisbury, video producer at DePaul University Open To Interpretation The film is not a documentary in the style of “The Smartest Guys in the Room” or “Inside Job.” Rick Salisbury, a video producer with the Driehaus College of Business, explains: “We deliberately left out a traditional narrator because we wanted to avoid the ‘voice of God’ perspective, that all-knowing authority. Rather, in the film, people tell their own stories, and those stories are open to interpretation. Because the film is an educational tool, viewers have to decide whether each felon is credible or sympathetic: ‘I don’t believe that guy’ or ‘I can see myself in this guy.’ To make the one-hour movie, we edited about 120 hours of interview footage—a painstaking process because it was important that each story be truthful: we didn’t want to make anyone look better or worse.” Tracking down the film’s subjects took the team coast-to-coast, from a prison in Bakersfield, California to meetings with felons in New York City, Atlanta, Cincinnati, St. Louis, and Chicago. Jason Green (MSA ’13) volunteered to work on the project after seeing the film in an accounting class. “I instantly recognized a valuable opportunity to expand my skills as an auditor,” he explained. “For example, I got a chance to sit down with the former CFO of HealthSouth, Weston Smith, who had helped pull off a $3.6 billion fraud. He actually showed me how they ‘cooked the books’ in ways that auditors wouldn’t catch. It was amazing to see the technical aspects (how they did it) and the psychological motives (why they did it). What accounting connections were made? What lack of control was exploited? It’s not that hard, really, to go along with bad behavior that’s already in the system.” Pink Collar Crime For an “act two,” Pope is partnering with Tom Golden, adjunct professor and retired partner with PricewaterhouseCoopers (where he co-founded the firm’s Midwest division of investigation and forensic services) to explore instances of pink-collar crime—that is, women who have committed large-scale accounting fraud—possibly beginning with the case of Rita Crundwell, the former comptroller accused of stealing more than $53 million from the city of Dixon, Illinois. “All the people in the film were happy to talk to us because they recognized the greater good in shearing their stories.” Kelly Pope, assistant professor at DePaul University In fact, Pope is part of a Media Advisory group with the U.S. Marshal Service; she and her team have had access to the Crundwell horse ranch, where they’ve shot film and photographs, while interviewing marshals about the asset seizure process. “Men tend to commit white-collar crimes within a ‘good-old-boy network’ of chummy business deals,” suggests Salisbury. “Is accounting crime the same for women?” “My research suggests not,” answers Pope. “While men are drawn to sophisticated financial schemes or reporting manipulations, women tend toward embezzlement. Even more interesting, once they get the money, they shop! Often, they end up owning stuff—lots and lots of stuff—that they couldn’t possibly afford on their salaries. Now that’s audacity!” Accessible For All At this point, Pope is turning the film into a digital “product” for the easy use of teachers and students. A next step could include the packaging of extended e-case studies. “We’re moving classroom content, in the past held in books, onto technologies students want to use, like tablets,” she says. “All the people in the film were happy to talk to us because they recognized the ‘greater good’ in sharing their stories. Now it’s our duty to make this content as accessible as possible for as many people as possible—not just in academia, but also in law enforcement, business, and public service. The need for insights on ethics, everywhere, couldn’t be greater.” ■ Learn what makes DePaul Distinctive Global Health and Human Rights Find out why researchers are working to eliminate health disparities around the world. Protein Puzzles Discover how studying a protein may lead to curing and preventing Alzheimer's disease."
}