{
  "url": "https://offices.depaul.edu/student-affairs/support-services/for-specific-populations/veteran-services/Pages/military-veteran-benefits.aspx",
  "title": "\r\n\tMilitary Veteran Benefits  |  Veteran Services  |  For Specific Populations  |  Student Services  |  Division of Student Affairs | DePaul University, Chicago\r\n",
  "content": "For Specific Populations Adult Services Athletic Academic Advising Commuter Services First Generation Students International Student Services LGBTQA Student Services Multicultural Student Support Residential Students Students with Children Students with Disabilities Transfer Students Undocumented Student Support Veteran ServicesVeteran LiaisonsAdvocacy ServicesCommunity BuildingOngoing Support & ResourcesMilitary Veteran Benefits Veteran Liaisons Advocacy Services Community Building Ongoing Support & Resources Military Veteran Benefits Homeless and At-Risk Students Apply Online Request Info Visit Campus Division of Student Affairs>Student Services>For Specific Populations>Veteran Services>Military Veteran Benefits Military Veteran Benefits Veterans Affairs Educational Benefit Programs for veterans, eligible active-duty members and eligible dependents Department of Defense Tuition Assistance for active-duty service members Veteran Educational Benefits (VA) If you are a veteran of U.S. military service, an eligible active-duty member of the military or an eligible dependent (see below), you may be eligible for Veterans Affairs (VA) Educational Benefits, including the Post-9/11 GI Bill® and Yellow Ribbon Program. What VA programs are available? The Post-9/11 GI Bill® (Chapter 33)— For those who served at least 30 consecutive days on active duty after September 10, 2001 The Post-9/11 GI Bill® Yellow-Ribbon program— For qualified Post-9/11 applicants The Montgomery GI Bill® - Active Duty (Chapter 30)— For those who enlisted after 7/1/1985 The Montgomery GI Bill® - Selective Reserve (Chapter 1606) The Montgomery GI Bill® - Reservist Educational Assistance Program (Chapter 1607) The Survivors' and Dependents' Educational Assistance Program (Chapter 35)— For the spouse and children of deceased or disabled veterans The Vocational Rehabilitation Program (Chapter 31)— For disabled veterans approved by Veterans Affairs for study at DePaul The Marine Gunnery Sergeant John David Fry Scholarship— This additional provision of the Post-9/11 GI Bill® may be awarded to children of an active duty member of the Armed Forces, who has died in the line of duty, on or after September 11, 2001. Eligible children may be married and under the age of 33. If you are not sure for which educational benefits you qualify, contact the Veterans Affairs regional office in St. Louis at (888) 442-4551. Follow the telephone prompts, and you will be connected with a counselor. You also may request information through theVeterans Affairs website. Note: The Illinois Veteran's Grant (IVG) is not available for students at DePaul. The IVG is only available to students attending Illinois public universities. How do I apply? To use any VA benefit program you must first complete the VA's application for benefits, which can be found on theVeterans Affairswebsite. Once you have completed your Veterans Affairs educational benefit application forms, Veterans Affairs will send you a Certificate of Eligibility for your Veterans Affairs educational program. You should submit a copy of your Certificate of Eligibility and a copy of your DD214 along with ourVeterans Affairs Educational Benefits Formto DePaul's Office of Veteran's Affairs. More information All documents must be submitted in person when the office is open or uploaded to DePaul’ssecure upload server. Certificate of Eligibility.Apply for Veterans Educational Benefits as soon as possible through theVA website. This will provide you with your Certificate of Eligibility. If you have previously used VA Educational Benefits at another school or institution, you must also requesta change to your benefitsin order for DePaul University to submit documents on your behalf. You may either scan in or upload a high quality image of the first page of the Certificate of Eligibility to oursecure upload server. If you are using the Post 9/11 GI Bill (Ch 33), you may instead upload yourStatement of Benefits. DD-214.Submit your DD-214 to the DePaul Veteran Affairs office. You can do this byusing our Secure Upload Server. If you do not yet have your DD-214, you may do so after you have ended your time in service. If you are a dependent using your active duty sponsor’s benefits, simply annotate that on the DePaul Veteran Benefits form. You may either scan in or upload a high quality image of your entire (nonredacted) DD-214 to oursecure upload server. You may also upload a digital copy of your DD-214 from theVA’s website. DePaul Veteran Benefits Form.Submit yourVeteran Educational Benefits Formto our officeusing our Secure Upload Server. This can be completed digitally. Many commonly asked application questions are addressed on our2019-2020DePaul FAQ on the GI Bill®. Also, please review ourImportant Information for Students Using Veterans Benefits FAQ.If you have general questions about VA Educational Benefits at DePaul, please contact the Office of Veterans Affairs at(312) 362-5656​. Department of Defense Tuition Assistance (TA) DePaul will work with you to utilize your benefits to pursue your educational goals, as well as work with students who transition from TA to GI Bill® education benefits. The following branches of the military offer tuition assistance to active-duty members: Air Force Air Force Reserve Air National Guard Army Army National Guard Army Reserve Coast Guard Coast Guard Reserve Marine Corps Marine Corps Reserve Navy Navy Reserve How do I apply? Apply for TA through your branch of service. Reach out to your Educational Services Officer (ESO) to begin the application process for Tuition Assistance. Submit your TA voucher toDelores Shippin the Student Accounts Office prior to the tuition due date for the term for which you are requesting benefits. How are TA benefits processed at DePaul? Apply for TA through your branch of service. Submit your TA voucher toDelores Shippin the Student Accounts Office prior to the tuition due date for the term for which you are requesting benefits. Upon receipt of the TA voucher, your tuition account will be coded \"third party payment plan,\" which will prevent your account from becoming delinquent for the approved amount. In the event you make a change to your enrollment, you must contact your ESO to request revised TA. After grades are posted, DePaul will bill your branch of service for the benefit amount. Can I combine TA benefits with other aid or transition to the GI Bill®? If you are planning to use TA combined with any other education benefit, are transitioning from TA to GI Bill® education benefits, or wish to explore additional financial aid options, please contact the Office of Veteran Affairs at (312) 362-5656. If you have general questions about using Tuition Assistance benefits at DePaul, please contact Larry Melton at (312) 362-5656.​ GI Bill®GI Bill® is a registered trademark of the U.S. Department of Veterans Affairs (VA). More information about education benefits offered by VA is available at the official U.S. government Web site athttps://www.benefits.va.gov/gibill. GI Bill® GI Bill® is a registered trademark of the U.S. Department of Veterans Affairs (VA). More information about education benefits offered by VA is available at the official U.S. government Web site athttps://www.benefits.va.gov/gibill."
}