{
  "url": "https://www.depaul.edu/about/Pages/accreditation.aspx",
  "title": "\r\n\tAccreditation & Licensure  |  About  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "About Rankings Campuses Chicago Events Mission President Administration Distinctions History & Timeline Accreditation & Licensure Apply Online Request Info Visit Campus DePaul University>About>Accreditation & Licensure Accreditation & Licensure DePaul University is a private, not-for-profit, Catholic institution, and has been accredited by numerous associations and organizations. Institutional Accreditation DePaul University is accredited by The Higher Learning Commission. Specialized Accreditation American Bar Association, Council of the Section of Legal Education and Admissions to the Bar: Law (LAW) – professional schools American Chemical Society – Department of Chemistry, Bachelor of Science degrees in chemistry and biochemistry American Psychological Association, Committee on Accreditation: Clinical Psychology (CLPSY) – PhD doctoral programs Commission on Collegiate Nursing Education:Bachelor of Science in Nursing (BSN), Masters Entry to Nursing Practice (MENP), Master of Science in Nursing (MSN), and Doctor of Nursing Practice (DNP). Council for Accreditation of Counseling and Related Educational Programs (CACREP) : Clinical Mental Health Counseling (M.A./M.Ed. degrees), College Counseling and Student Affairs (M.A./M.Ed. degrees), and School Counseling (M.A./M.Ed. degrees) specialty areas. Council on Education for Public Health – master’s of public health Council on Social Work Education – master’s degree program in social work National Association of Schools of Music, Commission on Accreditation, Commission on Community/Junior College Accreditation: Music (MUS) – institutions and units within institutions offering degree-granting and/or non-degree granting programs National Association of Schools of Public Service and Administration – master’s degrees in public service Association to Advance Collegiate Schools of Business – International: AACSB – baccalaureate and graduate programs in business, baccalaureate and graduate programs in accounting Professional Licensure In accordance with 34 C.F.R. §668.43, and in compliance with the university’s obligations as a member of the State Authorization Reciprocity Agreement (SARA), DePaul University provides the following disclosures related to degree programs that are intended to lead to professional licensure or certification. These disclosures are strictly limited to the University’s determinations of whether these educational programs, if successfully completed, would be sufficient to meet various states’ educational licensure or certification requirements. DePaul cannot provide verification of an individual’s ability to meet licensure or certification requirements unrelated to its educational programming. Students pursuing these degrees are strongly encouraged to verify their particular situation with their intended state’s licensing entity. College of Education MA in Clinical Mental Health Counseling MA in Counseling, School Counseling Teacher Preparation (All) College of Law Juris Doctor College of Liberal Arts and Social Sciences Master of Social Work College of Science and Health MS Occupational Therapy MS Speech Language Pathology Nursing - BSN, MENP, MSN, DNP PhD, Psychology"
}