{
  "url": "https://resources.depaul.edu/career-center/Pages/default.aspx",
  "title": "\r\n\tCareer Center | DePaul University, Chicago\r\n",
  "content": "Career Center How Can We Help? Winter Quarter Office Hours TheLoop Career Centeris open M–F, 9am–5pm, in DPC 9500. TheLPC Career Centeris open M–F, 9am–5pm, in SAC 192. ​ The Career Center will beclosed Monday, December 23 – Wednesday, January 1, and Monday, January 20. Office Hours Phone:312-362-1390​ Big Inter​​view Sharpen and practice your interview skills, whether you’re interviewing for a job or applying to graduate school.Big Interviewcombines training and practice to help improve your interview technique and build your confidence. Login below using your Campus Connect info. Get Resume Help Need your resume reviewed, but too busy to meet with us? That's OK! Our Peer Career Coaches also provide asynchronous resume or LinkedIn profile reviews. Submit your resume in Word or Google Doc and a Peer Career Coach will review your resume and provide video feedback. Career Fairs & Events The Career Center offers a variety of events, fairs and workshops throughout the quarter. Connect with employers at this fall's onsite and virtual career fairs. Build your skills and make connections during one of our skills labs, resume workshops, and networking events. Handshake Handshake is your one-stop connection to a variety of career resources! Log in to search for jobs and internships, make a career advising appointment, register for events and fairs, review resources, and more. Headshots Visit one of the Career Center's Headshot Booths in either the Loop or Lincoln Park to update your professional profiles. Make an appointment on Handshake or drop-in during office hours! From Our Blog Jumpstart YOUR Job Search Building Your Brand Through Your Portfolio Making the Most of Your Internship Maximizing Keywords on Your Resume 6 Tips for Informational Interviews A Beginners Guide to Freelancing Read the latest posts on ourHire DePaul blog."
}