{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/computer-science-animation.aspx",
  "title": "\r\n\tComputer Science + Animation | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Computer Science and Animation Computer Science + Animation Where Artistic Talent Meets Technical Skills DePaul’s B.S. in Computer Science + Animation degree program blends the technical with the creative, providing you with a rare combination of programming and artistic skills that lead to success in the animation and game development industries. Here, you'll benefit from both a nationally-ranked Animation program and an industry-renowned Computer Science program that offers two concentrations: Animation Technical Director and Game Art Technical Director. The Animation Technical Director (referred to as a “TD” in the industry) concentration will teach you to serve as a bridge between animators/artists and programmers in the motion picture and television industries. The Game Art Technical Director (referred to as a “technical artists\") concentration will prepare you to be a liaison between artists, designers and programmers in the game industry. As you pursue your computer animation degree, you’ll be able to apply graphics and rendering techniques to support game or animation production. Students will be able to create tools in softwares like Maya and analyze and troubleshoot the artwork-to-render/engine pipeline on a 3D animation or game development project. You'll also learn how to utilize these skills to manage and develop the production timeline, develop features and add-ons to software, create custom tools, and work with programmers on larger software projects. The Jarvis College of Computing and Digital Media (CDM) is located on the Loop Campus, in the heart of Chicago’s technology and business districts. Our computer animation degree students gain a myriad of opportunities to work professionally with leading animation and game development companies. Many CDM faculty members are working professionals, allowing you to learn firsthand from industry experts. For international students: this program is a STEM-designated program, which can qualify you to extend your post-graduation stay in the United States. Classes Coursework 3D Animation Production 3D Modeling and Shading Rendering and Graphics Programming Design and Analysis of Algorithms Game Art Pipeline Applied 3D Geometry Resources Major Requirements Schedule of Classes Department Website Concentrations Animation Technical Director Game Art Technical Director Combined bachelor's + master's degree offered Career Options Common Career Areas 3-D modeling Game design Motion capturing Technical artist Technical director Visual effects 89% of​ Computer Science graduates were employed, continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program."
}