{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/art-media-design.aspx",
  "title": "\r\n\tArt, Media, and Design | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Art, Media, and Design (BA and BFA) Art, Media, and Design (BA and BFA) Develop your artistic voice In the Bachelor of Arts (BA) and Bachelor of Fine Arts (BFA) in Art, Media, and Design programs, you will expand your artistic potential through a broad-based education in studio art, photography and media art, or graphic art. Learn the history of and experience the creative possibilities of visual culture through a project-based curriculum in art-making. The programs emphasize fundamental artistic concepts through problem solving and experimentation in studio courses. You’ll work closely with faculty who are practicing artists in dedicated art studios on campus. As you work on your art and design degree, you’ll spend time in photography dark rooms, wood and metal workshops, and in studios in the following art areas: sculpture, printmaking, video, photography, digital photography, graphic art, painting and drawing. We offer the 3+3 BA/JD Program, which allows high-achieving first-year undergraduate students to be admitted simultaneously to the College of Liberal Arts and Social Sciences (LAS) and the College of Law (LAW). You’ll complete your first three years in LAS and your final three years in the law school. Classes Coursework Digital Tools for Visual Thinkers Thinking Photography Drawing: Figure Drawing Art and Artists in Contemporary Culture Color Theory and Application Experimental Video Art Sculpture Printmaking: Screen-printing Web Art and Design Text in the Visual Arts Painting Resources BA Major Requirements BFA Major Requirements Schedule of Classes College Website Concentrations/Tracks Graphic Art. Choose an area of specialty in: photography, or drawing/painting and printmaking, sculpture, or intermedia (video and Web art) Photography and Media Art. Choose an area of specialty in: photography, graphic art, intermedia (video and Web art), or digital photography Studio Art. Choose an area of specialty in: drawing/painting and printmaking, graphic art, sculpture or digital imaging Career Options Common Career Areas Graphic design Illustration Photography Curatorial work Exhibit design Archival work Print publication layouts and design 92% of Art, Media, and Design graduates were employed, continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program."
}