{
  "url": "https://www.depaul.edu/admission-and-aid/financial-aid/maintain-eligibility/sap/Pages/default.aspx",
  "title": "\r\n\tSatisfactory Academic Progress (SAP) Policy  |  Maintain Eligibility  |  Financial Aid  |  Admission & Aid  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Maintain Eligibility Satisfactory Academic Progress (SAP) PolicyAppeal SuspensionDefinitions and Terminology Appeal Suspension Definitions and Terminology Return Title IV Aid Withdrawal from Classes Financial Aid Terms & Conditions Limits & Maximums Apply Online Request Info Visit Campus DePaul University>Admission & Aid>Financial Aid>Maintain Eligibility>Satisfactory Academic Progress (SAP) Policy Satisfactory Academic Progress (SAP) Policy ​​Federal guidelines require that you make adequate progress toward your degree to continue to receive financial aid. This requirement is called Satisfactory Academic Progress. You can check your SAP status at any time in Campus Connect > Financial Aid Tile. There are three parts to Satisfactory Academic Progress. Each component is measured at the end of every term to determine your SAP status for the following term. You must meet all of these measures at each evaluation point to be meeting SAP. 1. Cumulative Grade Point Average (GPA) Your required cumulative GPA will depend upon your academic career. Undergraduate Students:Your cumulative GPA must be 2.000 or higher. Graduate and Professional Students:Your cumulative GPA must meet or exceed the GPA required to graduate from your program. View your program information in the academic catalog for GPA requirements or reach out to your academic advisor for more information. IN, M, PA, R, W, and WA grades do not calculate into your GPA. IN, M, and R grades that have been replaced by a letter grade will calculate into the GPA at the next SAP evaluation after the letter grade is assigned. Transfer hours from other institutions do not affect GPA. Repeat courses will impact your grade as outlined in the \"Grades, Repeating Classes\" policy in the university catalog. 2. Course Completion Rate You must successfully complete two-thirds (66.67%) of your total attempted credit hours. Every course that appears on your transcript is included in this calculation; this means that every class you’re enrolled in after thelast day to drop coursesaffects your course completion rate. F, FX, IN, M, R, W, and WA grades are not successfully completed hours, and will have a negative impact on your course completion rate. If a letter grade is assigned for an IN, M, or R grade, the new grade will be calculated into your course completion rate at the next SAP evaluation after the letter grade is assigned. Transfer hours from other institutions are counted in both attempted and completed hours. Repeating courses will increase your attempted hours and reduce your cumulative completion rate. 3. Maximum Timeframe You may not receive aid for more than 150% of the credit hours required to complete your degree. Once it is mathematically impossible for you to complete your degree within the maximum timeframe allowed as defined by the published length of your program, you are no longer eligible for aid. For most undergraduate programs requiring 192 hours for degree completion, the maximum is 288 credit hours. The completion rate for undergraduate programs requiring more than 192 hours is 150% of the hours required for the program. For graduate and professional students, maximum time frame will vary by major and is 150% of the total hours required for your program. View your program’s information in the academic catalog, run yourdegree progress report (DPR), or reach out to your academic advisor for total hours required for your program. All attempted, transfer, and test credit hours are included in your maximum timeframe calculation. If you change majors, double major, take exploratory courses, repeat classes, or add minors, you are still expected to complete your program within the maximum timeframe. Evaluation and Communication If you receive financial aid, the Office of Financial Aid evaluates your academic progress at the end of each academic term. You will be notified by email of your SAP status – even when you meet all SAP requirements. Check your SAP status at any time in Campus Connect > Financial Aid Tile. Eligibility After Degree Completion Regardless of your grades and/or SAP status, financial aid eligibility is limited. Once you have completed the requirements for your degree, you are no longer eligible for financial aid. This is true even if you have not applied for graduation and/or your degree has not been conferred. Failure to Meet SAP If you are not meeting SAP, you are ineligible for financial aid. You may re-establish aid eligibility in one of two ways: Submit a SAP appeal which is approved by the SAP Appeal Committee, or Continue taking courses without financial aid. You would be responsible for paying your balance from your own savings or other funds until you are meeting SAP requirements. Details on SAP appeals are foundhere. SAP Status There are four SAP statuses calculated at the end of each term in order to determine your eligibility for aid: Meeting SAP, Warning, Not Meeting SAP, or Probation. SAP status is posted in Campus Connect. Each status is explained below. Meeting SAP You are eligible to receive aid when Meeting SAP. You are meeting all three of the SAP components. Warning You are eligible to receive aid when on Warning. You are placed on Warning during your first term not meeting SAP. An appeal is not required to be placed on Warning. This status is assigned if: your cumulative GPA is below the minimum required by your academic career; or you have not successfully completed 66.67% or more of the total courses you have attempted. Your warning period lasts one term. If you are meeting SAP after the Warning period concludes, you will be eligible for aid the following term. If you do not meet all SAP measurements at the end of your Warning term, you will be ineligible for aid the following term. You may submit an appeal and if it is approved, your aid will be reinstated. Submitting an appeal does not guarantee the reinstatement of your financial aid eligibility. Not Meeting SAP You are not eligible to receive aid when Not Meeting SAP. This SAP status is assigned if: you fail to meet one or more SAP requirements after your warning term; you fail to meet the conditions of your approved appeal set by the SAP Appeal Committee during a term you are on probation or academic plan; you are a returning student or first-time aid applicant whose prior coursework does not meet SAP requirements; or you have exceeded or cannot complete your degree within the maximum timeframe. If your SAP status is Not Meeting SAP, you canappealby the deadline. Submitting an appeal does not guarantee the reinstatement of your financial aid eligibility. Probation You are eligible to receive aid when on Probation. This status is assigned to students who have submitted a SAP appeal that has been approved by the SAP Appeal Committee. The Appeal Committee will implement term GPA and course completion requirements to ensure you can meet SAP. If you meet the SAP measurements at the end of your Probation term, you will be eligible for aid the following term. Academic Plan You are eligible to receive aid when on an academic plan. This status is assigned to students whose SAP appeal in a prior term was approved but need more than one term to meet SAP requirements. The Appeal Committee will implement term GPA and course completion requirements to ensure you can meet SAP. If you do not meet these term requirements put in place to make sure you can meet SAP, you will be ineligible for aid the following term unless you submit a new appeal, explaining why you could not meet the term requirements, and your appeal is approved. Submitting an appeal does not guarantee the reinstatement of your financial aid eligibility. Special Situations Returning Students If you are returning to DePaul after a break of three terms or more (whether or not you attended another institution), your SAP status will be the same as your last term of enrollment. You may need to appeal for reinstatement of your aid eligibility. Submitting an appeal does not guarantee the reinstatement of your financial aid eligibility. Reach out to OneDePaul if you have questions about your SAP status. First-Time Financial Aid Applicants Any currently enrolled student applying for financial aid for the first time must meet the SAP requirements. All of your prior coursework will be evaluated to determine your current SAP status. Students Nearing the Maximum Timeframe If you are approaching the maximum timeframe you will be notified by email. You must meet with an academic advisor to plan for completion of your degree to ensure you will complete within 150% of the published length of your program. Discuss the number of remaining courses required for your degree and your anticipated graduation date. If you have questions contactOFA_SAP@depaul.eduas soon as possible. Undergraduate Students Pursuing a Second Major or Additional Minor If you are pursuing a second major or an additional minor, you are subject to the same maximum timeframe and eligibility requirements explained above. If you have completed the requirements for a first bachelor’s degree (even if you have not applied for graduation and/or the degree is not officially conferred), you are no longer eligible for federal and state financial aid programs that are restricted to one undergraduate degree. These include the Federal Pell Grant, Federal Supplemental Educational Opportunity Grant (SEOG), and the State of Illinois Monetary Award Program (MAP Grant). For more detailed information, please see ourSatisfactory Academic Progress FAQ. Second Undergraduate Degree If you are pursuing a second undergraduate degree, you are eligible only for federal student loans at the undergraduate level and are subject to the maximum timeframe component for undergraduate study. In general, this is 288 credit hours. In limited circumstances appeals will be considered if you reach this timeframe. Once it has been determined that you have fulfilled the degree requirements for the second undergraduate degree, you are no longer eligible for federal or state financial aid, as explained in the Eligibility After Degree Completion statement above."
}