{
  "url": "https://www.depaul.edu/admission-and-aid/types-of-admission/transfer-student/transferring-your-courses/Pages/default.aspx",
  "title": "\r\n\tTransferring Your Courses | DePaul University, Chicago\r\n",
  "content": "Transfer Student Prepare to Transfer Transferring Your CoursesTransfer GuidesCourse ListsTransferologyRecommended CoursesRecent Transfer Guides Course Lists Transferology Recommended Courses Recent Meet Your Transfer Counselor DePaul Admission Partnership Program University Center Partnerships For Advisors Apply Online Request Info Visit Campus DePaul University>Admission & Aid>Types of Admission>Transfer Student>Transferring Your Courses Transferring Your Courses As you plan to transfer, use these tools to help you plan coursework and determine how credits are applied to your degree requirements at DePaul. These resources help make the course transfer process as simple as possible. View ourTransfer Resources Tutorialon YouTube for instructions on using these tools. Transfer Guides Illinois community college students, use this tool to determine how courses at your current college can be applied to degree requirements for your major at DePaul. Generate a list of DePaul degree requirements and the courses that meet those requirements at your community college. Gain a better understanding of how credit transfer will work for you. Use Transfer Guides Course Lists College or university students anywhere in the world, use this tool to determine how courses at your school can be applied to Liberal Studies requirements at DePaul or transfer to the School of Continuing and Professional Studies. Generate a list of pre-approved courses, their exact equivalent course at DePaul and find out which Liberal Studies/General Education requirement the class meets for DePaul. Use Course Lists Transferology Transferology is a nationwide tool that gives you detailed information onwhich colleges and universities will accept your courseworkand how your courses will apply to a program. It will give you quick answers on how your college credits will transfer to DePaul. Set up an account, add your coursework, and get your results immediately. Use Transferology Recommended Courses Some colleges at DePaul recommend you take certain courses prior to transferring. Credit by Exam Have you taken any exams for college credit? DePaul awards credit for Advanced Placement, College Level Examination Program and International Baccalaureate exams. Learn which exams DePaul accepts Transfer Articulation Center FAQ Need help understanding what your posted credits mean, transfer codes, why you didn’t receive credit, etc.? The Transfer Articulation Center (TrAC) at DePaul determines the transferability of your coursework and oversees your course credit."
}