{
  "url": "https://www.depaul.edu/admission-and-aid/Pages/default.aspx",
  "title": "\r\n\tAdmission and Aid | DePaul University | DePaul University, Chicago\r\n",
  "content": "Admission and Aid Admission & Aid At DePaul, we take pride in providing an unparalleled educational experience that's accessible to everyone regardless of age, gender, religion, ethnic or socioeconomic background. There are a million reasons you might apply to DePaul, but one is certain: here you'll learn by doing. Freshman Deciding where to go to college is a big decision — we want you to dream big and reach your goals. Ready to get started? Student Life There’s more to college than cram sessions and classrooms. Housing Living on campus puts you at the center of everything. DeBlogs Tap into the DePaul experience with stories from our students. Transfer We welcome almost 2,500 transfer students each year. And we’re invested in your transition. We have counselors who work exclusively with transfer students like you. Graduate You’ll be challenged by scholars and industry experts. Leverage the city of Chicago, build community connections and take part in a market-responsive education at DePaul. Adult Undergraduate Your experience counts. If you haven’t earned a four-year degree, earn credit for skills you've already mastered, create your own curriculum or follow a traditional degree program at DePaul. Other Types of Admission International|Returning|Visiting|Non-Degree|Continuing Education Find the type that best fits you. Calculating Your Costs We're going to make DePaul as affordable as possible. We offer a full range of financial aid options. Financial aid is money you are given, earn or loaned to pay for college. We award over $57 million in scholarships every year. You must submit a FAFSA to be eligible for aid. Act quickly so you don’t miss out. Already received your aid award? Learn what it takes to keep it. Next Steps If you’ve applied... You put in the work to apply and now you’re waiting... Don’t worry. You can log in to see where your application is in the process. If you’re in... Congratulations! You’ve been accepted to DePaul. Now what? You need to complete a few steps before enrolling. Read your next-steps checklist carefully. (Program-specific staff will reach out toGraduate Students.) DePaul University’s Safety & Security Information Report and Fire Safety Report is available upon request and atgo.depaul.edu/CleryASR. The report includes statistics about crimes that occurred on campus and public property immediately adjacent to campus, institutional policies concerning campus security, sexual assault and other matters. It also includes fire statistics, fire safety practices and standards of the institution. For a paper copy of the report, contact DePaul’s Clery Compliance Coordinator at (773) 325-8483."
}