{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/entrepreneurship.aspx",
  "title": "\r\n\tEntrepreneurship | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Entrepreneurship Entrepreneurship Exercise your entrepreneurial mindset DePaul’s entrepreneurship degree program will provide you with the practical knowledge needed to turn business-building concepts into industry-changing realities. Core components of the entrepreneurship program include understanding the new business venture process, recognizing ethical issues within entrepreneurial businesses and communicating effectively to business stakeholders. This rigorous curriculum will prepare you for many different career paths including starting and growing your own business, managing medium-sized enterprises, consulting and new product development. DePaul’s Driehaus College of Business is located in downtown Chicago in the heart of the city’s financial district, providing you with countless opportunities to intern and work professionally with Fortune 500 companies, local startups or any business in between. You are encouraged to complete an internship with a Chicago area business during the summer preceding either your junior or senior year. Classes Coursework Career Management Skills Business Plan Development Entrepreneurship Law Global IPOs & Venture Capital Sales Fundamentals Women Entrepreneurs Managing Projects & Teams New Product Development Resources Major Requirements Schedule of Classes Department Website Minor offered Combined bachelor’s + master’s degree offered Career Options Common Career Areas Owning a business Managing a business Consulting Investment operations Recruiting Get more information Complete the form below to receive more information about this degree program."
}