{
  "url": "https://www.depaul.edu/admission-and-aid/types-of-admission/transfer-student/university-center-partnerships/harper-college-university-center/Pages/harper-ba-comm-media.aspx",
  "title": "\r\n\tCoursework Preparation: Communication and Media (BA)  |  University Center at Harper College  |  University Center Partnerships  |  Transfer Student  |  Types of Admission  |  Admission & Aid  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Transfer Student Prepare to Transfer Transferring Your Courses Meet Your Transfer Counselor DePaul Admission Partnership Program University Center PartnershipsUniversity Center at Harper CollegeUniversity Center of Lake County University Center at Harper College University Center of Lake County For Advisors Apply Online Request Info Visit Campus DePaul University>Admission & Aid>Types of Admission>Transfer Student>University Center Partnerships>University Center at Harper College>Coursework Preparation: Communication and Media (BA) Coursework Preparation: Communication and Media (BA) DePaul University and Harper College have created a partnership to provide degree programs popular at both schools to students on Harper College’s campus through Harper’s University Center. BA in Communication and Media The BA in Communication and Media is a good fit for you if you've studied in the Mass Communication program at Harper, or taken similar courses at a different school, and you wish to have a broad based understanding of communication. Students planning to enroll in the Communication and Media degree at Harper University Center are strongly encouraged to complete the IAI General Education Core at their community college as well as the equivalents to the following DePaul courses prior to their enrollment in the program: CMN 102 Intro to Mass Communication CMN 104 Public Speaking PRAD Principles in AdvertisingorPRAD 255 Public Relations JOUR 275 Intro to Journalism After enrolling at Harper University Center, you'll complete approximately 24 courses at DePaul in: communication journalism public relations and advertising media and cinema studies an experiential learning and capstone course general education and elective courses You will need to earn 192 quarter hours for a DePaul’s bachelor degree which you will have, or be very close to having, after completing these courses. DePaul’s classes in this program are scheduled to meet Monday-Tuesday-Wednesday and Thursday mornings as a full-time program. Some courses are offered online to allow you increased flexibility."
}