{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/decision-analytics.aspx",
  "title": "\r\n\tDecision Analytics (BA) For Adult Students | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Decision Analytics (BA) For Adult Students Decision Analytics (BA) For Adult Students Build skills in emerging, in-demand data analysis DePaul’s Bachelor of Arts (BA) degree program in Decision Analytics combines interdisciplinary studies around the collection, analysis and communication of complex and dynamic data sets. The data analytics degree program is designed for working adult students who can fulfill program requirements by demonstrating what they already know from work and other life experiences. Through our data analytics degree program, you will learn how to: apply critical reasoning to both qualitative and quantitative data in context; explore new technologies; particularly database; statistical and visualization software; and better understand the organization from a systems perspective. Online Degree Options For years now, the rapid advance of technology has driven an explosion of data. Making sense of these diverse and massive data sets is key to organizational success across almost every industry. The Decision Analytics BA from DePaul’s School of Continuing and Professional Studies (SCPS) is a perfect way to forge a rewarding career in this exciting field. Here, you’ll learn to leverage quantitative and qualitative data for strategy development and decision making, bringing advanced data gathering, analysis and communication skills to enhance your value in the marketplace. This is an online degree designed for adults like you, offering the flexibility to attend class in real time or on your time. And with a generous credit transfer policy and the option to earn academic credit for life and career experience, you could earn your degree in as little as two years. Classes Coursework Advanced Data Analysis Computer Science Consumer Behavior Data Mining Database Programming Descriptive Analytics Organization Intelligence Predictive Analytics Quantitative Methods in Marketing Strategic Tools for Marketers Text Analytics Resources Major Requirements Schedule of Classes College Website Concentrations/Tracks General Computing Combined bachelor's + master's degree offered Career Options Common Career Areas Data analysis Statistics Predictive analytics Strategic marketing Get more information Complete the form below to receive more information about this degree program."
}