{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/animation.aspx",
  "title": "\r\n\tAnimation | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Animation Animation Animate your imagination DePaul’s Bachelor of Arts in Animation program emphasizes the art of animation, creativity, and critical thinking—while encouraging experimentation in form, content and medium—within a broad liberal arts context. You will learn to draw innovative connections between animation and other subjects of inspiration. To develop your animation skills, you will produce live-action videos, draw web-based shorts inspired by Hollywood or anime, or design motion graphics for film titles and commercials. The Jarvis College of Computing and Digital Media has a strong relationship with many of Chicago’s animation and production studios, allowing you to gain real-world experience as you earn your Bachelor of Arts or BFA in Animation. With professional careers in animation, production, film, art and interactive media, your faculty members can connect you with resources and opportunities as you enter the media industry. For international students: this program is a STEM-designated program, which can qualify you to extend your post-graduation stay in the United States. Classes Coursework 3-D animation Animation Production Design Drawing History of Animation Motion Graphics Narrative Development Screenwriting Stop-motion Animation Resources BA Major Requirements BFA Major Requirements Schedule of Classes Department Website Minor offered Combined bachelor's + master's degree offered Career Options Common Career Areas 3-D modeling Character animation Composition Game design Filmmaking Motion graphics Storyboarding Visual effects 82% of Animation graduates were employed, continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program."
}