{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/public-policy.aspx",
  "title": "\r\n\tPublic Policy | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Public Policy Public Policy Create solutions that become public policy In the public policy program you’ll learn the foundations of basic policy theory and research methods. As a public policy major, you’ll also examine how public policy is formulated, implemented, and evaluated over time, while you explore notions of agenda-setting and framing of issues that lead to a problem gaining the attention of the government. Public Policy majors take courses dealing with public policy theories, processes, methods of public policy analysis, and important environmental and urban policy issues. Under the guidance of a public policy professor, you’ll choose a public policy problem to analyze in-depth for your capstone course. Chicago, one of the most dynamic political scenes in the United States, offers many opportunities for you to become involved in politics and policy, non-profit organizations and advocacy organizations. Classes Coursework Public Policy and Urban Issues Public Policy and Environmental Issues Public Policy Research Methods Quantitative Public Policy Analysis Applied Urban and Environmental Economics Public Policy and the Political Process Implementation of Environmental and Urban Policy Statistics Resources Major Requirements Schedule of Classes College Website Minor offered Combined bachelor’s + master’s degree offered Career Options Common Career Areas International business Lobbying Urban development Environmental preservation/conservation work Transportation planning and development Legislation work/reform Law Human rights 100% of Public Policy graduates were employed, continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program."
}