{
  "url": "https://www.depaul.edu/admission-and-aid/financial-aid/basics/Pages/notifications.aspx",
  "title": "\r\n\tNotifications  |  Financial Aid Basics  |  Financial Aid  |  Admission & Aid  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Financial Aid Financial Aid BasicsQualify for AidApply for AidCost of AttendanceImportant DatesNotificationsPrivacy & FERPAExternal Resources Qualify for Aid Apply for Aid Cost of Attendance Important Dates Notifications Privacy & FERPA External Resources Types of Aid Receive Aid Maintain Eligibility Manage Costs Repay Loans Resources for... Forms Contact Us Apply Online Request Info Visit Campus DePaul University>Admission & Aid>Financial Aid>Financial Aid Basics>Notifications Notifications Throughout the financial aid process we will contact you to let you know the status of your application and awards. Our notifications are sent directly to your university-issued BlueM@il address (username@depaul.edu). Using Campus Connect Campus Connectis your online portal to the university. Within Campus Connect you'll find: Financial aid offer information Class schedules and registration Tuition balances and due dates DePaul students conduct most of their administrative tasks through Campus Connect. When youestablish your Campus Connect account, you are consenting to conduct your business electronically with the Office of Financial Aid. Using Campus Connect is the fastest and most secure way to do so. If you cannot and/or do not wish to participate electronically,please contact the Office of Financial Aidto discuss your options. Tasks tile We use the Task tile within Campus Connect to communicate holds and to-do items with all financial aid applicants. By monitoring these messages you'll know if we need something from you to process your financial aid application. We'll also email you whenever we post new messages to your Hold and To-Do Summary. Financial Aid tile View your financial aid award offer through the Financial Aid tile in Campus Connect. Use the \"View My Financial Aid\" menu item to review, print, accept, or decline your financial aid offers. Your Message Center stores most emails from the Office of Financial Aid – things like FAFSA reminders, financial aid offer notifications, reminders to accept, reduce, or decline your award offers, and reminders to complete any loan requirements. Review these email communications using the “Message Center” menu item in your Financial Aid tile."
}