{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/french.aspx",
  "title": "\r\n\tFrench | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>French French Immerse yourself in French language and culture Study French language, literature and culture and learn to communicate with more than 200 million French speakers in more than 50 countries. French majors are encouraged to take advantage of our study abroad programs to grow linguistically and expand their cultural understanding of French-speaking societies. DePaul sponsors two study abroad programs in Paris: one at Alliance Française and another at the Institute for the International Education of Students. We also have an exchange program at Sciences Po, an elite institution in the social sciences. For French majors interested in pursuing a career in education, the French department partners with the College of Education to award teaching degrees at the middle school and high school levels. While living in Chicago, you’ll have opportunities to explore French festivals and lectures, dine at French restaurants and see the work of French artists. We also offer the 3+3 BA/JD program, which allows high-achieving first-year undergraduate students to be admitted simultaneously to the College of Liberal Arts and Social Sciences (LAS) and the College of Law (LAW). You’ll complete your first three years in LAS and your final three years in LAW. Classes Coursework Advanced Communication Translation French Literature French Phonology and Phonetics French for Business The Romantic Movement Contemporary French Writers Resources Major Requirements Schedule of Classes College Website Concentrations/Tracks Commercial French Standard Modern Languages minor offered Combined bachelor’s + master’s degree offered Career Options Common Career Areas Public policy International business Translation services Education Immigration work Social services Law Human rights 84% of French graduates were employed, continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program."
}