{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/marketing.aspx",
  "title": "\r\n\tMarketing | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Marketing Marketing Develop tactical and strategic marketing skills As a Marketing major at DePaul, you’ll deepen your understanding of how marketing delivers value to customers and businesses. You will develop your skills for analyzing and solving market problems to create and implement marketing strategies. Choose from one of three concentrations for your bachelor’s degree in Marketing: Digital Marketing incorporates the coursework you’ll need to be successful in organizations that emphasize social media, interactive and mobile marketing. Standard Marketing provides you with the flexibility to tailor courses to fit a wide array of careers that interest you. Sales Leadership allows you to combine classroom learning with real-world experiences, preparing you for professional growth opportunities that often come with success in sales management. You’ll benefit from mentorship and career connections provided by faculty and corporate partners associated with DePaul’s Sales Leadership Center. Your bachelor’s degree in Marketing from DePaul will be enhanced by completing a directed internship with a local business in an area of marketing that fits your interest. Our Integrated Marketing Education (IME) honors sequence gives a select group of Marketing majors a hands-on opportunity to develop skills in marketing management, taking courses that focus on information gathering analysis, strategic planning or tactical decision-making. DePaul’s Driehaus College of Business is located in downtown Chicago, in the heart of the city’s business district, providing you with countless opportunities to intern and work professionally with leading businesses and marketing firms. Classes Coursework Consumer Behavior International Marketing Internet Marketing Marketing Management Marketing Analysis and Planning Mobile Marketing New Product Development Quantitative Methods Sales Strategy and Technology Social Media Marketing Resources Major Requirements Schedule of Classes Department Website Concentrations/Tracks Digital Marketing Marketing Insights Sales Leadership Minor offered Combined bachelor's + master's degree offered Career Options Common Career Areas Advertising Brand management Consumer product marketing Market research Product development Sales management Strategic planning 91% of Marketing graduates were employed, continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program."
}