{
  "url": "https://www.depaul.edu/utilities/Pages/contest-entry-rules.aspx",
  "title": "\r\n\t#MyDePaulHome Contest Entry Rules  |  Utilities  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Utilities Apply Online Request Info Visit Campus DePaul University>Utilities>Contest Entry Rules #MyDePaulHome Contest Entry Rules If you’d like to enter our university housing room decoration contest, post your photo to your Instagram grid, tag@depauluand@depaulhousing, indicate your residence hall or campus apartment building, and add the hashtag #MyDePaulHome. Your post must be public. To be eligible to win, an entrant must be a student currently living in one of DePaul’s on-campus residence halls or apartments, and must have permission to participate in this contest from each roommate assigned to the bedroom appearing in the photo(s) submitted. The first twenty (20) entrants will each receive an insulated tumbler (estimated value $10). Three (3) selected winners will each receive a $75 gift card to Target. Winners will be selected out of all entries submitted between Oct. 1 and Oct. 8, 2021. The odds of winning will depend on the total number of entries received during that time. Winning entries will be posted on@depauluon Instagram. Limit one entry per person for every one bedroom. In the event there is more than one submission for a room, subsequent entries will be disqualified. A panel of University Marketing and DePaul Housing staff will vote on the winners. Rooms will be judged based on creativity, use of color, use of space, theme, organization, and overall design. Winners will be selected at DePaul’s sole discretion and all decisions are final. Submissions must be clear images of your on-campus room; images of anything else will be disqualified. Any entries deemed inappropriate or that depict policy violations will be disqualified. The use of obscene or offensive materials or pornography within the photos will result in disqualification. All entries must comply with both the DePaul University Code of Student Responsibility and the policies outlined in the Guide to Student Housing. If policies are violated, disqualification and disciplinary action will be taken. By participating in this contest, you give DePaul University (“DePaul”) the right to reproduce, distribute, publish, display, edit, modify, create derivative works from, and otherwise use the materials submitted for any purpose in any form and on any media. No purchase is necessary to enter or to win. A purchase will not improve any entrant’s chances of winning. This contest is sponsored by DePaul University, with its principal place of business locate​d at 1 E. Jackson Blvd., Chicago, IL 60604."
}