{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/mathematical-sciences.aspx",
  "title": "\r\n\tMathematical Sciences | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Mathematical Sciences Mathematical Sciences Develop a broad foundation in mathematics In the Bachelor of Arts (BA) and the Bachelor of Science (BS) in Mathematical Sciences programs, your mathematics degree coursework will teach you fundamentals of pure and applied mathematics, preparing you for a career in mathematics, natural sciences, computer science, social sciences or business. As a mathematics degree student, you’ll choose one of the following seven concentrations: Actuarial Science Applied and Computational Mathematics Financial Mathematics Pure Mathematics Quantitative Analysis and Operations Research Statistics Individualized program (in consultation with a mathematics faculty advisor) If you’re interested in pursuing an extended independent project related to theoretical or applied mathematics, a thesis option is available. As you work towards your mathematics degree, you’ll work under the guidance of a mathematics faculty member. In addition to a multitude of combined degree programs, DePaul offers a combined bachelor’s + master’s degree in Mathematical Sciences and Pure Mathematics, as well as a combined bachelor’s + master’s degree in Mathematical Sciences and Secondary Education Mathematical Sciences. These mathematics degree programs will allow you to complete a bachelor's degree and a graduate degree in as few as five years. For international students: this program is a STEM-designated program, which can qualify you to extend your post-graduation stay in the United States. Classes Coursework Accounting Applied Regression Analysis Calculus Discrete Mathematics Economics Finance Investments and Risk Management Linear Algebra Mathematical Reasoning Probability and Statistics Resources BA Major Requirements BS Major Requirements Schedule of Classes Department Website Concentrations/Tracks Actuarial Science Applied and Computational Mathematics Financial Mathematics Pure Mathematics Quantitative Analysis and Operations Research Statistics Individualized Concentration Minor offered Combined bachelor's + master's degree offered Career Options Common Career Areas Banking Computer programming Computer science Education Finance Information analysis Insurance Risk management Sales Systems analysis 95% of Mathematical Sciences graduates were employed, continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program."
}