{
  "url": "https://events.depaul.edu",
  "title": "Events Calendar - DePaul University",
  "content": "Events Calendar Events Filter results Explore Communities All Communities Lincoln Park Loop Off Campus Share Events Submit your own event using our simpleevent submission form. It only takes a minute! Embed events anywhere on the web with ourWidget builder. Get a personalized list of events in your inbox with ourDigest emailer. 2025 DePaul Teaching and Learning Conference Fri, May 2, 2025 10am to 3pm Share 2025 DePaul Teaching and Learning Conference on Facebook Share 2025 DePaul Teaching and Learning Conference on Twitter Share 2025 DePaul Teaching and Learning Conference on LinkedIn End of Immunity: Holding World Leaders Accountable for Aggression, Genocide, War Crimes, and Crimes against Humanity Wed, Feb 26, 2025 12pm to 1:30pm College of Law, 341 Share End of Immunity: Holding World Leaders Accountable for Aggression, Genocide, War Crimes, and Crimes against Humanity on Facebook Share End of Immunity: Holding World Leaders Accountable for Aggression, Genocide, War Crimes, and Crimes against Humanity on Twitter Share End of Immunity: Holding World Leaders Accountable for Aggression, Genocide, War Crimes, and Crimes against Humanity on LinkedIn Better Teaching Through Student Feedback Mon, Mar 10, 2025 1:30pm to 2:30pm Share Better Teaching Through Student Feedback on Facebook Share Better Teaching Through Student Feedback on Twitter Share Better Teaching Through Student Feedback on LinkedIn Discover Research Networks & Impact with Scopus Wed, Apr 16, 2025 1pm to 2pm Library - Richardson Library Lincoln Park Campus, JTR 103 Stream Available Share Discover Research Networks & Impact with Scopus on Facebook Share Discover Research Networks & Impact with Scopus on Twitter Share Discover Research Networks & Impact with Scopus on LinkedIn An Evening with Mary Robinson, former President of Ireland Fri, Feb 28, 2025 5pm to 6pm McGowan South, 108 Share An Evening with Mary Robinson, former President of Ireland on Facebook Share An Evening with Mary Robinson, former President of Ireland on Twitter Share An Evening with Mary Robinson, former President of Ireland on LinkedIn Quiz Build Series: Workshop 4 - Troubleshooting in Quizzes Thu, Feb 27, 2025 12pm to 1pm Share Quiz Build Series: Workshop 4 - Troubleshooting in Quizzes on Facebook Share Quiz Build Series: Workshop 4 - Troubleshooting in Quizzes on Twitter Share Quiz Build Series: Workshop 4 - Troubleshooting in Quizzes on LinkedIn Who Belongs? Birthright Citizenship, Immigration Raids, and Sanctuary Cities Tue, Feb 25, 2025 12pm to 1pm Lewis 805 Share Who Belongs? Birthright Citizenship, Immigration Raids, and Sanctuary Cities on Facebook Share Who Belongs? Birthright Citizenship, Immigration Raids, and Sanctuary Cities on Twitter Share Who Belongs? Birthright Citizenship, Immigration Raids, and Sanctuary Cities on LinkedIn Psychedelics. Mental Health. Spirituality. Really? Mon, Mar 3, 2025 4:30pm to 6pm Student Center (Lincoln Park), 220 Share Psychedelics. Mental Health. Spirituality. Really? on Facebook Share Psychedelics. Mental Health. Spirituality. Really? on Twitter Share Psychedelics. Mental Health. Spirituality. Really? on LinkedIn The People's Church: Politics, Spirituality, and the Young Lords Tue, Mar 11, 2025 4:30pm to 6:30pm Student Center (Lincoln Park), 314AB Share The People's Church: Politics, Spirituality, and the Young Lords on Facebook Share The People's Church: Politics, Spirituality, and the Young Lords on Twitter Share The People's Church: Politics, Spirituality, and the Young Lords on LinkedIn Explore Careers in Healthcare & Science Tue, Feb 25, 2025 3pm to 6pm 2250 North Sheffield Avenue, Chicago, Illinois 60614, United States Share Explore Careers in Healthcare & Science on Facebook Share Explore Careers in Healthcare & Science on Twitter Share Explore Careers in Healthcare & Science on LinkedIn Explore Careers in Healthcare & Science Tue, Feb 25, 2025 3pm to 6pm Student Center (Lincoln Park), 120 A/B Share Explore Careers in Healthcare & Science on Facebook Share Explore Careers in Healthcare & Science on Twitter Share Explore Careers in Healthcare & Science on LinkedIn COE Winter Forum Wed, Feb 26, 2025 5:30pm to 7pm Virtual Event Share COE Winter Forum on Facebook Share COE Winter Forum on Twitter Share COE Winter Forum on LinkedIn Min. Jené's Office Tue, Feb 25, 2025 12am to 5pm Student Center (Lincoln Park) Share Min. Jené's Office on Facebook Share Min. Jené's Office on Twitter Share Min. Jené's Office on LinkedIn IP Theory and Practice 2025 - Session 3: Trademark Practice Tue, Feb 25, 2025 12pm to 1pm Lewis Center, 803 Share IP Theory and Practice 2025 - Session 3: Trademark Practice on Facebook Share IP Theory and Practice 2025 - Session 3: Trademark Practice on Twitter Share IP Theory and Practice 2025 - Session 3: Trademark Practice on LinkedIn Who Belongs? Birthright Citizenship, Immigration Raids, and Sanctuary Cities Tue, Feb 25, 2025 12pm to 1pm Lewis 805 Share Who Belongs? Birthright Citizenship, Immigration Raids, and Sanctuary Cities on Facebook Share Who Belongs? Birthright Citizenship, Immigration Raids, and Sanctuary Cities on Twitter Share Who Belongs? Birthright Citizenship, Immigration Raids, and Sanctuary Cities on LinkedIn Understanding Self & Others Group (Lincoln Park) Tue, Feb 25, 2025 1pm to 2pm Student Center (Lincoln Park), 350 Share Understanding Self & Others Group (Lincoln Park) on Facebook Share Understanding Self & Others Group (Lincoln Park) on Twitter Share Understanding Self & Others Group (Lincoln Park) on LinkedIn Chicago Quarter Staff Professional Info Session #4 Tue, Feb 25, 2025 3pm to 4pm Virtual Event Share Chicago Quarter Staff Professional Info Session #4 on Facebook Share Chicago Quarter Staff Professional Info Session #4 on Twitter Share Chicago Quarter Staff Professional Info Session #4 on LinkedIn Dungeons & Dragons Therapy (Loop) Tue, Feb 25, 2025 3pm to 5pm Lewis Center, 1400 Share Dungeons & Dragons Therapy (Loop) on Facebook Share Dungeons & Dragons Therapy (Loop) on Twitter Share Dungeons & Dragons Therapy (Loop) on LinkedIn Explore Careers in Healthcare & Science Tue, Feb 25, 2025 3pm to 6pm 2250 North Sheffield Avenue, Chicago, Illinois 60614, United States Share Explore Careers in Healthcare & Science on Facebook Share Explore Careers in Healthcare & Science on Twitter Share Explore Careers in Healthcare & Science on LinkedIn Explore Careers in Healthcare & Science Tue, Feb 25, 2025 3pm to 6pm Student Center (Lincoln Park), 120 A/B Share Explore Careers in Healthcare & Science on Facebook Share Explore Careers in Healthcare & Science on Twitter Share Explore Careers in Healthcare & Science on LinkedIn DePaul Guitar Ensemble and Showcase Concert Tue, Feb 25, 2025 7pm to 8pm Holtschneider Performance Center, Allen Recital Hall Share DePaul Guitar Ensemble and Showcase Concert on Facebook Share DePaul Guitar Ensemble and Showcase Concert on Twitter Share DePaul Guitar Ensemble and Showcase Concert on LinkedIn The Future Forward Human Library: The Wide World of Work Wed, Feb 26, 2025 12am to 12am In-Person at Arts and Letters Hall, Room TBD Share The Future Forward Human Library: The Wide World of Work on Facebook Share The Future Forward Human Library: The Wide World of Work on Twitter Share The Future Forward Human Library: The Wide World of Work on LinkedIn End of Immunity: Holding World Leaders Accountable for Aggression, Genocide, War Crimes, and Crimes against Humanity Wed, Feb 26, 2025 12pm to 1:30pm College of Law, 341 Share End of Immunity: Holding World Leaders Accountable for Aggression, Genocide, War Crimes, and Crimes against Humanity on Facebook Share End of Immunity: Holding World Leaders Accountable for Aggression, Genocide, War Crimes, and Crimes against Humanity on Twitter Share End of Immunity: Holding World Leaders Accountable for Aggression, Genocide, War Crimes, and Crimes against Humanity on LinkedIn Niro Co-Chair Presentation on Law Teaching and Artificial Intelligence Wed, Feb 26, 2025 12pm to 1:45pm Lewis Center, 905 Share Niro Co-Chair Presentation on Law Teaching and Artificial Intelligence on Facebook Share Niro Co-Chair Presentation on Law Teaching and Artificial Intelligence on Twitter Share Niro Co-Chair Presentation on Law Teaching and Artificial Intelligence on LinkedIn Planning an event? Share your event with our community by using our simple event submission form."
}