{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/women-gender-studies.aspx",
  "title": "\r\n\tWomen's and Gender Studies | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Women’s and Gender Studies Women’s and Gender Studies Examine identity and experience across societies The Women’s and Gender Studies degree program focuses on examining women’s and men’s identities and experiences in relation to gender, race, class and culture. Its curriculum addresses issues of power and resistance and connects feminist theories and research to public policy and social justice. Classes focus on feminist and social justice theory with an emphasis on agency, social responsibility, advocacy and activism. You’ll develop strong writing and critical thinking skills and learn to make connections between theory and real-world practice. Classes Coursework Women and Politics Women in the Middle East Deconstructing the Diva Growing Up Female in the U.S. Gender Violence and Resistance Female Identities: Young Adult Literature Resources Major Requirements Schedule of Classes College Website Concentrations/Tracks Gender and Human Development Gender, Culture and the Arts Individualized concentration International Perspectives Perspectives on Race and Class Social Justice and Public Policy Theoretical Perspectives Minor offered Combined bachelor’s + master’s degree offered Career Options Common Career Areas Public policy Social services Law Advocacy work Journalism Human rights 93% of Women's and Gender Studies graduates were employed, continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program."
}