{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/user-experience-design.aspx",
  "title": "\r\n\tUser Experience Design | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>User Experience Design User Experience Design Design the User Experience (UX) of the future As a UX Design major, you will learn how to analyze and evaluate existing computer interfaces as well as how to improve the design and development of interfaces for a better user experience. A major in UX Design will teach you to combine design’s technical methods with artistic principles, preparing you for a career in interactive web development. The User Experience Design program offers concentrations in design and development. The design concentration emphasizes coursework in interaction design as well as strategies for incorporating social computing into websites and mobile applications. The development concentration emphasizes coursework in information technology and interactive scripting. For international students: this program is a STEM-designated program, which can qualify you to extend your post-graduation stay in the United States. Classes Coursework Animation Art Cinema Communication Computer Science Design and Modeling Engineering Psychology Web Development Resources Major Requirements Schedule of Classes Department Website Concentrations/Tracks Design Development Minor offered Combined bachelor's + master's degree offered Career Options Common Career Areas Advertising Application development Consulting Game development Graphic design Marketing Web development Web design 93% of UX Design graduates were employed, continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program."
}