{
  "url": "https://www.depaul.edu/about/administration/Pages/thomas.aspx",
  "title": "\r\n\tTatum Thom​as, PhD | DePaul University, Chicago\r\n",
  "content": "About Rankings Campuses Chicago Events Mission President Administration Distinctions History & Timeline Accreditation & Licensure Apply Online Request Info Visit Campus DePaul University>About>Administration>Tatum Thomas, PhD ​​​​Tatum Thomas, PHDDean, School of Continuing and Professional StudiesWebsite ​​​​Tatum Thomas, PHD Dean, School of Continuing and Professional Studies Dr. Tatum Thomas became dean for DePaul’sSchool of Continuing and Professional Studieson July 1, 2020. A leader in lifelong learning, she has a deep understanding of nontraditional, urban education. Her expertise in leading and designing emerging schools of professional studies strengthens DePaul’s longstanding commitment to serve diverse learners. Prior to DePaul, Thomas served as senior associate dean of student affairs at Columbia University’s School of Professional Studies in New York City. In this role, she led strategic initiatives to increase quality, retention and student outcomes. In a previous role, she also served as the director of academic services at New York University’s School of Professional Studies. During her tenure at Columbia University, Thomas launched multiple student service units. She opened the School of Professional Studies’ first lifelong learning career center to provide resources for degree and non-degree students, in addition to alumni. The success of the pilot launch led to the opening of a second center in San Francisco. Relationships she has fostered with civic and corporate partners include Morgan Stanley, Turner Construction, the Mellon Foundation, Firelight Media and the Harlem YMCA of Greater New York. A leader in diversity and inclusion, she managed a first-of-its kind Columbia University HBCU Fellowship program. This successful program invites high-achieving undergraduate seniors to pursue master’s degrees, enhancing student readiness with a robust mix of support services and career development opportunities. At NYU’s School of Professional Studies, Thomas led key initiatives and programs. Her teams administered graduate degree programs, undergraduate degree programs, continuing education programs and interacted with accrediting bodies for curriculum administration. As part of this work, she collaborated with department chairs and faculty to manage academic portfolios and launch new programs. Thomas also established a one-stop holistic counseling unit, as well as a judiciary committee to oversee academic integrity at the Division of Programs in Business. Thomas holds a bachelor’s in psychology from Marymount Manhattan College and a master’s in higher education administration from Baruch College, City University of New York. She has a doctorate in organizational leadership from the Chicago School of Professional Psychology. She earned a certificate of management excellence from the Harvard Business School. She also is a member of Yale University’s Bouchet Society, which aims to develop a network of preeminent scholars who exemplify academic and personal excellence, and serve as examples of scholarship, leadership, character and advocacy for traditionally underrepresented groups. ​​"
}