{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/costume-technology.aspx",
  "title": "\r\n\tCostume Technology | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Costume Technology Costume Technology Create costumes for the stage and screen In the Costume Technology major, you’ll prepare to become a theatrical craftsman, draper, cutter and costume shop manager. By exploring a variety of arts and crafts related to costuming, you will learn to translate designs into the actual garments and clothing actors wear. You’ll work closely with directors, dramaturges, designers and DePaul’s Costume Shop staff to construct designs for public productions by The Theatre School. In your fourth year of the Costume Technology major, you’ll take independent study courses tailored to your interests and career goals. At the end of your fourth year, you will have the chance to take part in the annual Graduate Showcase, where you will present your portfolio to artistic directors and other members of the theatre, film and television industries. Classes Coursework Costume Design Drawing for Designers Design Production History of Dramatic Literature Stage Make-up Technical Production Theatre Crew Resources Major Requirements Schedule of Classes Department Website Combined bachelor's + master's degree offered Career Options Common Career Areas Advertising Commercial costuming Fashion design Film costuming Prop management Television costuming Theatre costuming Get more information Complete the form below to receive more information about this degree program."
}