{
  "url": "https://www.depaul.edu/admission-and-aid/admitted/Pages/next-steps-checklist-freshman.aspx",
  "title": "\r\n\tNext Steps Checklist: Freshman  |  Admitted Students  |  Admission & Aid  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Admission & Aid Types of Admission Visit DePaul Tuition Room & Board Scholarships Financial Aid Veteran Student Test Credit & Placement Check Your Application Status Admitted Students Deadlines Immunization Apply Online Request Info Visit Campus DePaul University>Admission & Aid>Admitted Students>Next Steps Checklist: Freshman Next Steps Checklist: Freshman ​Get Started As a newly-admitted DePaul student, you will need to complete the final steps to enroll at DePaul. DePaul students use two web portals to conduct business:Blue Demon DomainandCampus Connect. Blue Demon Domain Blue Demon Domainis your application and next steps portal where you’ll find your personal checklist of everything that needs to be completed. You may have set up an account when you were applying to DePaul to check on the status of your application. If you haven’t logged in yet, go to the site and set up your account. You will find instructions and links to your next steps there. Campus Connect When you were admitted to DePaul, you also should have received an email with instructions on setting up your BlueKey credentials. You will be required to use your BlueKey information to log in toCampus Connect(DePaul’s main student portal) to move through some of your next steps. Once you are enrolled at DePaul, you will use this portal for all your university transactions and administrative tasks. Please note: Your BlueKey login credentials can be used for both portals.If you’ve forgotten your password, use the “Forgot your password?” link on the login page. If you’ve not received or are having issues with your BlueKey credentials, contact the Information Services Help Desk at (312) 362-8765 and inform them that you are a newly-admitted student. Reserve Your Spot Declare your intent to enroll throughBlue Demon Domainby May 1. Submit your $200 non-refundable tuition deposit throughBlue Demon Domain.(Note: Your deposit will be credited to your student account and will be deducted from your bill after you register for classes and will only apply to the term for which you’ve been admitted.) If you’ve been admitted after the deposit deadline or for a term other than the fall, submit your deposit within two weeks of receiving your acceptance packet. Submit Campus Housing Agreement On-campus housing isn’t required or guaranteed, but students who wish to live on campus can apply for housing upon admission to DePaul. Rooms are assigned on a first-come, first-served basis according to the date your Housing Agreement, prepayment and parent/guardian voucher (if necessary) are received by DePaul Housing. Specific residence halls and roommates requests are not guaranteed. To apply for housing, submit your on-campus Housing Agreement and prepayment through the Housing link inBlue Demon Domain. F​or more information about living on campus, visit theDePaul Housingwebsite. Complete the Placement Process Prior to registering for orientation, you will need to complete DePaul’s required placement process for writing and mathematics online. Placement tests for modern languages and chemistry are optional for students planning to enroll in these courses. You can access the Placement Process inBlue Demon Domain. Learn moreabout DePaul’s Placement process. Please emaildpcl@depaul.eduor call (312) 362-8610 if you have any questions. Submit AP, CLEP or IB Scores If you’ve completed exams through Advanced Placement (AP) courses, College Level Examination Program (CLEP) and/or the International Baccalaureate (IB) program, you may receive course credit from DePaul based on your scores/transcripts. You may have your scores/transcripts sent electronically by the testing agency, or you may mail them to:DePaul UniversityOffice of Undergraduate Admission1 E. Jackson Blvd.Chicago, IL 60604Learn moreabout DePaul’s course credit by exam. Please emaildpcl@depaul.eduor call(312) 362-8610with questions. Register for Orientation and Your Advising Appointment The Premiere DePaul orientation program will provide you with all the information you need before arriving on campus for your first day of classes. During orientation, you will meet your classmates, get acquainted with the campus and surrounding neighborhoods, meet with an academic advisor and register for classes. Sign up for Premiere DePaul Orientation and your advising appointment throughBlue Demon Domainbeginning in early April for students admitted to summer and fall quarters. In order to access this registration, you’ll first need to submit your tuition deposit and complete the required placement process noted above. Learn moreabout orientation through the Office of New Student & Family Engagement. Apply for Financial Aid If you haven’t already, you must file theFree Application for Federal Student Aid (FAFSA)in order to be considered for need-based financial aid.Submit the FAFSAas soon as possible after October 1 for maximum aid consideration for the fall quarter. Go to theFAFSAwebsite to file your FAFSA application, ideally by using the IRS retrieval process. Use the School Code Search and select DePaul (#001671) as the school to which you would like your FAFSA information sent. Note: If you are entering DePaul in the winter, spring or summer quarters, file the FAFSA as soon as possible. Research and Apply for Scholarships DePaul awards scholarships for academic excellence, strong leadership, service to your community and artistic talent.Learn moreabout our scholarships. Connect with us! The best way for you to get a feel for what life at DePaul is like is toconnect with us. We offer everything from individual appointments with your admission counselors to information sessions, student panels and campus tours.Learn moreand register online. Submit Final Transcript Enrollment is contingent upon satisfactory academic performance through all of your educational terms. Send us your official, final transcript from the institution you most recently attended as soon as it becomes available. Failure to submit your final transcript will prevent you from registering for classes. Submit your transcripts electronically or by mail to:DePaul UniversityOffice of Undergraduate Admission1 E. Jackson Blvd.Chicago, IL 60604 If you should fall below the academic standards on which your admission was based or exhibit a significant change in character, DePaul has the right to revoke your offer of admission, withdraw you from any courses for which you have registered and institute additional requirements for reapplication. Provide Proof of Immunization DePaul University complies with Illinois state law, which requires all students attending a campus location to provide proof of immunization. Please view theimmunization requirementsfor more details. You can upload your records online throughBlue Demon Domain. ​"
}