{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/management-information-systems.aspx",
  "title": "\r\n\tManagement Information Systems | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Management Information Systems Management Information Systems Pair business acumen with technological skills In the Management Information Systems (MIS) program, you’ll learn both the business and technological foundations of information systems management. DePaul’s undergraduate MIS degree program will prepare you to pursue a variety of careers requiring both business and technological skills. As you earn your MIS degree, you will acquire a broad understanding of information technologies and the information systems life cycle as they apply to business processes gain the ability to identify organizational data design and manipulate databases integrate technical knowledge with an understanding of business operations DePaul is located in the heart of Chicago’s financial and business community, giving you opportunities to intern and work professionally with leading business and technology firms. Classes Coursework Accounting Applied Networks and Security Database Design and Development Economics Finance Management Systems Analysis and Design Resources Major Requirements Schedule of Classes Department Website Minor offered Combined bachelor's + master's degree offered Career Options Common Career Areas Business analysis Database administration Network administration Project management Systems analysis 93% of Management Information Systems graduates were employed, continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program."
}