{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/sociology.aspx",
  "title": "\r\n\tSociology | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Sociology Sociology Navigate the art and science of sociological theories and methods Our sociology degree program will help you develop the critical thinking skills needed to effectively observe sociological topics and become equipped to conduct sociological research. As you work toward your Sociology degree, you’ll take advantage of exploring Chicago—a laboratory for research and observation with its ethnic communities, economic development and urban issues, giving you the opportunity to access Chicago’s rich and diverse culture through service opportunities, field experience and internships. We offer combined bachelor’s + master’s degree programs including a combined bachelor’s in Sociology and a master’s in Secondary Education Social Sciences degree. These programs allow you to complete a bachelor’s degree and a graduate degree in as few as five years. We also offer the 3+3 BA/JD program, which allows high-achieving first-year undergraduate sociology degree students to be admitted simultaneously to the College of Liberal Arts and Social Sciences (LAS) and the College of Law (LAW). You’ll complete your first three years in LAS and your final three years in LAW. Classes Coursework Social Problems Statistics Sociological Theory Research Methods Work in a Globalized World Social Work and Social Welfare Social Deviance Police and the Urban Community Mass Media and Culture Resources Major Requirements Schedule of Classes College Website Minor offered Combined bachelor’s + master’s degree offered Career Options Common Career Areas Public policy Criminal justice Governmental work Education Social services Law Human rights Conflict resolution and strategy 89% of Sociology graduates were employed, continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program."
}