{
  "url": "https://www.depaul.edu/academics/graduate/programs/Pages/default.aspx",
  "title": "\r\n\tPrograms  |  Graduate  |  Academics  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Academics Undergraduate GraduateProgramsAcademic CatalogAcademic Calendar ProgramsAcademic CatalogAcademic Calendar Academic Catalog Academic Calendar Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Graduate>Programs Graduate Programs ​​Choosing a graduate school is a big decision. You’re ambitious and dedicated. So are we. Designed to fit your busy schedule DePaul graduate programs are designed to fit into your schedule. We offer courses during the day, at night and online. Our faculty are among the best, and our connections with the city of Chicago can’t be beat. * Asterisk indicates online degree completion is available.^ Caret indicates program may be paired with any undergraduate major for acombined bachelor's/master's degreeoption. Accountancy (MBA) Accountancy (MS) * Acting (MFA) Animation (MA) Animation (MFA) Applied Diplomacy (MA) Applied Mathematics (MS)* Applied Professional Studies (MA) *^ Applied Statistics (MS)* Artificial Intelligence (MS) * Arts Leadership (MFA) Audit and Advisory Services (MSAA) Bilingual-Bicultural Education (MA) Bilingual-Bicultural Education (MEd) Biological Sciences (MA) Biological Sciences (MS) Business Administration (DBA) Business Analytics (MBA) Business Analytics (MS) Business Information Technology (MS) * Business Strategy and Decision Making (MBA) Chemistry (MS) Communication and Media (MA) ^ Composition (MM) Computer and Information Sciences (PhD) Computer Science (MS) * Computer Science Technology (JD/MS) Counseling: Clinical Mental Health Counseling (MA) Counseling: Clinical Mental Health Counseling (MEd) Counseling: School Counseling (MA) Counseling: School Counseling (MEd) Creative Producing (MFA) Creative Writing and Publishing (MFA) Critical Ethnic Studies (MA) ^ Curriculum Studies (EdD) Curriculum Studies (EdS) Curriculum Studies (MA) * Curriculum Studies (MEd) * Curriculum Studies (PhD) Custom (MBA) Cybersecurity (MS) * Data Science (MS) * Digital Communication and Media Arts (MA)^ – College of Communication Digital Communication and Media Arts (MA)^ – Jarvis College of Computing and Digital Media Documentary (MFA) Early Childhood Education (MA) * Early Childhood Education (MEd) * Economics and Quantitative Analysis (MS) Education, Culture, and Society (MA) * Education, Culture, and Society (MEd) * Educational Leadership (EdD) Educational Leadership (EdS) Educational Leadership (MA) * Educational Leadership (MEd) * Educational Leadership (PhD) Elementary Education (MA) Elementary Education (MEd) English Literature and Publishing (MA) Entrepreneurship (MBA) Environmental Science (MS) ^ Film and Television (MS) Film and Television Directing (MFA) Finance (MS) Finance and Real Estate (MBA) French (MA) ^ Game Design (MFA) Game Programming (MS) * Global Educational Leadership (PhD)* Health Informatics (MS) * Health Law (LLM) History (MA) ^ Human Centered Design (PhD) Human Resources (MS) ^ Human-Computer Interaction (MS) * Information Systems (MS) * Intellectual Property Law (LLM) Interdisciplinary Studies (MA) Interdisciplinary Studies (MS) International Law (LLM) International Public Service (MS) ^ International Studies (MA) ^ International Studies Law (JD/MA) Jazz Studies (MM) Journalism (MA) ^ Law (JD) Law (JD/LLM) Law (JD/MBA) Legal Studies (MLS) * Liberal Studies (MA) Management (MBA) Marketing (MBA) Marketing (MS) ^ Marketing Analysis (MS) ^ Mathematics Education (MA)* Mathematics for Teaching (MS)* Music Education (MM) Music Performance (MM) Nonprofit Management (MNM) *^ Nursing (MS) - RN to MSN in Nursing * Nursing (MSN) - MENP for non-nurses Nursing Practice (DNP)* Occupational Therapy (MS) Philosophy (MA/PhD) Physical Education (MEd) Physics (MS) Professional Communication (MA) * Psychology – Clinical (MA/PhD) Psychology – Community (MA/PhD) Psychology – Industrial/Organizational (MA/PhD) Psychology – Psychological Science (MA/PhD) Psychology – Community (MS) Public Administration (MPA) *^ Public Health (MPH) ^ Public Health (MPH/MBA in Management) Public Policy (MPP) *^ Public Relations and Advertising (MA)^ Public Service Management (MS) *^ Public Service Management Law (JD/MS) Pure Mathematics (MS) Reading Specialist (MA) Reading Specialist (MEd) Real Estate (MS)^ Refugee and Forced Migration Studies (MS) Research Psychology (MS) Screenwriting (MFA) Secondary Education (MA) Secondary Education (MEd) Social Work (MSW) Social Work (MSW/MA in Women's and Gender Studies) Sociology (MA) ^ Software Engineering (MS) * Spanish (MA) ^ Special Education (MEd) Speech-Language Pathology (MS) Sport, Fitness and Recreation Leadership (MS) * Supply Chain Management (MS) Sustainable Urban Development (MA) ^ Taxation (LLM) Taxation (MS) * Value-Creating Education for Global Citizenship (MEd) * Value-Creating Education for Global Citizenship (PhD)* Women's and Gender Studies (MA) ^ World Language Education (MA) World Language Education (MEd) Writing and Publishing (MA) Writing, Rhetoric and Discourse (MA) ^ Want more info? We’ll send you information about your programs of interest, events and more. Just fill out the form. Or, register to attend a Graduate Admission Event. Request InformationAttend a Graduate Admission Event Online programs have been granted approval from all states and are available to out-of-state residents with the following exception for the state of Oregon: Nursing (MS) - RN to MS in Nursing."
}