{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/communication-studies.aspx",
  "title": "\r\n\tCommunication Studies | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Communication Studies Communication Studies Build a strong foundation in communication studies DePaul’s Communication Studies program encourages you to think, speak and write clearly. Because communication involves interacting with others, the courses you’ll take as a Communication Studies major will teach you to communicate in a variety of public, small group and performance-style settings. As a Communication Studies major, you’ll be encouraged to become an ethical communicator, to view events from multiple perspectives, to understand the multicultural influences of communication in today’s world and to question the basic problems of human communication in order to understand self, others and events. Because communication is involved in the majority of professions, Communication Studies majors find that this is a valuable degree, whether you’re interested in working in politics, non-profit organizations, education or research. In addition to a variety of combined degree programs, we offer a combined bachelor’s and master’s degree program, allowing you to complete a bachelor’s and a graduate degree in as few as five years. You may choose to combine your bachelor’s in Communication Studies degree with a Health Communication, Journalism, or Media and Cinema Studies master’s degree program. We also offer the 3+3 BA/JD Program, which allows high-achieving first-year undergraduate students to be admitted simultaneously to the College of Communication (CMN) and the College of Law (LAW). You’ll complete your first three years in CMN and your final three years in LAW. Classes Coursework Business and Professional Communication Conflict Management Cultural and Symbolic Criticism Interpersonal Communication Health Communication Intercultural Communication Public Speaking Research Methods Topics in Performance Resources Major Requirements Schedule of Classes Department Website Concentrations/Tracks Latino Media & Communication Minor offered Combined bachelor's + master's degree offered Career Options Common Career Areas Advertising Campaigning Creative directing Editing Fundraising Marketing Public relations Publishing Writing 94% of Communication Studies graduates were employed, continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program."
}