{
  "url": "https://www.depaul.edu/admission-and-aid/admitted/Pages/next-steps-checklist-transfer-adult.aspx",
  "title": "\r\n\tNext Steps Checklist: Transfer/Adult  |  Admitted Students  |  Admission & Aid  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Admission & Aid Types of Admission Visit DePaul Tuition Room & Board Scholarships Financial Aid Veteran Student Test Credit & Placement Check Your Application Status Admitted Students Deadlines Immunization Apply Online Request Info Visit Campus DePaul University>Admission & Aid>Admitted Students>Next Steps Checklist: Transfer/Adult Next Steps Checklist: Transfer/Adult ​​Get Started As a newly-admitted DePaul student, you will need to complete the final steps to enroll at DePaul. DePaul students use two web portals to conduct business:Blue Demon DomainandCampus Connect. Blue Demon Domain Blue Demon Domainis your application and next steps portal where you’ll find your personal checklist of everything that needs to be completed. You may have set up an account when you were applying to DePaul to check on the status of your application. If you haven’t logged in yet, go to the site and set up your account. You will find instructions and links to your next steps there. Campus Connect When you were admitted to DePaul, you also should have received a two-part email with instructions on setting up your Campus Connect account. You will be required to use theseCampus Connectlogin credentials to move through some of the above next steps. Once you are enrolled at DePaul, you will use this portal for all your university transactions and administrative tasks. Please note: Your Campus Connect login credentials can be used for both portals.If you’ve forgotten your Campus Connect password, use the “Recover Password” link on the login page. If you’ve not received your Campus Connect user ID, contact the Information Services Help Desk at (312) 362-8765 and inform them that you are a newly-admitted student. Reply to the Offer of Admission and Reserve Your Spot Please indicate your enrollment plans by replying to the offer of admission and submitting the Intent to Enroll form. Submitting this form notifies us that you intend to enroll at DePaul for the quarter stated in your acceptance letter. In order to secure your spot in the incoming class, it is highly recommended that you submit your intent to enroll within two weeks of receiving your admission notification. A tuition deposit is not required for admitted Transfer/Adult undergraduate students. Submit Campus Housing Agreement On-campus housing is guaranteed to transfer students who submit their Housing Agreement and $400 prepayment by June 1. Rooms are assigned on a first-come, first-served basis according to the date your Housing Agreement, prepayment and parent/guardian voucher (if necessary) are received by the Department of Housing. To apply for housing, submit your on-campus Housing Agreement and $400 prepayment through the Request Housing link inBlue Demon Domain. VisitDePaul Housingfor more information. Apply for Financial Aid You must file theFree Application for Federal Student Aid (FAFSA)in order to be considered for need-based financial aid.Submit the FAFSAas soon as possible after October 1 for maximum aid consideration for the fall quarter. Go to theFAFSAwebsite to file your FAFSA application. Use the School Code Search and select DePaul (#001671) as the school to which you would like your FAFSA information sent. Note: If you are entering DePaul in the Winter, Spring or Summer quarters, file the FAFSA as soon as possible. Complete Placement Process Prior to registering for orientation, you will need to complete DePaul’s required placement tests for writing, mathematics and modern languages (optional) online. You may beexemptfrom the placement process based on previous transfer credit. To see if you have already fulfilled these requirementsorto complete your placement process, go toBlue Demon Domainand use the \"Complete Your Placement Process\" link in your checklist. If you’ve completed exams through Advanced Placement courses, College Level Examination Program (CLEP) and/or the International Baccalaureate program, you may receive course credit from DePaul based on your scores/transcripts.You may have your scores/transcripts sent electronically by the testing agency, or you may mail them to:DePaul UniversityOffice of Undergraduate Admission1 E. Jackson Blvd.Chicago, IL 60604Learn moreabout DePaul’s Test Credit and Placement process.Please emaildpcl@depaul.eduor call (312) 362-8610 with questions. Transition DePaul Orientation DePaul’s transfer student orientation program –Transition DePaul– is a two-part orientation, consisting of bothonlineandon-campusexperiences. Once you’ve completed the online orientation and the placement process outlined above, you’ll be ready to register for our mandatory on-campus orientation program where you will register for classes and prepare for the upcoming quarter. Transition DePaul on-campus orientation programs are offered periodically throughout the year. Get started with your orientation experience: Log in toBlue Demon Domainto complete the Online Orientation and register for Transition DePaul. Learn morethrough the Office of New Student and Family Engagement. Contact the Office of New Student and Family Engagement at (773) 325-7360 or emailorientation@depaul.eduwith any questions. Visit Campus The best way for you to get a feel for what life at DePaul is like is to visit. We offer many options for campus visits to admitted students.Learn more and register online. Submit Final Transcript Enrollment is contingent upon satisfactory academic performance through all of your educational terms. Send us your official, final transcript from the institution you most recently attended as soon as it becomes available. Failure to submit your final transcript will prevent you from registering for classes. Submit your transcript to:DePaul UniversityOffice of Undergraduate Admission1 E. Jackson Blvd.Chicago, IL 60604 If you should fall below the academic standards on which your admission was based or exhibit a significant change in character, DePaul has the right to revoke your offer of admission, withdraw you from any courses for which you have registered and institute additional requirements for reapplication. Provide Proof of Immunization DePaul University complies with Illinois state law, which requires all students attending a campus location to provide proof of immunization. Please view theimmunization requirementsfor more details. You can upload your records online throughBlue Demon Domain."
}