{
  "url": "https://www.depaul.edu/distinctions/Pages/above-and-beyond.aspx",
  "title": "\r\n\tAbove and Beyond  |  Distinctions  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Above and Beyond Patty Gerstenblith talks about art and cultural heritage law and why the College of Law’s program stands out. Patty Gerstenblith is a Distinguished Research Professor of Law at DePaul University and director of its Center for Art, Museum and Cultural Heritage Law. She is founding president of the Lawyers’ Committee for Cultural Heritage Preservation (2005-2011), a director of the U.S. Committee of the Blue Shield (a nonprofit organization committed to the protection of cultural property worldwide during armed conflict) and immediate past co-chair of the American Bar Association’s Art and Cultural Heritage Law Committee. In 2011, she was appointed by President Barack Obama to chair the President’s Cultural Property Advisory Committee in the Department of State; during the Clinton administration, she served as a public representative. Interdisciplinary skills The discipline of art and cultural heritage law itself is a relatively new field. I have been teaching at DePaul for 30 years and have benefitted from being in the right place, at the right time: The field and I grew up together. Perhaps the aspect I like most about the field is its interdisciplinary nature: Teaching it requires some knowledge of art history, archaeology, anthropology, history, international relations and other academic fields. One thing we do well at DePaul College of Law is to look at the big picture. Here, art and cultural heritage law is affiliated with two other areas: intellectual property and international law. Both of these programs at DePaul are nationally recognized. As a result, our students graduate with a broad set of practical skills. Working with the government I have been fortunate to serve twice on the President’s Cultural Property Advisory Committee in the Department of State, currently as the Committee’s chair. The Committee makes recommendations to the Assistant Secretary of State for Educational and Cultural Affairs as to whether the United States should enter into bilateral agreements with other nations to restrict the import into the U.S. of undocumented archaeological and ethnological materials. The legislation under which the Committee operates is part of the United States’ adherence to the 1970 UNESCO Convention on the Means of Prohibiting and Preventing the Illicit Import, Export and Transfer of Ownership of Cultural Property. When this legislation was adopted in 1983, the United States was, and probably still is, the single largest end-destination country for looted antiquities and stolen artifacts. The work of the Committee is, therefore, important in establishing good relations with other countries and in helping to preserve the world’s cultural heritage. “When I say DePaul is ‘the right place’ for exploring cultural heritage, I mean that literally. Here, we appreciate and respect different cultures set against a global environment. I think this is what our mission is all about, and that is what this specialty is all about, too.” Patty Gerstenblith, Distinguished Research Professor of Law and director of its Center for Art, Museum and Cultural Heritage Law, DePaul University Bringing expertise to DePaul DePaul’s commitment to art and cultural heritage law is apparent in many ways. For one thing, I am one of the few professors in the country with this specialty who is a full-time faculty member. Also, we are continually enhancing our program. For example, we are introducing two new courses next year—one on customs law, which will address the legal interactions surrounding international trade, and one on art market transactions, which will deal with the commercial law surrounding the business of buying and selling art. Again, our students will gain skills that can be applied in several contexts. Our conferences attract scholars and practitioners from all over the country—faculty and students from other law schools, lawyers who work for museums, government agencies and auction houses, art dealers and collectors. Our National Cultural Heritage Law Moot Court Competition is the only one of its kind. This year, the competition hosted 19 teams from around the country and featured more than 75 volunteer attorney judges, including many nationally renowned cultural property experts. “These events build our prestige, while providing great networking and educational opportunities for our students.” Patty Gerstenblith, Distinguished Research Professor of Law and director of its Center for Art, Museum and Cultural Heritage Law, DePaul University We educate our students in other ways as well. Our Center for Art, Museum and Cultural Heritage Law offers them opportunities for extern/intern placements at The Field Museum, Chicago History Museum, and other nonprofit and government agencies. Students have been publishing our Journal of Art, Technology and Intellectual Property Law for more than 20 years, and they contribute research to my work and to our events. For reasons like these, I think—in fact, there’s no doubt in my mind—that DePaul’s program is the best in the country. Our students get a richer, fuller educational experience in this field than they would at any other law school. I am really proud of that. ■ Learn what makes DePaul Distinctive Global Health and Human Rights Find out why researchers are working to eliminate health disparities around the world. Protein Puzzles Discover how studying a protein may lead to curing and preventing Alzheimer’s disease."
}