{
  "url": "https://www.depaul.edu/Pages/employment-at-depaul.aspx",
  "title": "\r\n\tDePaul University | DePaul University, Chicago\r\n",
  "content": "Employment at DePaul DePaul University has nearly 21,000 students enrolled in more than 300 undergraduate majors and graduate programs. DePaul combines a strong academic foundation with real-world experience. Our main campuses are located in two legendary Chicago neighborhoods. The Loop Campus is steps away from world-class culture, art, sports, entertainment and dining. The Lincoln Park Campus is nestled in the heart of an iconic Chicago neighborhood full of history and atmosphere, just blocks away from the parks and beaches that line the shores of beautiful Lake Michigan. At DePaul, we believe that education is a benefit for the public good. DePaul employees help to provide access to a great education for a diverse student population. In addition to contributing to this meaningful work, qualified faculty and staff receive competitive pay, great benefits, tuition waivers, and generous time off. Discover all of the reasons to become a part of the DePaul community.DePaul offers a range of employment opportunities in the Loop and Lincoln Park campuses. Join our talented workforce and help provide an extraordinary educational experience to future generations! Never stop learningTuition waivers are available for qualified faculty and staff members. Here, we encourage lifelong learning. Balance work and lifeThe university strives to help its employees find balance between work and their lives away from work. Invest in your futureThe university’s 403(b) program allows you to save and receive a generous match. When you save for retirement, DePaul adds to your savings. Health and wellnessDePaul University offers its employees the choice of three medical plans, as well as wellness programs, onsite fitness centers and fitness club discounts. Search for: Faculty Jobs Staff Positions Student Employment Equal Opportunity/Affirmative Action EmployerDePaul University is an Equal Opportunity/Affirmative Action employer with a strong commitment to hiring for our mission and diversifying our faculty and staff. All qualified applicants will receive consideration for employment without regard to race, color, religion (except where religion is a bona fide occupational qualification for the job), national origin, sex, age, disability, marital status, sexual orientation, gender identity, protected veteran status or any other factor protected by law. AccommodationsQualified individuals with disabilities who wish to apply for employment at DePaul may request a Reasonable Accommodation for assistance with the application process by contactingstaffing@depaul.eduor by calling 312-362-6855. Title IX – Contact InformationFederal Title IX policy requires that all colleges and universities make known the contact information for the person responsible for coordinating its efforts to comply with Title IX responsibilities. At DePaul University, the Title IX Coordinator is Kimberlie Goldsberry. Her office is located in Lincoln Park on the 3rd floor of the Student Center, 2250 N. Sheffield Avenue. She can be reached at 312-362-8970, ortitleixcoordinator@depaul.edu. Safety & Security Information – Clery ActDePaul University’s Safety & Security Information Report and Fire Safety Report is available upon request and atgo.depaul.edu/CleryASR. The report includes statistics about crimes that occurred on campus and public property immediately adjacent to campus, institutional policies concerning campus security, sexual assault and other matters. It also includes fire statistics, fire safety practices and standards of the institution. For a paper copy of the report, contact DePaul’s Clery Compliance Coordinator at (773) 325-8483."
}