{
  "url": "https://www.depaul.edu/distinctions/Pages/first-fellow.aspx",
  "title": "\r\n\tFirst Fellow  |  Distinctions  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "First Fellow Bin Jiang, a management professor, talks about his decision to join DePaul in 2004 and his new role as the first Driehaus Fellow. “I’m so lucky,” says Bin Jiang, the recipient of a five-year grant enabled by the $30 million donation by Richard H. Driehaus to DePaul’s business school—to support the hiring and retention of extraordinary faculty. Certainly, that luck runs both ways, as Jiang has contributed excellent research and teaching to DePaul’s business school as a professor in the Department of Management. “When I was evaluating job offers, I was drawn to DePaul by the opportunity to work with our department chair, Scott Young, and other faculty on the business challenges that intrigue me, especially the complexities, both practical and ethical, in managing global supply chains,” says Jiang. “At DePaul, I’m part of a bigger ‘management’ discipline—in many schools, the subsets of management are kept separate—and that keeps me open to ideas from other areas and from my colleagues. We’re an intellectually collaborative group, and I really like that.” applying formulas In the past 10 years, Jiang has won recognition for his scholarship, including prestigious best paper awards from the Journal of Operations Management and the Academy of Management. But Jiang’s first love is teaching. “I agree wholeheartedly with DePaul’s philosophy... Students are my No. 1 priority.” Bin Jiang, Driehaus Fellow and management professor, DePaul University In the classroom, Jiang brings a “lived it” perspective based on his 16 years working in business and industry in China before coming to the United States for graduate school. He explains the value that’s added by a real-world context: “In operations management, we use a lot of formulas, but a student can’t know what they really mean unless they’re applied practically. I illustrate the principles of supply chain management with case studies based on my own experiences and those of my business friends still in China. Because I’m confident in the content, my students connect to the material better. “Case writing is very time consuming, and many schools don’t count it as research. So, those teachers are hard-pressed to use cases as a teaching tool. But in law school, students learn by cases. In medical school, they learn by cases. Business school is not an academic education; it’s a professional education. If I couldn’t provide good cases to my students, I would not be a complete teacher, and I would not be adequately preparing my students for their careers. Long after my students leave my classes, they remember the case studies!” Outsourcing production Jiang has always been drawn to supply chain management, particularly the role of outsourcing, because of the discipline’s central role in modern commerce. “Today’s competition isn’t between company and company, but between supply chain and supply chain. Being a winner means tearing down the walls between companies. As a result, there’s a lot of risk in these relationships. “For example, when a company outsources part of its production, is the other company a working horse or a Trojan horse? Will the supplier steal the other’s intellectual property or even its business? This has happened plenty of times. Given that possibility, management has to ask: ‘Does outsourcing really increase our company’s value? Or is it just a short-term advantage with long-term liabilities?’ On top of those considerations are ethical ones: Are the working conditions in the foreign company fair and safe? I’ll never consider myself an expert in supply chain management—the field is just too large, complicated and dynamic.” “I just open doors to the problems for my students; I do not define ultimate answers. I show the complications; they figure out the answers in their careers.” Bin Jiang, Driehaus Fellow and management professor, DePaul University Jiang considers the Driehaus Fellowship an affirmation of his work so far and a critical enabler of his work to come. “I’m honored to be appreciated by my peers, and I plan to use the award to explore an important, but underdeveloped, area—that of post-outsourcing management. I think—I plan—that this research will contribute to the reputation and prestige of the Driehaus College of Business.” ■ Learn what makes DePaul Distinctive Global Health and Human Rights Find out why researchers are working to eliminate health disparities around the world. Protein Puzzles Discover how studying a protein may lead to curing and preventing Alzheimer’s disease."
}