{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/leadership-studies.aspx",
  "title": "\r\n\tLeadership Studies (BA) For Adult Students | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Leadership Studies (BA) For Adult Students Leadership Studies (BA) For Adult Students Acquire transformative leadership tools and skills DePaul’s Leadership Studies degree is a multidisciplinary program for adult students. Its coursework will advance your knowledge in the theory and practice of leadership across various environments, including corporate and non-profit settings. As you work towards your organizational leadership degree, you’ll take courses offered by the School of Continuing and Professional Studies, the College of Communication, and the Department of Psychology. Our Leadership Studies degree program will develop your skills in: Communication Conflict management Developing leadership models Ethics Human interaction Negotiation Organizational change Project management Online Degree Options Whether in the corporate, small business or non-profit arena, leadership skills are fundamental to career advancement. The Bachelor of Arts in Leadership Studies program from DePaul’s School of Continuing and Professional Studies (SCPS) develops those skills through theory and practice across multiple disciplines. Designed for busy adults, this online degree offers the flexibility to attend class in real time or on your time. And DePaul’s generous credit transfer policy and the option to earn academic credit for life and career experience make it possible to earn this degree in just two years. Classes Coursework Project Management Organizational Communication Statistics Conflict Management Portfolio Development Applied Research Resources Major Requirements Schedule of Classes College Website Combined bachelor’s + master’s degree offered Career Options Common Career Areas Communications Community organization Governmental service Human resources International affairs Nonprofit work Public relations Project management Get more information Complete the form below to receive more information about this degree program."
}