{
  "url": "https://www.depaul.edu/about/administration/Pages/mccormick.aspx",
  "title": "\r\n\tBob McCormick | DePaul University, Chicago\r\n",
  "content": "About Rankings Campuses Chicago Events Mission President Administration Distinctions History & Timeline Accreditation & Licensure Apply Online Request Info Visit Campus DePaul University>About>Administration>Bob McCormick Bob McCormickVice President for Information ServicesWebsite Bob McCormick Vice President for Information Services Bob McCormick was named vice president for Information Services in 2012. He is currently responsible for a staff of more than 100 employees, who provide technology architecture, information security, application development and support, network and telecommunications services, classroom and academic technology, student computer labs and the Technology Contact Center. He also provides leadership to the teams managing DePaul’s Enterprise Resource Planning systems. Since he took over Information Services, McCormick has led several major projects at DePaul, including the replacement of the university’s core public website, the implementation of a collocated data center, implementation of a university-wide degree progress report and installation of several key student advising systems and a new electronic teaching evaluation system. McCormick previously served as director of enterprise architecture in Information Services, helping to implement an advising system, providing a paperless, 360-degree view of students for advisors at DePaul. The project was key to DePaul winning a CIO magazine “Top 100” award for excellence in 2007. In this role, he also was responsible for directing all information technology expenditures at the university and was instrumental in an upgrade of the university’s portal. McCormick’s information services career began in 2003 as a project manager for the PeopleSoft student administration system. He first began working at DePaul in 1999 on the PeopleSoft installation while a consultant with Academe Solutions, Inc. Prior to that, he was a software engineer at Northwestern University, where he helped to implement the PeopleSoft student administration system; it was one of the first universities in the country to do so. McCormick graduated with honors with a bachelor’s degree in mathematical physics from the University of Nottingham. After working as a software engineer for two years for British Rail, he moved to the U.S. in 1995 and served as a technical consultant for Inland Steel in Hammond, Ind. ​​"
}