{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/communication-media.aspx",
  "title": "\r\n\tCommunication and Media | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Communication and Media Communication and Media Study communication in a major media market The Communication and Media program is designed for students interested in multiple fields of communication. As a communication and media major, you will acquire the fundamental communication and critical thinking skills needed to enter jobs across the public, private and non-profit sectors. While pursuing a major in media and communications, you will take courses from a variety of programs in the College of Communication and School of Cinematic Arts, including Digital Cinema, Communication and Technology, Journalism, Organizational Communication, and Public Relations and Advertising. We also offer the 3+3 BA/JD Program, which allows high-achieving first-year undergraduate students to be admitted simultaneously to the College of Communication (CMN) and the College of Law (LAW). You’ll complete your first three years in CMN and your final three years in LAW. Online Degree Options A Bachelor of Arts (BA) degree in communication and media from DePaul’s College of Communication provides you with the real-world knowledge and skills you need for jobs in communication. You can complete the last two years of this program entirely online, either in real time or on your time. And with DePaul’s generous credit transfer policy, it may be possible to reduce the time and tuition costs required to earn your degree. Classes Coursework Business and Professional Communication Digital Cinema Production Documentary Studies Editing Media and Cultural Studies Public Speaking Screenwriting Storytelling and Style in Cinema Television production Resources Major Requirements Schedule of Classes Department Website Concentrations/Tracks Latino Media & Communication Minor offered Combined bachelor's + master's degree offered Career Options Common Career Areas Advertising Copywriting Creative directing Marketing Media consulting Media planning Public relations Publishing 89% of Communication and Media graduates were employed, continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program."
}