{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/lighting-design.aspx",
  "title": "\r\n\tLighting Design | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Lighting Design Lighting Design Kindle a career in lighting design The lighting design degree program simulates a real lighting designer’s professional experience while offering ample opportunities for the exploration and expansion of your creative expression. You’ll learn to visualize, create and implement your lighting designs by collaborating with directors, dramaturges, technicians and DePaul’s professional production staff. You’ll also work as a master electrician and lighting designer for workshops and public productions by The Theatre School. In the fourth year of the program, you will complete an internship in the lighting design industry in order to further gain real-world experience. At the end of your fourth year, you will have the chance to take part in the annual Graduate Showcase, where you will present your lighting designs to artistic directors and other members of the theatre, film and television industries. Classes Coursework Design Production Lighting Technology Media for Design Scene Design Survey of the Arts for Theatre Technical Drawing Theatre Crew Resources Major Requirements Schedule of Classes Department Website Combined bachelor's + master's degree offered Career Options Common Career Areas Architectural lighting design Events design Lighting systems design and installation Master electrician Museum/exhibit design Opera lighting design Theatrical lighting design Get more information Complete the form below to receive more information about this degree program."
}