{
  "url": "https://www.depaul.edu/admission-and-aid/immunization/Pages/faq.aspx",
  "title": "\r\n\tFrequently Asked Questions  |  Immunization  |  Admission & Aid  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Immunization Requirements Exemptions FAQ Apply Online Request Info Visit Campus DePaul University>Admission & Aid>Immunization>FAQ Frequently Asked Questions ​​​​This section includes questions and answers for current students, online students, alumni/former students, parents and faculty/staff. Current Students What immunizations do I need? View DePaul’s immunization requirements here. How do I locate my immunization records? If you need copies of your immunization records, there are several places you can look: Ask your parents or other caregivers if they have documents from your childhood that may have immunization records, such as baby books or journals. Check with any schools that you may have attended before (elementary, secondary, or high school) or a previously attended college or university. Check with your current or former medical doctor or health care provider. If your physician is deceased or has retired, they may have forwarded your records to another location; be sure to ask about that. Check with previous employers (including the military) who may have required immunizations while you were an employee. What if I can’t find my immunization records? If you cannot locate your immunization records, you will need to have any missing inoculations administered. Optional titer test: If you are certain that you’ve received a Measles, Mumps, or Rubella (MMR) inoculation in the past, a blood titer test can show your immunity. Contact your health care provider for further information about blood titer tests. If the test shows that you are positive, you will need to provide our office with a copy of the lab reports so that we can mark the MMR complete. I don’t have a health care provider. Where can I go to get my shots? Students without a health care provider may visit Sage Medical Group, affiliated with DePaul University and located at 1150 West Fullerton Avenue. They can be reached at (773) 549-7757. Please note there is a charge for vaccines. In addition to Sage Medical Group, students can also visit local retail pharmacies and drug stores that administer vaccinations (which, in some cases, may be of lower cost). What if I can’t get my vaccinations before I need to register? If you are unable to receive your vaccinations before needing to enroll in classes, please contact OneDePaul to discuss your options. I attended DePaul as an undergraduate student. Do I need to provide my immunization records again for graduate school? DePaul did not officially begin recording students’ immunization records until Winter of 2006. Students who were admitted prior to the Winter 2006 term and maintained continuous enrollment are not required to have immunization records on file. Those students with gaps in enrollment, students in campus housing or students that have been readmitted since this time must submit their immunization records. If you have any questions about these requirements, please contact OneDePaul. I just received an email saying my immunization status is incomplete, but I am supposed to be exempt. What should I do? Distance Learning exemption expires at the end of each term. If you have maintained your Distance Learning status, the exemption will automatically be applied before registration with no action required on your part. Please contact OneDePaul with further questions about your exemption status. I submitted my exemption form online. Will I be notified if it is approved? Yes. All new immunization submissions, including medical and religious exemptions, will take five to seven business days to review. A follow-up email will be sent to your preferred email address once the review process is complete. I attended DePaul on or before 2016. Why is my immunization status incomplete? Starting in the fall of 2016, the Department of Public Health at Illinois updated their immunization requirements. All enrolled students must provide three doses of Tetanus, Diphtheria (DTP, DPT, DTap, DT, Td or Tdap); two MMR (Measles, Mumps and Rubella); and one Meningococcal if the student is under 22 years old, taken after their 16th birthday. Why am I receiving an error message while submitting my records? If you receive the error message in the process of submitting your immunization record, please try the following suggestions: Ensure your documents are no larger than 4 MB Insure pop-up blockers are disabled Submit documents using a desktop or laptop computer (no tablets or cell phones) Try a different browser (e.g. Chrome, Firefox, Safari) Ensure documents are the correct format to be uploaded (GIF, JPG, PDF, PNG, TIF) If upload problems persist, please: Send a screenshot of the error message and the step they were on toURsupport@depaul.edu Fax the documents to 312-476-3200. Make sure that all documentation contains your full name, date of birth, and/or your student ID number. Allow five to seven business days and check the Immunization Status page in Campus Connect for updates to your record. A follow-up email will be sent to your preferred email address once the review process is complete. Online Students As an Online Student, do I need to submit Immunization records? Distance Learning students are exempt from the immunization requirement. If a student begins taking courses on one of DePaul's campuses, the student will need to submit proof of immunization. I just received an email saying my immunization status is incomplete, but I am supposed to be exempt. What should I do? Distance Learning exemption expires at the end of each term. If you have maintained your Distance Learning status, the exemption will automatically be applied before registration with no action required on your part. Please contact OneDePaul with further questions about your exemption status. Alumni/Former Students Can I request a copy of my immunization records? DePaul University does not re-release immunization records. Because of this, we recommend that you keep a copy of the form and records you submit. To view your immunization status, please use your BlueKey information to log in to Campus Connect and visit Student Resources » Immunization Status. Parents I submitted my child’s immunization records, but my son/daughter received an email that their records were not complete. What vaccinations are they missing? Due toFERPA and privacy laws, we are only allowed to disclose this information to the student. Please have your son/daughter consult their immunization grid onCampus Connect(under the For Students tab) or contactOneDePaulfor this information. How do I locate my child’s immunization records? You may try contacting your child’s previous health care providers or schools to attempt to locate your child’s records. Due to privacy laws, your child may have to request their own records. Faculty/Staff I need to add/swap a student from a class, but they have an immunization hold. What should I do? If you need to make enrollment adjustments for a student for the current term only, please contactURSupport@depaul.edu. I am a faculty/staff member and I am currently taking classes—do I need to submit my immunization records as well? Yes. As long as you are taking classes in person, you must submit the required vaccination records to meet the State of Illinois requirement."
}