{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/graphic-design.aspx",
  "title": "\r\n\tGraphic Design | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Graphic Design Graphic Design Design your future, influence the world As a Graphic Design major at DePaul, you will learn to communicate visually by studying foundational, conceptual, creative and technical graphic design principles and then applying them to illustrate real world ideas. Graphic design majors create advertisements, execute interactive and web designs, animate, and create content for social media and film title design. DePaul’s cutting edge facilities include a graphic design lab for print-based and introductory learning; Mac and PC computer facilities, as well as an interactive design lab; and gallery and critique spaces for displaying student work—both for private class-based reviews and public exhibition. The Jarvis College of Computing and Digital Media (CDM) is located in downtown Chicago, in the heart of the city’s technology and business districts, providing you many opportunities to work professionally with leading companies in graphic design. Many CDM faculty members are working professionals, allowing you to learn first-hand from leaders in the industry. Classes Coursework Animation Digital Illustration and Photography Drawing Motion Graphics Production Design Semiotics and Visual Design Typography Resources Major Requirements Schedule of Classes Department Website Combined bachelor's + master's degree offered Career Options Common Career Areas Advertising Art design Book and Web design Motion graphics Photography Title design (in cinema, games, interactive media and television) Visual design 88% of Graphic Design graduates were employed, continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program."
}