{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/computer-science.aspx",
  "title": "\r\n\tComputer Science | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Computer Science Computer Science Envision and create the future of computing DePaul’s B.S. in Computer Science program provides essential training in the foundations of computing, data storage and information processing. As a Computer Science major, you’ll develop a keen understanding of modern computer systems and master your programming and software development skills. You will learn about robotics, computer vision, intelligent systems and gaming, data mining and mobile systems. The Jarvis College of Computing and Digital Media (CDM) is located on the Loop Campus, in the heart of Chicago’s technology and business districts, providing you many opportunities to work professionally with leading companies in information systems. Many CDM faculty members are working professionals and industry consultants, allowing you to learn firsthand from thought leaders and change-makers. The B.S. in Computer Science program offers an online degree completion option where students can take their third- and fourth-year courses entirely online. For international students: this program is a STEM-designated program, which can qualify you to extend your post-graduation stay in the United States. Classes Coursework Data Structures in Java Design and Analysis of Algorithms Discrete Mathematics Multiplayer Game Development Object-oriented Software Development Technical Writing User Interface Architecture and Development Resources Major Requirements Schedule of Classes Department Website Concentrations/Tracks Game Systems Software Development Minor offered Combined bachelor's + master's degree offered Career Options Common Career Areas Applications development Computer engineering Consulting Database administration Programming Software architecture Software engineering 89% of Computer Science graduates were employed, continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program."
}