{
  "url": "https://www.depaul.edu/distinctions/Pages/fair-fight.aspx",
  "title": "\r\n\tA Fair Fight  |  Distinctions  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "A Fair Fight ​​College of Communication professor Matt Ragas received a 2011 award for his dissertation studying parallels between the news media and corporations. Matt Ragas, assistant professor, College of Communication, received the 2011 Nafziger-White-Salwen Dissertation Award from the Association for Education in Journalism and Mass Communication (AEJMC). This award recognizes the best dissertation written in the prior year across the fields of mass communication, journalism, public relations, and advertising. A paper resulting from his dissertation, “Agenda-building and agenda-setting in corporate proxy contests: Exploring influence among public relations efforts, financial media coverage and investor opinion, was named a Top Paper in the association’s PR division. “My research applies the concept of the ‘agenda-setting theory’—typically used in studying mass communication, public opinion, and political elections—to the corporate world. Agenda-setting theory says that through patterns of media coverage, the public picks up clues about the relative importance of topics in the news. In the original agenda-setting study of the 1968 presidential election, researchers found a near-perfect correlation between what undecided voters said were the most important issues and the amount of attention those issues had received in the media.” “Does this mean that the media sets the public agenda? Who decides the media’s agenda? I decided to ask those questions about corporate board-of-director elections.” “One of the best parts of my research was meeting leaders in corporate public relations. These professionals are now coming to my class to tell students what they need to know to be successful.” Matt Ragas, communication assistant professor, DePaul University “In a typical annual election, a company will nominate current board members and shareholders will approve them. Once in a while—increasingly often over the past 10 years—competing candidates will be slated by shareholder groups that are unhappy with management. Both sides—the company (acting on behalf of the incumbent) and the activist candidate—will hire PR firms to argue their positions and the business news media will cover the contest. Studying A Dynamic Exchange “In my research I looked at the coverage among seven media outlets for the five largest proxy contests in each of five years—25 elections total—and traced the correlations among the messages of each side, the amount and type of media coverage, and voting outcomes.” “Companies and investor groups spend millions of dollars on these contested elections, known as proxy fights. Is that money well spent? My research indicates two things. Firstly, issues covered in news releases tend to get the most attention in the business media, and press releases have more impact than do shareholder letters on coverage. Secondly—and this is important—media coverage does not simply ‘march to the drum beat’ of PR efforts during these elections. So, while sources do influence media content, the relationship between the two is reciprocal. Does one side tend to lead? The answer is neither simple nor absolute. In fact, the relationship is a dynamic exchange.” “As an expression of corporate democracy, a proxy contest works by forcing both sides to air issues of mutual concern. My research supports the conclusion that these contests are useful in giving shareholders more voice in management. That has a policy implication: A pending Securities and Exchange Commission rule would make elections easier to initiate and less expensive to conduct.” Drawing Conclusions “An interesting takeaway from my research is the high level of agreement among major media about issues surrounding a board election: in fact, coverage is redundant and converged. Does this mean​ that less visible, but perhaps still important, issues are being overlooked or that some voices aren’t being heard? Less prominent media might do well to explore these ‘smaller’ stories.” “One of the best parts of my research was meeting leaders in corporate public relations, and now these professionals are coming to my class to tell students what they need to know to be successful in the field. PR is a practical academic pursuit. I want to give students classical skill in critical thinking and problem-solving, but I’m also preparing them for the real world.” ■ Learn what makes DePaul Distinctive Global Health and Human Rights Find out why researchers are working to eliminate health disparities around the world. Protein Puzzles Discover how studying a protein may lead to curing and preventing Alzheimer’s disease."
}