{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/network-engineering-security.aspx",
  "title": "\r\n\tNetwork Engineering and Security | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Network Engineering and Security Network Engineering and Security Engineer the networks of tomorrow In the Network Engineering and Security degree program, you will learn the theory and practice of designing, deploying and managing both wired and wireless network technologies. As a Network Engineering major, you will gain expertise in protocols and services that enable Internet and LAN services, design and management of local and wide area networks and voice and data network convergence through VoIP technologies. You will obtain hands-on experience by working with network devices and servers in lab facilities focused on enterprise networks, security and multimedia network services. The Jarvis College of Computing and Digital Media (CDM) is located in downtown Chicago, in the heart of the city’s technology and business districts, providing you with many opportunities to work professionally with leading companies in information systems. Many CDM faculty members are working professionals, allowing you to learn first-hand from leaders in the industry. For international students: this program is a STEM-designated program, which can qualify you to extend your post-graduation stay in the United States. Classes Coursework Best Practices in Security Design Device Configuration Network Design Network Security Technologies Protocols Security Management Resources Major Requirements Schedule of Classes Department Website Concentrations/Tracks Standard Network Security Combined bachelor's + master's degree offered Career Options Common Career Areas Network design Product/vendor evaluation Programming Security infrastructure design Security management Software development System management 87% of Network Engineering graduates were employed, continuing their education or not seeking employment after graduation. Get more information Complete the form below to receive more information about this degree program."
}