{
  "url": "https://www.depaul.edu/admission-and-aid/types-of-admission/transfer-student/Pages/transfer-admission-counselors.aspx",
  "title": "\r\n\tMeet Your Transfer Counselor  |  Transfer Student  |  Types of Admission  |  Admission & Aid  |  DePaul University | DePaul University, Chicago\r\n",
  "content": "Transfer Student Prepare to Transfer Transferring Your Courses Meet Your Transfer Counselor DePaul Admission Partnership Program University Center Partnerships For Advisors Apply Online Request Info Visit Campus DePaul University>Admission & Aid>Types of Admission>Transfer Student>Meet Your Transfer Counselor Meet Your Transfer Counselor ​​​At DePaul, we have a full staff of admission counselors who specialize in serving transfer students. We can show you around, answer your questions and help you determine how your prior coursework will transfer to DePaul. Meet our transfer admission team and connect with your counselor today! Active Military/Veteran should select the counselor assigned to their current, or last, institution attended. If you are an adult (24 years old +) and have never attended college previously, you can connect withMadeline Walshfor more information. If evening appointments work better for you,schedule a virtual appointmentwith an available counselor.​ Ahtziri Alviso Transfer Admission Counselor, Transfer Recruitment & AdmissionEmail:aalviso@admission.depaul.eduPhone:(312) 362-7427, Text:(312) 667-2788Counselor For: CCC - Wilbur Wright College Elgin Community College McHenry County College Oakton Community College Rock Valley Community College Triton Community College Other Illinois Community Colleges My name is Ahtziri Alviso and I am from the northwest suburbs of Chicago and a DePaul University graduate! I graduated in the spring of 2022 with a Bachelor’s degree in International Studies/Global Affairs and Spanish. As a first-generation Latina college student from an immigrant family, I developed a strong passion for the advocacy of human rights, and diversity inclusion. Devoted to creating and fostering a vibrant community, I have held positions during my time at DePaul dedicated to serving students with similar backgrounds as mine, such as being a student assistant for the Latin American and Latino Studies Department, Center for Latino Research, Peer Leader, and Resident Advisor. I chose to work in transfer admissions after graduation because I love working with students and want to help them take advantage of all the opportunities DePaul has to offer. As a transfer admissions counselor, it is my mission to serve as a resource for students, help them accomplish their goals, and realize their full social, interpersonal, intellectual, and cultural abilities. I am so excited to continue my mission of advocacy for diversity inclusion, and to create a human-centered supportive atmosphere for all students. In my spare time I love to explore different coffee shops in the city and spend time with my family and friends. I am fluent in Spanish as well, and I am happy to help Spanish-speaking students with the transfer process! Nick DeFalco Executive Director, Transfer Recruitment & AdmissionEmail:nicholas.defalco@admission.depaul.eduPhone:(312) 362-5161Counselor for: Waubonsee Community College Cynthia Delgadillo Associate Director, Transfer Recruitment & AdmissionEmail:cynthia@admission.depaul.eduPhone:(312) 362-6529, Text:(312) 820-8417Counselor for: Arrupe College Kankakee Community College South Suburban College Illinois 4-year Private College/University My name is Cynthia Delgadillo and I am a transfer admission counselor. I’m from Blue Island, a southwest suburb of Chicago. I fell in love with DePaul being a transfer student myself and began my career in the Office of Admission after graduation. I’ve been at DePaul University for over 15 years and am a proud Double Demon, having earned both my bachelor’s and master’s in education. I chose to work in admission because I like helping students. Specifically, I like working with students that have transfer credit because I understand the excitement and frustrations that come in choosing an institution to complete their bachelor’s degree. I enjoy connecting with students and setting up a specific plan for them to ease the transfer process. I enjoy finding new restaurants for brunch as well as watching movies and shows on Netflix. My kids and I love to go to the beach or pool in the summer months. I am fluent in Spanish as well and am here to help with the transfer process. Melissa Fajardo California Regional Representative, Transfer Recruitment & AdmissionEmail:melissa.fajardo@admission.depaul.eduPhone:(213) 400-6799Territory: Alaska Arizona California Connecticut Delaware Hawaii Maine Maryland Massachusetts Michigan Nevada New Hampshire New Jersey New Mexico New York Ohio Oregon Pennsylvania Rhode Island Vermont Virginia Washington West Virginia Hi! I’m Melissa and I’m originally from Providence, Rhode Island. I currently live in San Diego, California with my 7-year-old American Bully. I have a Bachelor’s in Human Development and Family Studies and Spanish, a Master’s in Higher Education and a MBA. I have worked in Higher Education for the last 7 years. I started my career in Housing and made a smooth transition to Admissions, which I have loved. I enjoy working with students and supporting/ encouraging them to be the best version of themselves through their educational journey. I am excited to help prospectives students find a home at DePaul University! In addition to my educational and professional background, during my free time you can find me working out, working with kids (I was a full time nanny for two years), traveling, at beach and spending time with my friends Kyra Frazier Assistant Director, Transfer Recruitment & AdmissionEmail:kyraf@admission.depaul.eduPhone:(773) 325-8774, Text:(312) 820-8513Counselor For: College of Lake County/University Center of Lake County Harper College/Harper University Center CCC - Olive-Harvey College CCC - Malcolm X College CCC - Kennedy King College Hello! My name is Kyra Frazier and I am a transfer admissions counselor here at DePaul University. I am originally from the Atlanta metropolitan area. I attended Brandeis University in Waltham, MA and graduated with a B.A. in Anthropology and African/African American Studies. My experience in admission began at Emory University in Atlanta, where I worked as a first-year admission counselor for three years. My passion for increased access and opportunities for underrepresented students is central to my work in admission. I am dedicated to serving students from all academic backgrounds, but specifically transfer students. I truly enjoy connecting with students to help them evolve into the leaders, builders, and speakers of the future. Being aligned with DePaul's mission allows me the opportunity to make higher education more accessible to all. As a recent Chicago transplant, you'll find me exploring the city's incredible eats, various festivals, and breathtaking views. I am an avid sweet-tea lover and a self-taught, freelance, makeup artist in my free time. I look forward to connecting with many of you! Tara Miller Texas Regional Representative, Transfer Recruitment & AdmissionE-mail:tara.miller@admission.depaul.eduPhone:(512) 812-8480Territory: Alabama Arkansas Colorado Florida Georgia Idaho Indiana Iowa Kansas Kentucky Louisiana Minnesota Mississippi Missouri Montana Nebraska North Carolina North Dakota Oklahoma South Carolina South Dakota Tennessee Texas​ Utah Wisconsin Wyoming For my entire career, my goal has been to create equity and access to higher education. I have over 23 years of working in education. I have worked as a public-school college counselor, a community college advisor, and as an admission counselor. I believe in helping all types of students gain access to their higher education goals! I was a transfer student myself, so I understand the challenges transfer students can face. In addition to my education and professional career, my love of music, art, travel, photography, film, and storytelling influences everything I do. When I am not on one of my long walks or watching my teenage son rock out on his bass with his band in Austin, I can be found looking for new or used vinyl at one of the many record shops around town, listening to music, or planning my next trip to Chicago! I am currently the Texas Representative for Transfer Students at DePaul, and I couldn't be more excited! Fun Fact: I have one of only two known photos ofPhineas Gage(an actual relative of mine). It is published in the January 2018 National Geographic magazine, and it is also displayed at the Harvard Countway Library Medical Museum in Boston. David Villarroel Associate Director, Transfer Recruitment & AdmissionEmail:david@admission.depaul.eduPhone:(312) 362-6360, Text:(773) 347-7148Counselor For: CCC - Daley College Morton College My name is David Villarroel and I am a proud product of the Illinois transfer system. After graduating from College of DuPage with my Associates of Arts, I transferred to Northern Illinois University to pursue my bachelor’s degree. Within a few years of graduating from NIU I found myself employed at College of DuPage in the office of academic affairs and withing a few months I found my true calling, to assist and empower transfer students. During my 10 years at College of DuPage I served as an academic advisor and transfer coordinator and learned the many intricacies that make up the uniqueness of our transfer population. I have been with DePaul for the past 13 years, and each day I am grateful and encouraged by the possibilities DePaul has to offer. The decision to change jobs, work in the city, and take on new roles and responsibilities pale in comparison to what DePaul has giving me back and I want every student I meet to benefit from the same challenges and opportunities ahead of their academic journeys. In my spare time I love to travel, road trips are on the top of my list, my wife and I have driven in forty-one different states, eight countries, and three continents. I enjoy architecture, photography, and take care of a family of kitties. I am fluent in Spanish, so do not be shy si tienes pregunats sobre DePaul. Madeline Walsh Transfer Admission Counselor, Transfer Recruitment & AdmissionE-mail:mwalsh58@admission.depaul.eduPhone:(312) 362-7065, Text:(312) 872-4626Counselor for: CCC - Harold Washington CCC - Truman College Illinois Central College Heartland College Kishwaukee College Parkland College Illinois 4-year Public College/University Adults (24 years or older) with no college credit My name is Madeline Walsh and I am a transfer admissions counselor. I am originally from Cannon Falls, Minnesota, and I completed my B.A. in Public Relations at Hofstra University. I have spent the entirety of my career working with transfer students. Every student deserves the opportunity to achieve their educational goals and I am dedicated to helping my students accomplish theirs. I love working with students one-on-one to ensure they have a comprehensive, customized plan to transfer. In my free time, I love exploring Chicago and finding new restaurants to frequent. But, in my opinion, there’s nothing better than curling up on the couch with my two cats at the end of a long day. Heidi Wirth Assistant Director, Transfer Recruitment & AdmissionE-mail:hwirth@admission.depaul.eduPhone:(312) 362-5860, Text:(312) 820-8520Counselor for: College of DuPage Joliet Junior College Moraine Valley Community College Prairie State College Originally from Wrigleyville, Chicago (born and raised Cubs fan). Fun fact: I worked at Wrigley Field for four years while a student at DePaul University. I am a Double Demon. What does that mean? I earned a Bachelor of Arts in Sociology and a Master of Education in Counseling at DePaul University. I love working with Transfer students and helping you finish what you started. I believe in the mission, vision, purpose and values of DePaul University. Seeing them reflected throughout the curriculum and throughout the University as a whole is meaningful. Having loved my college experience, I find there is no better way to share that than to be an admission counselor. I am honored to represent DePaul University to prospective students."
}