{
  "url": "https://www.depaul.edu/academics/undergraduate/majors/Pages/latino-a-culture-communication.aspx",
  "title": "\r\n\tLatino/a Culture and Communication | DePaul University, Chicago\r\n",
  "content": "Academics UndergraduateMajorsCombined DegreesLiberal Studies ProgramHonors ProgramStudy AbroadAcademic CatalogAcademic Calendar Majors Combined Degrees Liberal Studies Program Honors Program Study Abroad Academic Catalog Academic Calendar Graduate Online Degrees Continuing Education Career Success Academic Catalog Colleges & Schools Research Corporate Education Academic Affairs Recent Apply Online Request Info Visit Campus DePaul University>Academics>Undergraduate>Majors>Latino/a Culture and Communication Latino/a Culture and Communication Develop communication skills without boundaries By earning your Bachelor of Arts in Latino/a Culture and Communication here, you’ll gain a comprehensive understanding of Latinos/as culturally and historically—locally, nationally and globally—while also developing critical communication skills that apply to organizational, community or media settings. Through our robust, interdisciplinary Latino/a Culture and Communication degree program—the first of its kind in the Midwest—you’ll apply what you learn to a wide range of careers, including journalism, public relations, advertising, education and social services. As you work toward your Bachelor of Arts in Latino/a Culture and Communication, you'll focus on global trends and connect them with Latin America and Latino/a communities in Chicago. And you’ll obtain international perspectives through several study abroad programs and professional guest speakers who represent different industries and areas of expertise. Our location in Chicago, the nation’s third-largest media market, opens doors to jobs, internships and valuable work experience with media companies and communication agencies focused on the Latinx community, including Univision and alternative media, such as micro-media, blogs and podcasts. Our Latino/a Culture and Communication degree program is a great foundation for you to build upon for a graduate degree in communication or the social sciences. Additionally, we offer the 3+3 BA/JD Program, which allows high-achieving first-year undergraduate students to be admitted simultaneously to the College of Liberal Arts and Social Sciences (LAS) and the College of Law (LAW). You’ll complete your first three years in LAS and your final three years in LAW. Classes Coursework Constructing Latino Communities Global Cinema Latin American Studies Latino Media and Digital Culture Literacy Latino/a Psychology Making the Most of Your Communication Internship Marketing Across Cultures Special Topics in Public Relations and Advertising Resources Major Requirements Schedule of Classes Department Website Career Options Common Career Areas Advertising Community advocacy Community organizing and service Creative directing Fundraising Media criticism Public affairs Public relations Reporting Social Media Writing and publishing 88% of College of Liberal Arts and Social Sciences graduates were employed, continuing education or pursuing other goals within six months of graduation. Get more information Complete the form below to receive more information about this degree program."
}